[
    {
        "0": "The University of Johannesburg, College of Business and Economics develops\ncritical thinkers and problem solvers who address business, economic and\nsocietal challenges. The College houses six schools and 13 departments with a\ncomprehensive range of qualifications varying from undergraduate diplomas\nand degrees to postgraduate diplomas and doctoral degrees.\nSchool of Accountancy\nDepartment of Accountancy\nDepartment of Commercial Accounting\nSchool of Consumer Intelligence and Information Systems\nDepartment of Applied Information Systems\nDepartment of Information and Knowledge Management\nDepartment of Marketing Management\nSchool of Economics\nDepartment of Economics and Econometrics\nCentre for Competition, Regulation and Economic Development\nCentre for Industrial Development\nCentre for Local Economic Development\nPublic and Environmental Economics Research Centre\nSchool of Management\nDepartment of Business Management\nDepartment of Finance and Investment Management\nDepartment of Industrial Psychology and People Management\nDepartment of Transport and Supply Chain Management\nSchool of Public Management, Governance and Public Policy\nDepartment of Public Management and Governance\nSchool of Tourism and Hospitality\nTourism Management\nHospitality Management\nFood and Beverage Operations\nThe College offers substantial and well-established programmes serving both the private\nand public sector, contributing to UJ’s vision of promoting Pan-Africanism, 4IR and\nsustainable development.\nIn order to be considered for selection for a programme, an applicant is required to comply\nwith the programme’s minimum admission criteria based on either the National Senior\nCertificate (NSC), the National Certificate (Vocational) (NCV), National Senior Certificate for\nAdults (NASCA) or Amended Senior Certificate (SC(a)).\nDue to ongoing programme reviews and the current HEQSF alignment process there\nmay be changes in diploma and degree programmes in terms of range and mix of\nqualifications, curricula and admission requirements."
    },
    {
        "0": ""
    }
]