[
    {
        "Qualification": "Environmental Sciences Stream",
        "Qualification Code": null,
        "Description": null,
        "Duration": null
    },
    {
        "Qualification": "Bachelor of Environmental Sciences",
        "Qualification Code": "(ESBBES)",
        "Description": "NSC 32 + 50% for English, 40% for Mathematics and Physical Sciences AND 50% for one of Life Sciences, Ge- ography or Agriculture.",
        "Duration": "3 years"
    },
    {
        "Qualification": "Bachelor of Earth Sciences in Mining and Environmental Geology",
        "Qualification Code": "(ESBMEG)",
        "Description": "NSC 35 + 50% pass in En- glish HG, 60% pass in Mathematics and Physical Sciences and an adequate achievement in at least three of these subjects – Agricultural Sciences, Ac- counting, Life Sciences, Economics and Geography.",
        "Duration": "4 years"
    },
    {
        "Qualification": "Bachelor of Earth Sciences in Hydrology and Water Re- sources",
        "Qualification Code": "(ESBHWR)",
        "Description": "NSC 35 + 60% pass in En- glish HG, 60% pass in Mathematics, 60% pass in Physical Sciences and an adequate achievement in at least three of these subjects – Agricultural Sciences, Accounting, Life Sciences, Economics and Geography.",
        "Duration": "4 years"
    },
    {
        "Qualification": "Bachelor of Urban and Re- gional Planning",
        "Qualification Code": "(ESBURP)",
        "Description": "NSC 35 + 50% pass in En- glish HG, 50% pass in Mathematics, 60% pass in Physical Sciences and an adequate achievement in at least three of these subjects – Agricultural Sciences, Accounting, Life Sciences, Economics and Geography.",
        "Duration": "4 years"
    },
    {
        "Qualification": "Bachelor of Environmental Sciences in Disaster Risk Reduction",
        "Qualification Code": "(ESB- DRR)",
        "Description": "NSC 35 + 50% pass in En- glish HG, 60% pass in Geography; 60% pass in either Mathematics And/ or Life Sciences and an adequate achievement in Physical Sciences and Eco- nomics.",
        "Duration": "4 Years"
    }
]