[
    {
        "Qualification": "Diploma in Fine Art",
        "ID": 1588,
        "Qualification Code": "WS7120",
        "APS": 20,
        "Description": "The programme equips students with practical skills and techniques in drawing, painting, sculpture, ceramics, and printmaking. It fosters critical thinking about their own work, society, and relevant industries, introducing students to the art market, exhibitions, and portfolio presentation for job interviews. The diploma encourages entrepreneurial spirit among students.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 40,
                "required": true
            }
        ]
    },
    {
        "Qualification": "Diploma in Fashion",
        "ID": 1589,
        "Qualification Code": "WS722",
        "APS": 21,
        "Description": "The diploma cultivates practical and theoretical proficiencies in core technical skills essential to fashion design, including pattern making, sewing, garment construction, and textiles. It also covers the use of industry-relevant software, understanding of the fashion business, basics of fashion marketing, and facilitates exposure to internship opportunities. The program aims to prepare students with a comprehensive skill set for various roles in the fashion industry.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 50,
                "required": true
            },
            {
                "subjectid": 2,
                "minmark": 30,
                "required": true
            },
            {
                "subjectid": 21,
                "minmark": 40,
                "required": true
            },
            {
                "subjectid": 7,
                "minmark": 30,
                "required": true
            }
        ]
    },
    {
        "Qualification": "Bachelor of Social Science",
        "ID": 6697,
        "Qualification Code": "WS5403",
        "APS": 27,
        "Description": "This qualification promotes academic competence, community engagement, research competence, and professionalism in social and human development knowledge and practice, using a multidisciplinary approach. It prepares candidates for work in various human development areas within government and non-government sectors.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 50,
                "required": true
            }
        ]
    },
    {
        "Qualification": "Bachelor of Social Science(ECP)",
        "ID": 934010014,
        "Qualification Code": "WS5403",
        "APS": 26,
        "Description": "This qualification promotes academic competence, community engagement, research competence, and professionalism in social and human development knowledge and practice, using a multidisciplinary approach. It prepares candidates for work in various human development areas within government and non-government sectors.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 40,
                "required": true
            }
        ]
    },
    {
        "Qualification": "Bachelor of Arts",
        "ID": 6696,
        "Qualification Code": "WS5407",
        "APS": 27,
        "Description": "This is a general degree that allows students to take 3 subjects at first year and 2 majors at second and third year. The majors must be traceable to level 1. The degree equips students with the necessary undergraduate level knowledge, in preparation for specialisation at Honours level where there is specialisation and knowledge is deepened.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 60,
                "required": true
            }
        ]
    },
    {
        "Qualification": "Bachelor of Social Work",
        "ID": 244344606,
        "Qualification Code": "WS5418",
        "APS": 28,
        "Description": "The Bachelor of Social Work is a professional 4-year degree focused on human well-being, social maladies, development, and justice. It covers various models to enhance quality of life and skills to address social inequality and poverty. The program aims to produce globally competitive graduates responsive to the psycho-socio-economic needs of marginalized, indigenous, and diverse communities in an ethical and sustainable manner.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 60,
                "required": true
            },
            ["OR",
            {"subjectid": 96, "minmark": 60, "required": true},
            {"subjectid": 97, "minmark": 60, "required": true}
            ]
        ]
    },
    {
        "Qualification": "Bachelor of Psychology",
        "ID": "WS5412",
        "Qualification Code": "WS5412",
        "APS": 28,
        "Description": "This 4-year degree trains students on various aspects of cognition, human development, and behaviour. It aims to provide a comprehensive understanding of psychological principles and their applications. The program prepares students for a wide range of careers by offering in-depth knowledge in psychology and its practical implications in real-world scenarios.",
        "Subject": [
            "AND",
            {
                "subjectid": 103,
                "minmark": 50,
                "required": true
            },
            ["OR",
            {"subjectid": 96, "minmark": 50, "required": true},
            {"subjectid": 97, "minmark": 50, "required": true}
            ]
        ]
    }
    
    
    
        
]