[
    {
        "module": "KCO110",
        "name": "Communication I",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 12\nEstimated fees: R2500\nLecturer(s): COLLETT, RJ; NYONI, VPE; VAN WYK, R;\nSyllabus\nPURPOSE\nThis module aims to develop the skills that are necessary for the student to communicate competently and effectively in the visual arts disciplines.\nLEARNING OUTCOMES\nOn completion of this module the student should be able to:\nanalyse an academic assignment question, identifying the area of research and purpose;\ntake relevant notes and present them in an organised manner by using, inter alia, mind-maps;\nresearch relevant materials from a wide variety of sources;\nplan and structure written and oral presentations;\nuse both an academic and a reflective writing style;\nuse an appropriate referencing system in order to avoid plagiarism;\ncommunicate, in various forms, an informed understanding of art theory;\nself-edit, as well as peer review academic work.\nCORE CONTENT\nAnalysis of academic questions and instructions.\nResearch skills, including information retrieval from a variety of sources.\nWriting and reading skills: active reading, note-taking, the application of organization strategies such as mind-maps and summarising.\nWriting skills: structure of academic and reflective assignments, appropriate register, style and technical requirements.\nAccurate quoting, paraphrasing and referencing techniques and how to avoid plagiarism.\nApplication of art theory.\nLanguage study where applicable.\nBasic disciplinary-focused computer literacy.\nHow to self-edit and peer review academic work.\nPreparation of oral presentations with the aid of media.\n Evaluation criteria\nContinuous assessment by assignments and portfolio submission throughout the year, as well as an oral presentation. 100% year mark. Pass mark: 50%.\nMODERATION\nInternal by appointed specialist.\nPrerequisites\nNone"
    },
    {
        "module": "KDS110",
        "name": "2-D Studies",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 30\nEstimated fees: R12310\nLecturer(s): NYONI, VPE; VAN WYK, R;\nSyllabus\nPURPOSE\nThis module aims to introduce the basic concepts and principles of design, photography, painting, fashion and textiles.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\ndeliver a design output which incorporates all the general principles and processes inherent in the design solution;\ndeliver specific projects which demonstrate an informed understanding and application of formal elements, the main processes, methods and techniques as applicable to Graphic Design, Photography, Painting, Fashion and Textiles;\napply knowledge and skills to compose, manipulate and produce artefacts utilising basic materials and the relevant equipment and technology;\nutilise basic digital photographic equipment and related software to manipulate images for a variety of visual applications;\narticulate ideas and information confidently and coherently in visual, written and electronic form to a range of audiences;\ncommunicate effectively using visual and language skills in the modes of written self-reflection after each practical assignment;\napply the principles of colour theory and formal composition in all visual expressions;\ncomplete and prepare 2-Dimensional studio projects for inclusion in the November final portfolio submission.\nCORE CONTENT\nIntroduction and studio practice: Developing visual concepts.\nIntroduction and studio practice: Two-dimensional techniques and methods.\nIntroduction and studio practice: Design principles, Photography, Painting, Fashion and Textiles.\n Evaluation criteria\n40% continuous assessment year mark and 60% portfolio examination mark in November. Pass mark is 50%.\nMODERATION\nInternal by departmental panel.\nPrerequisites\nNone"
    },
    {
        "module": "KTD110",
        "name": "3-D Studies",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 30\nEstimated fees: R12310\nLecturer(s): NYONI, VPE; VAN WYK, R;\nSyllabus\nPURPOSE\nThe purpose of this module is to develop the knowledge and skills required to create three-dimensional objects in a wide variety of different media.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\ntranslate a two-dimensional concept into a three-dimensional form through a sound application of process;\ncreate three-dimensional forms in a range of mediums, oth traditional and non-traditional;\naccess, interpret and assimilate information from a wide range of reference sources;\nfunction as part of a team;\nidentify and solve problems in which responses display that responsible decisions using critical and creative thinking have been made;\norganize and manage activities responsibly and effectively;\ncollect, analyse, organise and critically evaluate information;\ncommunicate effectively using visual and language skills in the form of written self-reflection;\ncomply with health and safety requirements and protocol within the studio, showing responsibility towards the environment and health of others;\ncomplete and prepare 3-dimensional studio projects for inclusion in the November final portfolio submission.\nCORE CONTENT\nIntroduction to the principles of creating three-dimensional forms.\nStudio practice: techniques and methods.\nStudio practice: visual perception and understanding of the composition and form of the three-dimensional art work.\nStudio practice: research of subject matter, development of ideas, drawing and design, translation from two-dimensional to three-dimensional form.\n Evaluation criteria\n40% continuous assessment year mark and 60% portfolio assessment mark in November. Pass mark is 50%.\nMODERATION\nInternal by departmental panel.\nPrerequisites\nNone"
    },
    {
        "module": "KVS110",
        "name": "Visual Studies I",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 12\nEstimated fees: R3390\nLecturer(s): COLLETT, RJ; DUKER, GMA;\nSyllabus\nPURPOSE\nThis module is a survey of visual culture, from pre-history to the present that provides an understanding of the art movements that existed, the artefacts that were produced, and the theories that informed art production in relation to art historical and socio-political contexts.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\ndiscuss historical and contemporary artistic practices and art and design production and explain how these relate to socio-political contexts;\nexplain critical frameworks and demonstrate how they can be used to reflect on artistic practice;\nanalyse artworks and artistic practices by using coherent, structured and supported academic arguments;\napply basic research methodologies in order to generate academic texts;\ngather data from a range of textual and electronic sources, select task-appropriate information, and apply the basic processes of analysis, synthesis and evaluation of information, in the production of soundly argued texts;\nwork effectively as individuals, or as member of a group, in executing delimited discipline-specific exercises and assignments.\nCORE CONTENT\nIntroduction to theories that inform visual culture and art history.\nIntroduction to formal analysis.\nThe evolution of fine art.\nEvolution of the applied and decorative arts.\nEvolution of communication design and photography.\nNon-Western modes of image and artefact-making.\nSurvey of modern and postmodern art.\nData gathering and academic writing conventions.\n Evaluation criteria\nContinuous assessment, through written assignments, verbal presentations, and tests that demonstrate an ability to discuss, argue and analyse identified visual culture products and practices. 100% year mark. Pass mark 50%.\nMODERATION\nInternal by appointed specialist.\nPrerequisites\nNone"
    },
    {
        "module": "KVT110",
        "name": "Visualisation Techniques I",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 24\nEstimated fees: R6770\nLecturer(s): NYONI, VPE; VAN WYK, R;\nSyllabus\nPURPOSE\nThis module will introduce students to a process-orientated approach to visual communication through drawing, stressing the interconnectedness of perceptual and conceptual approaches.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nmanipulate a limited range of drawing and visualisation media, and apply a process- orientated approach to drawing and visualisation within visual arts and design contexts;\nresolve formal problems within the structured studio programme;\nidentify, research and analyse visual resources pertaining to studio projects;\nidentify and use imagery and techniques that relate studio projects to broader contexts.\nCORE CONTENT\nIntroduction to a limited rage of drawing and visualisation media.\nprocess-orientated studies of organic and mechanical subject matter and the human figure.\nUse of drawing and visualisation media as a tool for planning and the communication of ideas.\nVisual research methodology linked to studio projects.\n Evaluation criteria\n40% continuous assessment year mark and 60% portfolio assessment mark in November. Pass mark is 50%.\nMODERATION\nInternal by departmental panel.\nPrerequisites\nNone"
    },
    {
        "module": "SFV101",
        "name": "Introduction To Philosophical Ideas I",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2\nCredit value: 10\nEstimated fees: R3390\nLecturer(s): MANONA, LS; NZIOKI, M; STEVENSON, LCS;\nSyllabus\nRegrettably no information is currently available. Please contact your Faculty Administration office to assist with this information.\nPrerequisites\nNone"
    },
    {
        "module": "KIS210",
        "name": "Interdisciplinary Studies Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 12\nEstimated fees: R3390\nLecturer(s): ADRIAAN, R; LUYT, J; MEYER, GM; NYONI, VPE;\nSyllabus\nPURPOSE\nThis module will prepare students to understand processes and systems relating to crafting and production of visual art and design output and artefacts while developing technical and technological competency related to their specific discipline.\nA detailed knowledge of marketing and related practices and their application to specific fields within fine arts, photography, fashion textiles or graphic design within an industry context will be fostered.\nLEARNING OUTCOMES\nAfter the completion of this module students will be able to:\nrelate production processes and technologies to particular fine arts, photography, fashion textiles or graphic design disciplines;\nevaluate, select and apply appropriate production processes, techniques or technologies within fine arts, photography, fashion textiles or graphic design fields;\nknow the main areas of production and how to apply processes, methods and techniques as applicable to specific visual arts and design fields;\ngather and evaluate information and apply it in the context of marketing as it relates to visual arts and design businesses;\nunderstand interrelationships between marketing, media and business systems and their relationships and impact on one another;\ndemonstrate the ability to work within a team or group, and to take responsibility for decisions and actions within a marketing and media context as it pertains to the visual arts and design fields;\narticulate ideas and information confidently and coherently in visual, verbal, written and electronic forms to audiences in a marketing, media planning or strategy context.\nCORE CONTENT\nInstruction in technical aspects of photography and digital image manipulation and production.\nProduction processes and technologies in the selected.\nInstruction in discipline specific software applications.\nMarketing and media fundamentals, strategy development and application in visual arts and design businesses in local and global contexts.\n Evaluation criteria\nContinuous assessment. 100% year mark. Pass mark is 50%.\nMODERATION\nInternal by subject specialists.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KVS210",
        "name": "Visual Studies Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): CADLE, BS; COLLETT, RJ; HATTINGH, HM; KUSCUS, L; LUYT, J; NYONI, VPE;\nSyllabus\nPURPOSE\nThis module addresses the historical influences that defined the visual arts and early visual communication by consolidating knowledge of pre-modern, modern and postmodern artistic and cultural practices, and their relationship to the South African, African and global art historical, social, cultural, political and economic contexts.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nanalyse historical and contemporary artistic and design practices as they relate to South African, African and global contexts;\nuse interpretive frameworks to evaluate artworks and forms of visual communication;\nreflect on artistic practice using selected critical frameworks;\nanalyse and discuss forms of visual communication, artworks, practices and theoretical texts;\npresent coherent, structured and supported academic arguments within the visual arts and design disciplines;\nformulate arguments and discuss art historical issues through academic writing and associated methodology.\nCORE CONTENT\n19th and 20th century visual communication and art practice, aims and techniques.\n20th century South African visual communication, art practice and theory in context.\nSelected critical frameworks and their application to pre-modern, modern and postmodern artistic and cultural practices.\nTerminology and methodology applied to the criticism and analysis of images.\nIntroduction to research and academic writing.\nA series of seminars will address a range of contemporary issues as they pertain to the discipline streams of fashion, fine art, graphic design and photography.\n Evaluation criteria\nContinuous assessment, through written assignments, verbal presentations, and tests that demonstrate an ability to discuss, argue and analyse identified visual culture products and practices. 100% year mark.\nPass mark 50%.\nMODERATION\nInternal by appointed specialists.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KFT201",
        "name": "Fashion & Textile Design Ii A",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2\nCredit value: 30\nEstimated fees: R8470\nLecturer(s): GROBBELAAR, HJ; JAMES, T; LUYT, J;\nSyllabus\nPURPOSE\nThe student will be able to employ fashion/textile design processes to develop a final product by using appropriate methods and equipment.\nLEARNING OUTCOMES\nOn the completion of this module the student will have the ability to:\nuse resources and enquiry methods to gain fashion and textile knowledge;\nselect and apply design processes in journal format;\nidentify and solve problems by applying appropriate process methods in the conceptual, technical and production stages of fashion and textile articles;\ndifferentiate between ethical and non-ethical behaviour and practice within the fashion and textile design and production fields;\napply one or more of fashion and textiles’ key terms, rules, concepts, and established principles in communicating design intent in a journal;\npresent and communicate information reliably, using professional discourse within oral, written and design work;\nself-evaluate performance against fashion and textile project criteria and take responsibility for own progress within the discipline;\nidentify problems during the development from the concept to the final product using professional fashion and textile industry standards.\nCORE CONTENT\nBasic conceptual research and enquiry techniques.\nElementary design process knowledge.\nAwareness and solving of simple ethical issues during product development.\nBasic pattern development techniques and application.\nBasic garment construction; process, methods and applications.\nBasic textile printing techniques and application.\nIntermediate theoretical underpinning of textile fibre knowledge.\nOral, written and design communication using proficient discourse.\nConceptual processes reflected in journal define personal development.\nAwareness of industrial standards of production.\n Evaluation criteria\n60% continuous assessment year mark and 40% controlled project mark in November. This module precedes Fashion and Textiles IIb and Fashion Design IIb, and will be assessed at mid-year with a progress mark. The controlled project mark in November will incorporate the relevant modules from the first semester. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KVT210",
        "name": "Fashion & Textile Visualisation Tech Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 24\nEstimated fees: R6770\nLecturer(s): BINSBERGEN, PA; JAMES, T; LUYT, J; NYONI, VPE;\nSyllabus\nPURPOSE\nThis module equips the student with a command of process-orientated approaches to visual communication through drawing; photographic rendering, digital imaging or other visualisation techniques appropriate to the student’s chosen fashion or textile direction.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\ndifferentiate between and skilfully manipulate a variety of drawing and visualisation media;\nselect and communicate ideas appropriately within a specific fashion or textile design background;\ndevelop drawings, photographs and or digital images as a result of visual research considering appropriate conceptual frameworks.\nCORE CONTENT\nElementary exploration of a variety of drawing and visualisation media specific to fashion and textile design contexts.\nFundamental process-orientated analytical and experimental drawings of botanical and still-life subjects and figure and fashion drawings with the emphasis on fabric usage.\nElementary translation of preparatory drawings into designs within fashion and textile design contexts.\nBasic development of a visual journal that reflects research pertaining to task-related fashion and textile contexts.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KFD202",
        "name": "Fashion Design Iib",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 3+4\nCredit value: 30\nEstimated fees: R8470\nLecturer(s): CADLE, BS; GROBBELAAR, HJ; JAMES, T;\nSyllabus\nPURPOSE\nThe purpose of this module is to specialise in designing clothing for a professional fashion industry segment where industry standards, needs and expectations are addressed.\nLEARNING OUTCOMES\nOn the completion of this module the student will have the ability to:\nuse a variety of resources and enquiry methods to gain fashion knowledge;\ndifferentiate between ethical and non-ethical behaviour and practice within the fashion industry and consider this for personal designs;\nevaluate and communicate information professionally using digital as well as oral and written format. use advanced application of fashion and textile key terms and terminology;\nidentify, analyse and solve problems by applying appropriate process methods in the conceptual, technical and production stages of fashion garments;\ndifferentiate between different equipment used for garment technology;\nself-evaluate performance against fashion project criteria and take responsibility for own learning.\nCORE CONTENT\nConceptual and technical design research and expression using different formats such as the journal.\nOral, written and design communication using professionally accepted discourse. Intermediate theoretical underpinning of fashion knowledge.\nProduce articles from concept to completed product carefully considering ethical, conceptual, technical, manufacturing problems and their solutions.\nPattern development techniques and application.\nGarment construction; process, methods and techniques considering industrial equipment.\nConceptual processes reflected in personal journal.\n Evaluation criteria\n60% continuous assessment year mark and 40% controlled project mark in November, incorporating Fashion and Textiles IIa. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KFT202",
        "name": "Fashion & Textile Design Iib",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 3+4\nCredit value: 30\nEstimated fees: R8470\nLecturer(s): BINSBERGEN, PA; NYONI, VPE; SIKHWIVHILU, VC;\nSyllabus\nPURPOSE\nThe student will demonstrate more advanced knowledge, comprehension and application of techniques to produce fashion and textile related products of an suitable standard.\nLEARNING OUTCOMES\nOn the completion of this module the student will have the ability to:\nuse a variety of resources and enquiry methods to gain fashion and textile knowledge;\ndifferentiate between ethical and non-ethical behaviour and practice within the fashion and textile fields and consider this for personal designs;\nevaluate and communicate information professionally using digital as well as oral and written format; advanced application of fashion and textile key terms and terminology;\nidentify, analyse and solve problems by applying appropriate process methods in the conceptual, technical and production stages of fashion and textile articles;\nself-evaluate performance against fashion and textile project criteria and take responsibility for own learning.\nCORE CONTENT\nConceptual and technical design research and expression using different formats such as the journal.\nOral, written and design communication using professionally accepted discourse. Intermediate theoretical underpinning of textile knowledge.\nProducing articles from concept to completed product carefully considering ethical, conceptual, technical and manufacturing problems and their solutions.\nPattern development techniques and application. Intermediate garment construction; process, methods and techniques considering industrial standards.\nIntermediate knowledge of application techniques for textile printing.\nBasic knowledge of textile construction techniques and design (such as knitting and weaving).\nConceptual processes reflected in journal represent personal problem solving progression.\n Evaluation criteria\n60% continuous assessment year mark and 40% controlled project mark in November, incorporating Fashion and Textiles IIa. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KDR210",
        "name": "Drawing Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 24\nEstimated fees: R6770\nLecturer(s): DUKER, GMA; NYONI, VPE; STAPLE, JL;\nSyllabus\nPURPOSE\nThis module equips the student with a command of process-orientated approaches to visual communication through drawing.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nskilfully manipulate a variety of drawing media;\nuse drawing to analyse and resolve complex formal problems within the structured studio programme;\nuse drawing as a tool to communicate ideas within a visual arts context;\nproduce relevant visual responses to appropriate conceptual contexts.\nCORE CONTENT\nThe exploration of drawing media such as charcoal, conte, pencil, coloured pencils, oil pastels and inks.\nProcess-orientated drawings of the figure, landscape, architecture and the studied object.\nIntroduction to drawing as a tool for the communication of ideas within a visual arts context.\nThe development of a visual journal that reflects research pertaining to the structured studio programme and the student’s studio projects.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KAJ201",
        "name": "Sculpture Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2\nCredit value: 30\nEstimated fees: R13940\nLecturer(s): JONES, DA; STAPLE, JL;\nSyllabus\nPURPOSE\nTo introduce the student to the concept and workings of sculpture studio practice in order to lay a solid foundation for future specialisation.\nLEARNING OUTCOMES\nAfter completion of this module students will be able to:\napply the key terms, concepts, facts and rules of sculpture in the visual representation and creation of artefacts within defined contexts;\nshow technical proficiency in the control and use of selected sculpture mediums;\ngenerate sculptural artefacts from design, planning, material selection, method and technique manipulation through to the finished artifact;\nevaluate, select and apply appropriate methods, procedures and techniques in the creation of artefacts;\narticulate different forms of knowledge, representation, interpretation and explanation in the field of contemporary sculpture;\ndescribe Occupational Health and Safety requirements in order to operate safely and independently in the sculpture studio.\nCORE CONTENT\nInstruction in the manipulation of basic materials used in traditional and contemporary sculpture.\nPractical application of the theoretical within defined contexts and projects.\nOverview of historical and contemporary influences on sculptural practice.\nEncouragement of independent research, experimentation with form and material and applied problem solving.\nDetermine safety protocols that are required for hand tools, moving equipment, materials and processes.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KAP201",
        "name": "Painting Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2\nCredit value: 30\nEstimated fees: R13940\nLecturer(s): JONES, DA; STAPLE, JL;\nSyllabus\nPURPOSE\nTo introduce the student to the concept and workings of painting studio practice in order to lay a solid foundation for future specialisation.\nLEARNING OUTCOMES\nAfter completion of this module students will be able to:\napply the key terms, concepts, facts and rules of painting in the visual representation and creation of artefacts within defined contexts;\nshow technical proficiency in the control and use of selected painting mediums;\ngenerate painting artefacts which apply the painting process from design, planning, material selection, method and technique manipulation through to the finished artifact;\nevaluate, select and apply appropriate methods, procedures and techniques in the creation of artefacts;\narticulate different forms of knowledge, representation, interpretation and explanation in the field of contemporary painting;\ndescribe Occupational Health and Safety requirements in order to operate safely and independently in the painting studio.\nCORE CONTENT\nInstruction in the manipulation of basic materials used in traditional and contemporary painting.\nPractical application of the theoretical within defined contexts and projects.\nOverview of historical and contemporary influences on painting practice.\nEncouragement of independent research, experimentation with form and material and applied problem solving.\nDetermine safety protocols that are required for hand tools, moving equipment, materials and processes.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KAL202",
        "name": "Printmaking Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 3+4\nCredit value: 30\nEstimated fees: R13940\nLecturer(s): NYONI, VPE; STAPLE, JL;\nSyllabus\nPURPOSE\nTo introduce the student to the concept and workings of printmaking / illustration studio practice in order to lay a solid foundation for future specialisation.\nLEARNING OUTCOMES\nAfter completing this module the student will be able to:\napply the key terms, concepts, facts and rules of printmaking / illustration in the visual representation and creation of artefacts within defined contexts;\nshow technical proficiency in the control and use of selected printmaking / illustration mediums;\ngenerate printmaking / illustration artefacts which apply the printmaking / illustration process from design, planning, material selection, method and technique manipulation through to the finished artifact;\nevaluate, select and apply appropriate methods, procedures and techniques in the creation of artefacts;\narticulate different forms of knowledge, representation, interpretation and explanation in the field of contemporary printmaking / illustration;\ndescribe Occupational Health and Safety requirements in order to operate safely and independently in the printmaking / illustration studio.\nCORE CONTENT\nInstruction in the manipulation of basic materials used in traditional and contemporary printmaking / illustration.\nPractical application of the theoretical within defined contexts and projects.\nOverview of historical and contemporary influences on printmaking / /illustration practice.\nEncouragement of independent research, experimentation with form and material and applied problem solving.\nDetermine safety protocols that are required for hand tools, moving equipment, materials and processes.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KCC202",
        "name": "Ceramics Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 3+4\nCredit value: 30\nEstimated fees: R13940\nLecturer(s): JONES, DA; STAPLE, JL;\nSyllabus\nPURPOSE\nTo introduce the student to the concept and workings of ceramic studio practice in order to lay a solid foundation for future specialisation.\nLEARNING OUTCOMES\nAfter completion of this module students will be able to:\napply the key terms, concepts, facts and rules of ceramics in the visual representation and creation of artefacts within defined contexts;\nshow technical proficiency in the control and use of selected ceramic mediums;\ngenerate ceramic artefacts which apply the ceramic process from design, planning, material selection, method and technique manipulation through to the finished artifact;\nevaluate, select and apply appropriate methods, procedures and techniques in the creation of artefacts;\narticulate different forms of knowledge, representation, interpretation and explanation in the field of contemporary ceramic practice;\ndescribe Occupational Health and Safety requirements in order to operate safely and independently in the ceramic studio.\nCORE CONTENT\nInstruction in the manipulation of basic materials used in traditional and contemporary ceramics.\nPractical application of the theoretical within defined contexts and projects.\nOverview of historical and contemporary influences on ceramic practice.\nEncouragement of independent research, experimentation with form and material and applied problem solving.\nDetermine safety protocols that are required for hand tools, moving equipment, materials and processes.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KGG202",
        "name": "Glass Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 3+4\nCredit value: 30\nEstimated fees: R8470\nLecturer(s): JONES, DA;\nSyllabus\nPURPOSE\nTo introduce the student to the concept and workings of glass studio practice in order to lay a solid foundation for future specialisation.\nLEARNING OUTCOMES\nAfter completion of this module students will be able to:\napply the key terms, concepts, facts and rules of glass forming in the visual representation and creation of artefacts within defined contexts;\nshow technical proficiency in the control and use of selected glass mediums;\ngenerate glass artefacts which apply the glass process from design, planning, material selection, method and technique manipulation through to the finished artifact;\nevaluate, select and apply appropriate methods, procedures and techniques in the creation of artefacts;\narticulate different forms of knowledge, representation, interpretation and explanation in the field of contemporary art glass;\ndescribe Occupational Health and Safety requirements in order to operate safely and independently in the glass studio.\nCORE CONTENT\nInstruction in the manipulation of basic materials used in traditional and contemporary art glass.\nPractical application of the theoretical within defined contexts and projects.\nOverview of historical and contemporary influences on art glass practice.\nEncouragement of independent research, experimentation with form and material and applied problem solving.\nDetermine safety protocols that are required for hand tools, moving equipment, materials and processes.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KCD210",
        "name": "Communication Design Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R16930\nLecturer(s): BOTCHWAY, NC; NYONI, VPE;\nSyllabus\nPURPOSE\nThe purpose of this module is to provide students with academic and vocational training that will equip them for participation in the design, display, publishing, packaging, identity and other design fields and enable them to develop formal and conceptual approaches to solving graphic design problems in industry appropriate print media contexts.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\ngenerate graphic design solutions that show detailed knowledge and application of the principles, methods, technologies and proficiencies in the field of Graphic Design;\ngenerate process work and graphic design solutions that indicates engagement with critical thinking, problem solving, reflective practice and research in conceptualising, planning, pre-visualising and executing creative graphic design solutions;\ndemonstrate through verbal presentation, process work, graphic design solutions and/or written work, an understanding of the designer's relationship with audiences, client, markets, users, consumers, and/or participants;\npresent and communicate complex information coherently using appropriate methods, formats, media and tools for a variety of audiences;\ninteract effectively with others and apply graphic design knowledge and skills in related fields, for example through collaboration and collective endeavour in interdisciplinary collaborations;\ndemonstrate an understanding of ethical conduct as it relates to social, cultural and environmental responsibility in the production and content of graphic design solutions.\nCORE CONTENT\nIntroduction to and practice of, the following competencies:\nDesign process\nVisual communication\nTypography\nProblem solving and conceptual thinking\nLayout and organization\nAs applied to:\nPublishing\nCorporate identity\nPromotion\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KGD210",
        "name": "Graphic Design Visualisation Tech Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 24\nEstimated fees: R6770\nLecturer(s): BOTCHWAY, NC; ECONOMOU, IO; NYONI, VPE;\nSyllabus\nPURPOSE\nThe purpose of this module is to develop competency in seeing, interpreting and translating relevant visual forms for the purpose of communicating design ideas, concepts and/or generating illustration.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nevaluate, select and manipulate a variety of drawing and visualisation media and tools appropriate to graphic design contexts;\nidentify and resolve formal problems, including structure, composition, perspective, form and proportion, for graphic design visualisation;\npre-visualise and communicate design ideas and design elements within graphic design contexts.\nCORE CONTENT\nThe exploration of a variety of media and tools appropriate in visualising and rendering for graphic design contexts.\nGestural sketches and resolved formal renderings of the human figure, organic and mechanical objects.\nIntroduction to illustration for the communication of ideas within a graphic design context.\nThe development of a visual journal that reflects research pertaining to visualisation in a graphic design context.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KPP210",
        "name": "Photography Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R27870\nLecturer(s): AARTS, JR; HATTINGH, HM; HOPWOOD, TW; MEYER, GM;\nSyllabus\nPURPOSE\nThis module aims to equip the student with intermediate level technical and aesthetic photographic skills. Its focus is to produce a student that reflects competency in the specific skills taught, has knowledge of related theoretical and aesthetic concepts as well as the ability to apply these skills and concepts in producing a photographic portfolio.\nLEARNING OUTCOMES\nThis module aims to equip students with the ability to:\nindependently identify visual problems and solve them with creative photographic visual solutions;\nreflect technical and technological competency for the field of photography with particular emphasis on available and artificial lighting; digital photographic technique and compositional aesthetics; as well as digital processing and output techniques;\ngenerate reflective knowledge of photographic / digital imaging processes, materials and apparatus through hands-on experience in the field, the studio or on assignment;\nprovide evidence, through the presentation of a body of work, of an ability to practice from a technically and aesthetically competent basis within the discipline of photography;\nintroduce the importance of business principles and the professional photographic environment through exposure to realistic assignment briefs, and commercially driven projects;\nproduce conceptual output by generating evidence of research and planning as an integral part of practical photographic projects;\ninterpret briefs and provide images as required for self-expressive, communicative and commercial purposes.\nCORE CONTENT\nSingle lens reflex camera technique and exposure control.\nBasic studio practice with particular emphasis on electronic flash, continuous light sources and related studio equipment.\nPractice on location with particular emphasis on related lighting techniques and technical skill.\nIntroduction to the techniques of monochrome and colour photography.\nApplication of photography as a medium of self-expression as well as for communicative and commercial purposes.\nKnowledge of relevant software, image management and printing requirements related to competent photographic output.\nBroad photographic themes that will be introduced in this module are: the environment, commercial, advertising, and editorial photography.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)\nVisualisation Techniques I  (KVT110)"
    },
    {
        "module": "KPV210",
        "name": "Photographic Visualisation Tech Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 24\nEstimated fees: R6770\nLecturer(s): AARTS, JR; DUKER, GMA; HATTINGH, HM; HOPWOOD, TW; MEYER, GM;\nSyllabus\nPURPOSE\nThis module equips the student with a command of process-orientated approaches to visual communication through photographic rendering, digital imaging and/or other visualisation techniques appropriate to photography and lens-based media.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nskilfully manipulate a variety of visualisation media and approaches appropriate to photographic contexts;\nanalyse and resolve complex formal problems within the structured studio programme;\ncommunicate ideas within specific photographic contexts;\nproduce relevant visual responses to appropriate conceptual contexts.\nCORE CONTENT\nExploration of a variety of photographic capturing, and digital imaging media specific to particular photographic contexts.\nIn-depth process-orientated photographic imaging of subjects such as commercial, editorial and advertising photography.\nIntroduction to digital capturing, manipulation and imaging techniques as a tool for the communication of complex ideas within specific photographic contexts.\nDevelopment of a visual journal that reflects research and planning pertaining to task-related photographic contexts.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nInternal by departmental panel.\n Prerequisites needed for this module\nVisualisation Techniques I  (KVT110)\nCommunication I  (KCO110)\n2-D Studies  (KDS110)\n3-D Studies  (KTD110)\nVisual Studies I  (KVS110)"
    },
    {
        "module": "SFV102",
        "name": "Introduction To Philosophical Ideas Ii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 3+4\nCredit value: 10\nEstimated fees: R3390\nLecturer(s): MANONA, LS;\nSyllabus\nRegrettably no information is currently available. Please contact your Faculty Administration office to assist with this information.\nPrerequisites\nNone"
    },
    {
        "module": "KIS310",
        "name": "Interdisciplinary Studies Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): ADRIAAN, R; KUSCUS, L; MEYER, GM; NYONI, VPE; ROMAN, H; SWANEPOEL, ML; VAN WYK, R;\nSyllabus\nPURPOSE\nThis module will provide students with integrated knowledge of processes and systems relating to crafting and production of creative outputs. It is also intended to develop discipline specific technical and technological competency in the disciplines of Painting, Sculpture, Printmaking, Stained Glass, Ceramics, Graphic Design, Photography, Fashion and Textiles.\nAn understanding and application of key terms, theories and principles in a business context should be fostered. The business and professional practice aspects of this module are aimed at equipping students with the knowledge to be able to manage small businesses.\nLEARNING OUTCOMES\nAfter the completion of this module students will be able to:\nevaluate, select and apply a range of methods to resolve problems within a visual art and design business context;\nunderstand, apply and evaluate key business terms, concepts and principles as it relates to entrepreneurs in the fine arts, photography, fashion, textile or graphic design disciplines;\nintegrate knowledge of business systems and production processes in an industry context, and understand how the different systems and process are interrelated;\ndevelop and articulate ideas and information confidently and coherently in visual, verbal, written and electronic forms;\nevaluate production processes, methods and techniques as applicable to specific visual arts and design disciplines.\nCORE CONTENT\nPhotography and digital image manipulation and production.\nProduction processes and technologies in the selected field of specialization.\nInstruction in, discipline specific, software applications.\nPrinciples of business, finance and legal frameworks in the entrepreneurial context.\nDiscipline specific business processes and related professional practice.\n Evaluation criteria\nContinuous evaluation. Pass mark is 50%.\nMODERATION\nExternal by appointed subject specialists.\n Prerequisites needed for this module\nInterdisciplinary Studies Ii  (KIS210)"
    },
    {
        "module": "KVS310",
        "name": "Visual Studies Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): CADLE, BS; COLLETT, RJ; ECONOMOU, IO; NYONI, VPE;\nSyllabus\nPURPOSE\nThis module focuses on the visual culture phenomena, theories and creative practices of the 20th and 21st century that have shaped the practical and theoretical landscape of the South African, African and global visual arts and design disciplines.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nuse knowledge of academic research and writing methodology to generate texts that demonstrate an understanding of contemporary artistic and visual communication practices, viewed in relation to relevant art historical, socio-cultural and politico-economic contexts, and of the interdisciplinary connections within the visual art and design disciplines;\nreflect critically on contemporary artistic and visual communication practices and articulate their significance;\nanalyse artworks and forms of visual communication through the application of selected critical and theoretical frameworks.\nCORE CONTENT\nLate-20th and 21st century visual communication and artistic practices and the influence of diverse art historical, social, cultural, political and economic contexts.\nThe influence on contemporary visual culture of shifts in the critical and theoretical frameworks of the 20th century and the development of contemporary theoretical paradigms.\nContemporary approaches to the criticism and analysis of artworks, images, fashion and designed artefacts.\nFilm, animation and digital media as agents of visual communication.\nIntroduction to academic research methodologies for design and the visual arts.\nA series of seminars will address a range of contemporary issues as they pertain to the discipline streams of fashion, fine art, graphic design and photography.\n Evaluation criteria\nContinuous assessment, through written assignments, verbal presentations, interdisciplinary engagements and tests that demonstrate an ability to apply analysis, argument and critical viewpoints to a range of visual culture products and practices. 100% year mark.\nPass mark 50%.\nMODERATION\nExternal by appointed specialist.\n Prerequisites needed for this module\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KVT310",
        "name": "Fashion & Textile Visualisation Tech Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): ADRIAAN, R; GROBBELAAR, HJ; LUYT, J;\nSyllabus\nPURPOSE\nThe purpose of this module is to develop advanced visualisation skills appropriate to fashion and textiles’ needs by connecting visual research, drawing and visualisation techniques specific to the discipline.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nengage self-critically with advanced drawing and visualisation media and critically apply these approaches to producing fashion and textile outputs;\nidentify, analyse and resolve advanced visualisation problems as they apply to the presentation of own work;\ncommunicate advanced ideas and concepts through illustration.\nCORE CONTENT\nUsing advanced computer aided design methods and techniques to generate illustrations and technical drawings.\nIn-depth studies of botanical and still-life subjects and advanced figure and fashion drawings for three-dimensional design concepts.\nCommunication of complex visual ideas within the context of a structured studio programme and through independent studies.\nApplication of contextually relevant visual research methodologies in the production of a visual journal.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nFashion & Textile Visualisation Tech Ii  (KVT210)"
    },
    {
        "module": "KFD310",
        "name": "Fashion Design Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R16930\nLecturer(s): ADRIAAN, R;\nSyllabus\nPURPOSE\nThe purpose of this module is to apply advanced conceptual approaches to the development and analysis of designs and then use specialised techniques to produce innovative fashion garments of a professional standard.\nLEARNING OUTCOMES\nOn completion of this module the student will have the ability to:\nidentify, analyse, evaluate, critically reflect on and address complex fashion problems from the concept to the final product using personal gained knowledge;\nreflect on and critically examine advanced principles of pattern development for various garment blocks;\nselect and apply a range of specialised fashion manufacturing techniques with specialised equipment, to resolve problems;\nidentify ethical concerns and justify solutions to this problem/s;\napply key terms, concepts and principles of fashion design and research in industrial and in academic contexts;\nanalyse and communicate fashion design concepts in well-formed professional arguments using appropriate dialogue and media;\nidentify and make decisions on own learning needs and take responsibility for self-development.\nCORE CONTENT\nAdvanced conceptual design skills and professional technical design techniques creating a style of rendering that carries professional standard.\nComplex pattern and garment development techniques including computer pattern grading\nCommercially acceptable constructed garments using well developed process, methods, techniques and specialised equipment appropriate to this level.\nDistinguishing between global ethical issues and demonstrating knowledge and consideration of the issues in design applications.\nProfessional and industrial fashion knowledge used in research based projects.\nAdvanced professional design communication and presentation skills using enhanced computer technology.\nAssessing own work load and work speed and taking full responsibility for own learning; managing deadlines in a professional and efficient manner.\n Evaluation criteria\n60% continuous assessment year mark and 40% controlled project mark in November.\nPass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nFashion Design Iib  (KFD202)\nFashion & Textile Design Ii A  (KFT201)"
    },
    {
        "module": "KFT310",
        "name": "Fashion & Textile Design Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R16930\nLecturer(s): LUYT, J; NYONI, VPE; SIKHWIVHILU, VC;\nSyllabus\nPURPOSE\nThe purpose of this module is to apply advanced conceptual approaches to the development and analysis of designs and then use specialised techniques to produce innovative fashion, textile and related products of a professional standard.\nLEARNING OUTCOMES\nOn completion of this module the student will have the ability to:\nidentify, analyse, evaluate, critically reflect on and address complex fashion and textile problems, from the concept to the final product, using personally gained knowledge;\nreflect on and critically examine advanced principles of pattern development for various garment blocks;\nselect and apply a range of specialised fashion manufacturing and textile design techniques with specialised equipment, to resolve problems;\nidentify ethical concerns and justify solutions to this problem/s;\ndifferentiate between key terms, concepts and principles of fashion/textile design in research in industrial and in academic contexts;\nanalyse and communicate fashion and textile design concepts in well-formed professional arguments using appropriate dialogue and media;\nidentify and make decisions on own learning needs and take responsibility for self-development.\nCORE CONTENT\nAdvanced conceptual design skills and professional technical design techniques creating a style of rendering that carries professional standard.\nComplex pattern and garment development techniques including computer pattern grading.\nCommercially acceptable constructed garments using well developed process, methods, techniques and equipment appropriate to this level.\nAnd/or professional problem solving textile printing techniques using innovative solutions for various surfaces.\nDistinguishing between global ethical issues and demonstrating knowledge and consideration of the issues in design applications.\nProfessional and industrial theoretical textile knowledge used in research based projects.\nProfessional communication skills displayed in the presentation of design ideas using computer technology.\nSpecialist design and problem solving construction techniques with knitting (and perhaps weaving).\nAssessing own work load and work speed and taking full responsibility for own learning; managing deadlines in a professional and efficient manner.\n Evaluation criteria\n60% continuous assessment year mark and 40% controlled project mark in November.\nPass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nFashion & Textile Design Ii A  (KFT201)\nFashion & Textile Design Iib  (KFT202)"
    },
    {
        "module": "KDR310",
        "name": "Drawing Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): JONES, DA; NYONI, VPE; STAPLE, JL;\nSyllabus\nPURPOSE\nThis module develops skill in advanced visual communication, and fosters connections between visual research, critical reflection, and drawing, with the emphasis on student’s engagement with concepts, themes and visual problems relating to a chosen focus within a studio arts direction.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nengage self-critically with advanced drawing media and critically apply traditional and experimental drawing techniques;\nuse drawing to identify, analyse and resolve advanced formal problems within the structured studio programme;\nuse drawing to communicate advanced ideas in a visual arts context;\ndefine and resolve visual problems related to an individual direction within a visual arts discipline.\nCORE CONTENT\nSpecialisation within a chosen drawing medium and approach.\nIn-depth studies exploring historical and contemporary approaches to the figure, landscape and the observed object.\nThe use of composition, line, tone and colour as communicative tools.\nThe use of drawing as a research and planning tool in the communication of advanced ideas within the context of the structured studio programme and independent studies.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nDrawing Ii  (KDR210)"
    },
    {
        "module": "KAJ310",
        "name": "Sculpture Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R29430\nLecturer(s): JONES, DA; STAPLE, JL;\nSyllabus\nPURPOSE\nTo enable the student (through the acquisition of skills, understanding and knowledge) to produce a coherent body of sculpture artefacts that reflects a contemporary approach to image making and that conforms to professional standards.\nLEARNING OUTCOMES\nAfter completing this module students will be able to:\nexplore and articulate historical and contemporary approaches to image making through research, analysis and synthesis;\ngenerate a range of sculptural artefacts that reflects a range of methods of enquiry and practice within the discipline of sculpture and their suitability to the resolution of the creative construct;\nparticipate in cross-disciplinary critiques by developing and communicating personal ideas and opinions in well-formed arguments, using appropriate academic and professional discourse;\nidentify, analyse, evaluate and critically reflect on and address complex visual, creative and structural problems;\napply evidence based solutions and cogent theory driven arguments;\nattain the requisite crafting, technical and technological competency and professional practice compliancy for the field of fine art;\nwork thematically within defined contexts to produce a coherent body of work that meets professional standards.\nCORE CONTENT\nExtending and building on the basic skills acquired in the second year, with specific emphasis on developing in-depth knowledge and expertise in their application.\nThe integration of traditional discipline specific skill sets within contemporary studio practice, making specific reference to local, South African and Global practitioners.\nFormulation of a written statement of intent within the contexts and/or projects stipulated.\nIdentification, research and exploration of visual and written data in support of the statement of intent.\nStudio and department reviews and critiques to develop a mature grasp of the formal dynamics of the chosen medium, with emphasis on coherent communication within the academic and discipline specific discourse\nThe production of a coherent body of work which reflects all of the above, and which is presented within the context of a final portfolio exhibition.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nSculpture Ii  (KAJ201)\nDrawing Ii  (KDR210)\nInterdisciplinary Studies Ii  (KIS210)\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KAL310",
        "name": "Printmaking Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R29430\nLecturer(s): NYONI, VPE; STAPLE, JL;\nSyllabus\nPURPOSE\nTo enable the student (through the acquisition of skills, understanding and knowledge) to produce a coherent body of printmaking / illustration artefacts that reflects a contemporary approach to image making and that conforms to professional standards.\nLEARNING OUTCOMES\nAfter completing this module students will be able to:\nexplore and articulate historical and contemporary approaches to image making through research, analysis and synthesis;\ngenerate a range of printmaking / illustration artefacts that reflect of a range of methods of enquiry and practice within the discipline of printmaking / illustration and their suitability to the resolution of the creative construct;\nparticipate in cross-disciplinary critiques by developing and communicating personal ideas and opinions in well-formed arguments, using appropriate academic and professional discourse;\nidentify, analyse, evaluate and critically reflect on and address complex visual, creative and structural problems;\napply evidence based solutions and cogent theory driven arguments;\nattain the requisite crafting, technical and technological competency and professional practice compliancy for the field of Fine Art;\nwork thematically within defined contexts to produce a coherent body of work that meets professional standards.\nCORE CONTENT\nExtending and building on the basic skills acquired in the second year, with specific emphasis on developing in depth knowledge and expertise in their application.\nThe integration of traditional discipline specific skill sets within the contemporary studio practice, making specific reference to local, South African and Global practitioners.\nFormulation of a written statement of intent within the contexts and/or projects stipulated.\nIdentification, research and exploration of visual and written data in support of the statement of intent.\nStudio and department reviews and critiques to develop a mature grasp of the formal dynamics of the chosen medium, with emphasis on coherent communication within the academic and discipline specific discourse.\nThe integration of traditional discipline specific skill sets within contemporary studio practice.\nThe production of a coherent body of work which reflects all of the above, and which is presented within the context of a final portfolio exhibition.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nPrintmaking Ii  (KAL202)\nDrawing Ii  (KDR210)\nInterdisciplinary Studies Ii  (KIS210)\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KAP310",
        "name": "Painting Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R26520\nLecturer(s): JONES, DA; STAPLE, JL;\nSyllabus\nPURPOSE\nTo enable the student (through the acquisition of skills, understanding and knowledge) to produce a coherent body of painting artefacts that reflects a contemporary approach to image making and that conforms to professional standards.\nLEARNING OUTCOMES\nAfter completing this module students will be able to:\nexplore and articulate historical and contemporary approaches to image making through research, analysis and synthesis;\ngenerate a range of painted artefacts that reflects a range of methods of enquiry and practice within the discipline of painting and their suitability to the resolution of the creative construct;\nparticipate in cross-disciplinary critiques by developing and communicating personal ideas and opinions in well-formed arguments, using appropriate academic and professional discourse;\nidentify, analyse, evaluate and critically reflect on and address complex visual, creative and structural problems;\napply evidence based solutions and cogent theory driven arguments;\nattain the requisite crafting, technical and technological competency and professional practice compliancy for the field of Fine Art;\nwork thematically within defined contexts to produce a coherent body of work that meets professional standards.\nCORE CONTENT\nExtending and building on the basic skills acquired in the second year, with specific emphasis on developing in depth knowledge and expertise in their application.\nThe integration of traditional discipline specific skill sets within contemporary studio practice, making specific reference to local, South African and Global practitioners.\nFormulation of a written statement of intent within the contexts and/or projects stipulated.\nIdentification, research and exploration of visual and written data in support of the statement of intent.\nStudio and department reviews and critiques to develop a mature grasp of the formal dynamics of the chosen medium, with emphasis on coherent communication within the academic and discipline specific discourse.\nThe production of a coherent body of work which reflects all of the above, and which is presented within the context of a final portfolio exhibition.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nPainting Ii  (KAP201)\nDrawing Ii  (KDR210)\nInterdisciplinary Studies Ii  (KIS210)\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KCC310",
        "name": "Ceramics Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R27900\nLecturer(s): JONES, DA; STAPLE, JL;\nSyllabus\nPURPOSE\nTo enable the student (through the acquisition of skills, understanding and knowledge) to produce a coherent body of ceramic artefacts that reflects a contemporary approach to image making and that conforms to professional standards.\nLEARNING OUTCOMES\nAfter completion of this module students will be able to:\nexplore and articulate historical and contemporary approaches to image making through research, analysis and synthesis;\ngenerate a range of ceramic artefacts that reflects a range of methods of enquiry and practice within the discipline of ceramics and their suitability to the resolution of the creative construct;\nparticipate in cross-disciplinary critiques by developing and communicating personal ideas and opinions in well-formed arguments, using appropriate academic and professional discourse;\nidentify, analyse, evaluate and critically reflect on and address complex visual, creative and structural problems;\napply evidence based solutions and cogent theory driven arguments;\nattain the requisite crafting, technical and technological competency and professional practice compliancy for the field of Fine Art;\nwork thematically within defined contexts to produce a coherent body of work that meets professional standards.\nCORE CONTENT\nExtending and building on the basic skills acquired in the second year, with specific emphasis on developing in depth knowledge and expertise in their application.\nThe integration of traditional discipline specific skill sets within contemporary studio practice, making specific reference to local, South African and Global practitioners.\nFormulation of a written statement of intent within the contexts and/or projects stipulated.\nIdentification, research and exploration of visual and written data in support of the statement of intent.\nStudio and department reviews and critiques to develop a mature grasp of the formal dynamics of the chosen medium, with emphasis on coherent communication within the academic and discipline specific discourse.\nThe production of a coherent body of work which reflects all of the above, and which is presented within the context of a final portfolio exhibition.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nCeramics Ii  (KCC202)\nInterdisciplinary Studies Ii  (KIS210)\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KGG310",
        "name": "Glass Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R16930\nLecturer(s): JONES, DA;\nSyllabus\nPURPOSE\nTo enable the student (through the acquisition of skills, understanding and knowledge) to produce a coherent body of glass artefacts that reflects a contemporary approach to image making and that conforms to professional standards.\nLEARNING OUTCOMES\nAfter completing this module students will be able to:\nexplore and articulate historical and contemporary approaches to image making through research, analysis and synthesis;\ngenerate a range of glass artefacts that reflects a range of methods of enquiry and practice within the discipline of art glass and their suitability to the resolution of the creative construct;\nparticipate in cross-disciplinary critiques by developing and communicating personal ideas and opinions in well-formed arguments, using appropriate academic and professional discourse;\nidentify, analyse, evaluate and critically reflect on and address complex visual, creative and structural problems;\napply evidence based solutions and cogent theory driven arguments;\nattain the requisite crafting, technical and technological competency and professional practice compliancy for the field of Fine Art;\nwork thematically within defined contexts to produce a coherent body of work that meets professional standards.\nCORE CONTENT\nExtending and building on the basic skills acquired in the second year, with specific emphasis on developing in depth knowledge and expertise in their application.\nThe integration of traditional discipline specific skill sets within contemporary studio practice, making specific reference to local, South African and Global practitioners.\nFormulation of a written statement of intent within the contexts and/or projects stipulated.\nIdentification, research and exploration of visual and written data in support of the statement of intent.\nStudio and department reviews and critiques to develop a mature grasp of the formal dynamics of the chosen medium, with emphasis on coherent communication within the academic and discipline specific discourse\nThe integration of traditional discipline specific skill sets within contemporary studio practice.\nThe production of a coherent body of work which reflects all of the above, and which is presented within the context of a final portfolio exhibition.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nDrawing Ii  (KDR210)\nGlass Ii  (KGG202)\nInterdisciplinary Studies Ii  (KIS210)\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KCD310",
        "name": "Communication Design Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R26390\nLecturer(s): BOTCHWAY, NC; CADLE, BS; NYONI, VPE; SWANEPOEL, ML;\nSyllabus\nPURPOSE\nThe purpose of this module is to provide students with comprehensive academic and vocational training that will equip them for productive employment in the advertising, design, display, publishing, packaging, identity and other design fields and enable them to develop innovative formal and conceptual approaches to solving graphic design problems in a variety of industry appropriate media contexts.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\ngenerate graphic design solutions that show integrated knowledge, understanding and application of the principles, methods, technologies and proficiencies in the field of Graphic Design;\ngenerate process work that indicates advanced engagement with critical thinking, problem solving, reflective practice and research in conceptualising, planning, pre-visualising and executing creative and innovative graphic design solutions;\ndemonstrate through verbal presentation, process work, graphic design solutions and/or written work, an understanding of the appropriateness of context and of the designer's relationship with audiences, client, markets, users, consumers, and/or participants;\ndevelop, present and communicate complex ideas and opinions in academic discourse, coherently using appropriate methods, formats and tools for a variety of audiences;\ninteract effectively and creatively with others and apply graphic design knowledge and skills in related fields, for example through collaboration and collective endeavour in interdisciplinary collaborations;\ndemonstrate an understanding of and commitment to ethical conduct as it relates to social, cultural and environmental responsibility in the production and content of graphic design solutions.\nCORE CONTENT\nIntegrated knowledge and application of the following competencies:\nDesign process\nVisual communication\nTypography\nProblem solving, innovative and conceptual thinking\nLayout and organization\nAs applied to:\nInformation Graphics\nPublishing\nCorporate identity\nPackaging Design\nPromotion and Advertising\nInteractive Design\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nCommunication Design Ii  (KCD210)\nInterdisciplinary Studies Ii  (KIS210)\nVisual Studies Ii  (KVS210)"
    },
    {
        "module": "KGD310",
        "name": "Graphic Design Visualisation Tech Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): BOTCHWAY, NC; ECONOMOU, IO; NYONI, VPE;\nSyllabus\nPURPOSE\nThe purpose of this module is to develop advanced competency in seeing, interpreting and translating a variety of complex visual forms for the purpose of communicating design ideas, concepts and/or generating illustration.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nselect and apply a range of advanced drawing and visualisation methods, media and tools appropriate to graphic design contexts;\nidentify and resolve complex formal problems, including structure, composition, perspective, form and proportion, for graphic design visualisation;\npre-visualise, interpret and communicate complex design ideas and design elements within a variety of graphic design contexts.\nCORE CONTENT\nSpecialisation in selected media and tools appropriate in visualising and rendering for graphic design contexts.\nGestural sketches and resolved formal renderings of the human figure, complex organic and mechanical objects.\nAdvanced illustration for the communication of ideas within a graphic design context.\nThe development of a visual journal that reflects research pertaining to critical reflection and visualisation in a graphic design context.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nGraphic Design Visualisation Tech Ii  (KGD210)"
    },
    {
        "module": "KPP310",
        "name": "Photography Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 60\nEstimated fees: R16930\nLecturer(s): AARTS, JR; HOPWOOD, TW; MEYER, GM;\nSyllabus\nPURPOSE\nThis module builds on the technical and aesthetic photographic skills developed in the second year of study and culminates in a final year portfolio.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nresolve visual problems, that span a range of knowledge and experience, with creative photographic visual solutions;\nproblem solve and use creativity beyond the traditionally perceived boundaries of photographic output;\npractice trans disciplinary engagement and produce creative outputs through interdisciplinary collaboration;\napply a human-centred approach to communication, creative outputs and social commentary that considers cultural, economic, environmental sustainability, political and social impact;\nreflect advanced technical and technological competency and professional practice compliancy for the field of photography;\ngenerate advanced, industry related knowledge of photographic / digital imaging processes, materials and apparatus through hands-on experience in the field, the studio or on professional assignment;\nproduce a series of professional and creative photographic images that demonstrate an ability to engage in critical thinking and reflective practice;\nprovide evidence, through the presentation of a portfolio of work, of an ability to practice as a professional within the discipline of photography;\nreflect on the importance of business principles and the professional photographic environment through exposure to real-life situations, professional associations and commercially driven projects.\nCORE CONTENT\nAdvanced self-expressive and commercial applications of photographic practice.\nAdvanced technical skills, in various camera formats, related to the aesthetic and communicative role of photographic practice.\nAn in-depth understanding of relevant software, image management and printing requirements related to professional photographic output.\nSpecialised applications of photographic practice.\nMultimedia and time based media applications in photographic practice.\nSelf-reflective skills in order to work independently in a complex environment.\nAbility to identify, evaluate and address his or her learning needs in a self-directed manner.\nAbility to facilitate collaborative learning processes.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nPhotography Ii  (KPP210)\nPhotographic Visualisation Tech Ii  (KPV210)"
    },
    {
        "module": "KPV310",
        "name": "Photographic Visualisation Tech Iii",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: Yes\nOffered in: Term 1+2+3+4\nCredit value: 18\nEstimated fees: R5080\nLecturer(s): AARTS, JR; HATTINGH, HM; HOPWOOD, TW; MEYER, GM;\nSyllabus\nPURPOSE\nThis module develops the student’s skill in advanced visual communication, and fosters connections between visual research, critical reflection, and visualisation techniques with the emphasis on the student’s engagement with concepts, themes and solving visual problems relating to their chosen focus within photography and lens-based media.\nLEARNING OUTCOMES\nOn completion of this module students will be able to:\nengage self-critically with advanced visualisation media and critically apply photography specific approaches to visual communication;\nidentify, analyse and resolve advanced formal problems within the structured studio programme;\ncommunicate advanced ideas within a photographic context;\ndefine and resolve visual problems related to an individual direction within a photographic discipline.\nCORE CONTENT\nSpecialisation within a chosen approach to visualisation, through digital imaging, lighting systems and/or photographic rendering.\nIn-depth studies of complex photographic subjects.\nCommunication of advanced visual ideas within the context of structured studio programme and independent studies.\nApplication of visual research methodologies to a defined direction within a photographic context.\nIntroduction to alternative and scientific imaging processes and technologies for the production of non-traditional photographic outputs.\n Evaluation criteria\nFormative assessment during the year and summative assessment in November in the form of a final portfolio examination. A minimum coursework mark of 50% is required to gain entrance to the portfolio examination. Pass mark 50%.\nMODERATION\nExternal moderator, together with departmental panel.\n Prerequisites needed for this module\nPhotographic Visualisation Tech Ii  (KPV210)"
    },
    {
        "module": "SFV222",
        "name": "Philosophical Practice- Intepretation & Art",
        "description": "SUMMERSTRAND CAMPUS NORTH: Full-Time (01)\nCan be used as a major: No\nOffered in: Term 1+2\nCredit value: 10\nEstimated fees: R3390\nLecturer(s): KONIK, I; WELDRICK, AS;\nSyllabus\nRegrettably no information is currently available. Please contact your Faculty Administration office to assist with this information.\n Prerequisites\nNone"
    }
]
