[
    {
        "Qualification": "BA",
        "ID": 167,
        "Qualification Code": "B7023Q",
        "APS": 27,
        "Description": "Anthropologist, Ethicist, Social Responsibility Officer, Manager of Multicultural and Gender Affairs, General Manager, Teacher, Human Resources Development, Public Governance, Civil Service, Politics, Financial Sector, Journalist, Ethicist, Social Responsibility Officer, Manager of Multicultural and Gender Affairs, Development Planner, Development Administrator, Researcher, work for NGOs, Government or Private Sector, Director, Producer, Script Writer, Production Crew, Journalism, Copywriting, Corporate Journalism, Translators, Interpreters, Language Planners, Copywriters, Copy Editors, Literary Reviewers, Visual/Literary Specialists, Language Teachers/ Trainers, Public Relations, Marketing, Human Resources, Account Manager, Strategic Planner, Media Planner, Brand Manager, Marketing Communication Practitioner, Communication Researcher, Communication Consultant, Psychologist (postgraduate studies required).",
        "ENTRANCE": [
            "AND",
            [
                "OR",
                {
                    "subjectid": "English",
                    "minmark": 60,
                    "required": true
                }
            ],
            [
                {
                    "subjectid": "Mathematics",
                    "minmark": 50,
                    "required": true
                }
            ]
        ]
    },
    {
        "Qualification": "BA with specialisation in LANGUAGE PRACTICE",
        "ID": 168,
        "Qualification Code": "B7026Q",
        "APS": 27,
        "Description": "Language practitioner (translator, text editor, interpreter), language planner, language manager, lexicographer, terminologist, copy writer, journalist, subtitler, plain language specialist.",
        "ENTRANCE": [
            "AND",
            [
                "OR",
                {
                    "subjectid": "English",
                    "minmark": 60,
                    "required": true
                }
            ]
        ]
    },
    {
        "Qualification": "BA with specialisation in POLITICS, ECONOMICS AND TECHNOLOGY",
        "ID": 169,
        "Qualification Code": "B7024Q",
        "APS": 27,
        "Description": "Apprentice data analyst, Researcher, Account manager, Sales data management and development, Business development, Trainee analyst, Import/export administrator, Financial operations, Information management, Economic analysis, Postgraduate study.",
        "ENTRANCE": [
            "AND",
            [
                "OR",
                {
                    "subjectid": "English",
                    "minmark": 60,
                    "required": true
                }
            ],
            [
                {
                    "subjectid": "Mathematics",
                    "minmark": 50,
                    "required": true
                }
            ]
        ]
    },
    {
        "Qualification": "COMMUNITY DEVELOPMENT AND LEADERSHIP",
        "ID": 170,
        "Qualification Code": "B7015Q",
        "APS": 27,
        "Description": "Municipalities, Government Departments (e.g. Department of Social Development) and Non-Government Organisations (focusing on development work).",
        "ENTRANCE": [
            "AND",
            [
                "OR",
                {
                    "subjectid": "English",
                    "minmark": 60,
                    "required": true
                }
            ]
        ]
    }
]