[
  {
    "Institution": "UKZN",
    "Code": "ARCH205",
    "Course": "History of Architecture 2A",
    "Description": "Aim: An introduction to the interaction between religion and architecture and the related arts.Content: The art and architecture of the Early Christian, Byzantine, Romanesque and Gothic periods; exotic and Easternarchitecture; and the related arts and gardens.Practicals: Projects involving library and computer searches."
  },
  {
    "Institution": "UKZN",
    "Code": "CMDV304",
    "Course": "Community Profiling",
    "Description": "Aim: To develop an understanding of the art and methods of community profiling and to develop basic skills for working,with both qualitative and quantitative data. Some of the skills developed will be community access strategies, techniques,of community disaggregation, key stake-holder and key informant representation and analysis. Such skills include both,qualitative and quantitative techniques of data presentation and analysis.,Content: Community Profiling, Stakeholder analysis, Community Mobility Mapping, Livelihoods Time Clock Analysis,,Interviewing, Focus group discussion, Observation, Descriptive statistics, Data Analysis,"
  },
  {
    "Institution": "UKZN",
    "Code": "CPIE602",
    "Course": "Theoretical Foundations in CP in Emergencies",
    "Description": "Aim: To provide students with an understanding of the fundamental theories and to develop as critical and reflectivepractitioners who can ethically and effectively prevent and respond to child protection issues in humanitarianemergencies.Content: The application of ecosystemic understandings of childhood; the impact of emergency situations on children,parents and families, in general; the application of conceptual frameworks and theories related to the principles andapproaches to child protection programming, including prevention of child abuse, neglect, violence and exploitation;Ethics of Child Protection in Emergency ."
  },
  {
    "Institution": "UKZN",
    "Code": "CPIE604",
    "Course": "Project Planning in CP in Emergencies",
    "Description": "Aim: To further investigate and build competences o to introduce students to advanced procedures and techniques of,project planning. To further investigate and build competences of applying the project cycle and manage elements of,work in the emergency field,Content: Project planning procedures, including the preparation of project proposals; plans and budgets; the design and,implementation of projects or programmes; the planning of projects or programme; the evaluation of the implementation,of projects and programmes and the analysis of project and programme impact.,"
  },
  {
    "Institution": "UKZN",
    "Code": "CPIE606",
    "Course": "Service Placement in the CP in Emergencies",
    "Description": "Aim: To place students within a service learning environment to apply the knowledge, skills and appropriate attitudes,acquired during the other five modules. To expose the student to the broader interagency elements of CPIE by placing,students in a programme focused placement in an on-going emergency where they may engage in prevention and response,activities related to assessment, project design or implementation, and monitoring and evaluation.,Content: Application of knowledge and skills learned in preceding modules; Knowledge and understanding of multi-context,settings and humanitarian emergencies.,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS702",
    "Course": "SA Development Problems and Policies",
    "Description": "Aim: This module interrogates the historical and contemporary political, economic, social and cultural anchors of South,Africas development challenges. Particularly, the module examines South Africas place in the global neoliberal,economic order and apartheid and post-apartheid development policies.,Content: The approach of this module is to consider in depth analyses of major developmental themes as they relate to,South Africa. These themes will be somewhat dynamic in order to be able to adjust the module to cover what is most,relevant from year to year, but will draw from topics.,Practicals: None,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS706",
    "Course": "Special Studies Contemporary Issues in DS Int",
    "Description": "Aim: This module will provide students with an opportunity to locate their studies in a development-related organisation,and engage in problem solving in a real world environment.,Content: A student registered for this module must: identify a key question or problem in development studies/population,studies; describe and critique strategies to address the question or problem; develop practical skills while collecting,,organising and evaluating information; and report on the question or problem and the process of solving it.,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS708",
    "Course": "Development Frameworks",
    "Description": "Aim: This module provides a framework for the field of development studies. It poses some of the fundamental questionsin development studies and examines the different kinds of answers that have been offered in response to them. Theaim of this is to provide a sense of the diversity of answers to the key development problems.Content: Development frameworks poses developments key questions: What is the nature of global inequality? Howhas uneven development been explained? What are the key mechanisms of development? How has development beendefined? Each of these questions invokes a rich history of theoretical and applied engagement with the problems posed.Practicals: None"
  },
  {
    "Institution": "UKZN",
    "Code": "Aim: This course asks students to consider why some countries are considered ‘developed and others not. What factors",
    "Course": "DEVS803",
    "Description": "are responsible for producing ‘development in some countries and not in others i.e., Why do some countries succeed,and some not? What are the key 'agencies' of development and do they operate in much the same way across different,contexts?,Content: This course consists of a critical study of three sets of issues: the first explores the meaning of 'development',and examines the major theoretical schools and paradigms of 'development'. The second sets out some of the political,complexities and tensions which surrounds development, especially in respect of development strategy and,implementation. The third part presents a view of development thinking, strategy and practice in three different regions,of the world - Latin America in the immediate post-war era, as well as in the 1980s and 1990s; Asia in the era of the east,Asian miracle and more recent case studies of China and India; finally African development challenges both in the,immediate post-colonial era, and in the contemporary period.,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS826",
    "Course": "Special Studies A: Independent Study",
    "Description": "Aim: To help students conduct independent research. It will provide students with an opportunity to engage in problem,solving in a real world environment during their studies. A student interested in special studies will approach the academic,coordinator with a proposed topic. A supervisor will be identified to supervise the special study. The supervisor will be,selected from the senior academic staff in the School.,Content: A student registered for this module must: identify a key question or problem in Development Studies or,Population Studies; describe and critique strategies to address the question or problem; develop practical skills while,collecting, organising and evaluating information; and report on the question or problem and the process of solving it.,Students will be encouraged to interact with development practitioners.,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS828",
    "Course": "Special Studies C: Formal Seminars",
    "Description": "Aim: This module will provide the learner with a learning environment featuring contemporary debate not included as,,part of the standard set of modules offered by the School. A leading development expert facilitates the module. The,,school has historical academic and research collaborations and exchange programmes with leading global Development,,Studies institutions. Students will benefit from the expertise of a visiting lecturer who will develop a special course during,,their visit. The module content would be original and cover contemporary themes not addressed in other modules.,,Content: The approach of this module is to consider in depth analyses of major developmental themes as they relate to,,the African context. These themes will be somewhat dynamic in order to be able to adjust the module to cover what is,,most relevant based on the expertise of the visiting scholars. Examples of common themes in development debates will,,include, but will not be limited to any of the following: globalisation, African political economy, industrialisation and,,industrial policy; agrarian reform, urban politics; rural development; small business development, informal economy;,,poverty and inequality; financialisation; education and development, environmental politics; regional economic,,development.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS830",
    "Course": "Advanced Economic Concepts for Development",
    "Description": "Aim: The module provides students with a very thorough understanding of the terminology, theories and debates in,,Economics so that they are able to engage in advanced debates on development within the discipline of Economics and,,the broader field of Development Studies.,,Content: The module provides students with a thorough knowledge of the terminology used in Economics and the key,,theories and debates in Economics relevant to understanding advanced development theories/arguments. The module,,covers topics such as the operation (and failure) of markets in a capitalist economy,,"
  },
  {
    "Institution": "UKZN",
    "Code": "Aim: To equip students with additional more advanced research skills.",
    "Course": "DEVS833",
    "Description": "Content: The module focuses on techniques from three areas of research: modelling during the research design stage,,advanced procedures for quantitative analysis (using Stata), and procedures for qualitative analysis supported through,use of software (NVIVO).,"
  },
  {
    "Institution": "UKZN",
    "Code": "DEVS835",
    "Course": "Economics of Development",
    "Description": "Aim: This module aims to expose students to key debates in economic development, and critically to discuss the key,economic development policy issues currently facing developing countries, especially African countries. These include:,poverty alleviation, equity and income distribution, trade and industrial policy, labour market policies, the informal,economy, and fiscal and monetary policy.,Content: The module scans and critically explores the historical trajectory of development economics as a sphere of,study within economics and highlights the important contemporary debates about the role of development economics.,The module critiques neo-classical development economics and develops a more comprehensive model for assessing,policy choices for developing countries, especially countries in Africa.,Practicals: None,"
  },
  {
    "Institution": "UKZN",
    "Code": "Aim: The module is intended to prepare learners for dissertation research by facilitating acquisition of skills (at an",
    "Course": "POPS702",
    "Description": "intermediate level) in application of techniques used in the measurement of population change, mortality, fertility,,marriage and migration,Content: This module provides students with an introduction to concepts and measures of population change, and,specifically equip students on how to analyse demographic data to estimate levels of demographic events.,Practicals: The class consists of problem sets (home-works). These are practical exercises that form 20% of the class.,Furthermore, there will be tutorial sessions, where students will estimate demographic parameters,"
  },
  {
    "Institution": "UKZN",
    "Code": "POPS704",
    "Course": "Reproductive Health in Context",
    "Description": "Aim: The aim of the module is to ensure that students have theoretical as well as practical knowledge in population and,reproductive health issues and dynamics,Content: The module introduces students to the scope of reproductive health and in particular examines the multiple,reproductive health needs of men and women in various socio-cultural and political contexts in developing countries. In,doing so, it pays particular attention to gender-power dynamics and their impact on reproductive health outcomes.,"
  },
  {
    "Institution": "UKZN",
    "Code": "POPS706",
    "Course": "Social Aspects of HIV/AIDS",
    "Description": "Aim: The aim of the module is to ensure that population studies students have an advanced understanding of the socio-,economic, biomedical and demographic background to the spread of the HIV/AIDS epidemic in Southern Africa.,Content: The module critically analyses the major social and contextual dimensions of HIV/AIDS at both the individual and,societal level. Although there is no cure for AIDS, the transmission of HIV can be prevented. The module will investigate the,role of different prevention strategies in reducing the risk of HIV infection,Practicals: None,"
  },
  {
    "Institution": "UKZN",
    "Code": "DRAM304",
    "Course": "Drama & Performance Studies 304",
    "Description": "Aim: Learners will demonstrate an advanced critical and analytic competence in the engagement with late 20th and,early 21st century performing and visual arts in relation to theory and text.,Content: This module covers the politics of the ‘postmodern in theatre, media, film, dance, and textual studies, and,includes the practical application of these theoretical paradigms.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ECHS702",
    "Course": "Environmental History/Policy",
    "Description": "Aim: To involve students in the main themes in the field of environmental history and policy making. To develop,advanced cognitive, writing, presentation and research skills. To acquire a thorough knowledge of current critical debates,and an ability to grasp the theoretical and philosophical underpinnings of the field of knowledge.,Content: A broad overview of the key concepts, and theoretical paradigms, concerns and issues that have influenced,environmental history and policy making, specifically in South Africa. Debates on conservation, ecological footprints,,pollution, environmental justice and so forth.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC112",
    "Course": "Economics and Management Sciences 2",
    "Description": ",Aim: The aim of the module is to enable student teachers to develop introductory content knowledge and skills as it,,,relates to entrepreneurship.,,,Content: This module introduces students to introductory content knowledge and skills as it relates to basic,,,entrepreneurship.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC114",
    "Course": "Accounting Education 2",
    "Description": ",Aim: The aim of the module is to develop content knowledge and skills as it relates to Manufacturing Entities, Non-Profit,,,Entities and Inventories.,,,Content: Manufacturing Entities Non-Profit Entities Inventories,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC201",
    "Course": "Accounting Method 1",
    "Description": ",Aim: To explore different learning theories and their application to Accounting teaching. To introduce the novice,,,,,Accounting teacher to basic curriculum issues in Accounting. Explore various approaches to teaching Accounting,,,,,Education 210 topics.,,,,,Content: The place of Accounting in the school curriculum Issues in Accounting Education Critical Theories of,,,,,learning and their implications for accounting teaching Methodologies for effective accounting classroom Lesson,,,,,planning and assessment in Accounting education,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC211",
    "Course": "Economic & Management Sciences Method 1",
    "Description": ",Aim: To introduce students to curriculum, pedagogy and assessment issues with a view to developing learning,,,,,programmes as it relates to the teaching of EMS with a focus on teaching basic entrepreneurship, taking cognisance of,,,,,the learner diversity and diverse teaching and learning contexts.,,,,,Content: An introduction to teaching and learning theories as it relates to teaching basic entrepreneurship. An,,,,,introduction to curriculum theory as it relates to teaching basic entrepreneurship. An introduction to assessment as it,,,,,relates to teaching basic entrepreneurship An introduction to learning programme development as it relates to teaching,,,,,basic entrepreneurship Teaching resource development as it relates to teaching basic entrepreneurship.,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC213",
    "Course": "Economics and Management Sciences 4",
    "Description": ",Aim: To enable student teachers to develop content knowledge and skills as it relates to introductory economic,,,,,knowledge.,,,,,Content: This module introduces students to introductory economics content knowledge and skills.,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC215",
    "Course": "Accounting Education Method 1",
    "Description": ",Aim: The aim of the module is to introduce students to curriculum, pedagogy and assessment issues with a view to,,,,,developing learning programmes as it relates to the teaching of Accounting for Sole Traders, taking cognisance of the,,,,,learner diversity and diverse teaching and learning contexts.,,,,,Content: An introduction to teaching and learning theories as it relates to accounting for Sole Traders. An introduction,,,,,to curriculum theory as it relates to accounting for Sole Traders. An introduction to assessment as it relates to,,,,,accounting for Sole Traders. An introduction to learning programme development as it relates to teaching accounting,,,,,for Sole Traders. Teaching resource development as it relates to teaching accounting for Sole Traders.,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC301",
    "Course": "Accounting Method 2",
    "Description": ",Aim: To explore different pedagogical approaches to teaching Sole Traders, Partnerships and Reconciliations.,,,,,Content: Application of learning theories to the teaching of Sole Traders and Partnerships (Accounting equation, source,,,,,documents, subsidiary journals, ledger accounts, basic year-end adjustments),,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC311",
    "Course": "Economic and Management Sciences Method 2",
    "Description": ",Aim: To introduce students to curriculum, pedagogy and assessment issues with a view to developing learning,,,,,programmes as it relates to the teaching of EMS with a focus on teaching accounting for sole traders, taking cognisance,,,,,of the learner diversity and diverse teaching and learning contexts.,,,,,Content: An introduction to teaching and learning theories as it relates to teaching accounting for sole traders. An,,,,,introduction to curriculum theory as it relates to teaching accounting for sole traders. An introduction to assessment as,,,,,it relates to teaching accounting for sole traders An introduction to learning programme development as it relates to,,,,,teaching accounting for sole traders Teaching resource development as it relates to teaching accounting for Sole,,,,,Traders.,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC313",
    "Course": "Accounting Education 4",
    "Description": ",Aim: To enable students to develop content knowledge and skills as it relates to Cash Budgets, projected Income,,,,,Statements and Accounting for Branches.,,,,,Content: Cash Budgets (for Sole Trader and Companies) Projected Income Statement (For Sole Trader and,,,,,Companies) Centralised and decentralised Branches,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC320",
    "Course": "Accounting Education 320",
    "Description": ",Aim: To further develop knowledge and skills required for accounting for a close corporation and budgeting.,,,,Content: -Close corporation Ledger Accounts. Year-end adjustments. Advanced financial statements in Close,,,,Corporation. Analysis and interpretation of company financial statements for partnerships. Close Corporation. -,,,,Budgeting Cash Budgets. Forecasted Income Statements.,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC410",
    "Course": "Accounting Education 410",
    "Description": ",Aim: The aim of the module is to enable student teachers to develop content knowledge and skills as it relates to Non-,,,,profit Organisations, Stock valuation, Manufacturing concerns and VAT Accounting,,,,Content: -Non-profit Organisations Ledger Accounts Year-end adjustments. Advanced financial statements of a,,,,Non-profit Organisations. Analysis and interpretation of Non-profit Organisations. -Manufacturing concerns,,,,Manufacturing accounts. Financial Statements of a manufacturing concern. -VAT Accounting -Stock Valuation FIFO,,,,method Weighted average method. Specific identification method.,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC412",
    "Course": "Accounting Education Method 3",
    "Description": ",Aim: To develop students knowledge on curriculum, pedagogy and assessment issues with a view to developing,,,,learning programmes as it relates to the teaching of Accounting for Companies and Partnerships as forms of business,,,,ownership.,,,,Content: Teaching and learning theories as it relates to accounting for Companies and Partnerships as forms of,,,,business ownership. Curriculum theory as it relates to accounting for Companies and Partnerships as forms of business,,,,ownership. Assessment as it relates to accounting for Companies and Partnerships as forms of business ownership.,,,,Teaching and learning resource development as it relates to teaching accounting for Companies and Partnerships as,,,forms of business ownership.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC601",
    "Course": "Accounting Teaching 601",
    "Description": "Aim: To develop students knowledge and skills in curriculum and pedagogy as they relate to teaching the subject ofAccounting in the FET phase within the national school curriculum framework. To develop competence in teachingAccounting in the FET phase (grades 10 to 12).Content:The nature of Accounting (origin, evolution and contemporary debates)Teaching and learning theories asthey relate to teaching Accounting (constructivist and critical constructivists approaches)Curriculum theory as it relatesto teaching Accounting (liberal and post-liberal approaches to curriculum development)Campus based peer teaching,peer observation and reflection within the context of FET Accounting teaching in the school curriculum.Resourcedevelopment for Accounting teaching in the school curriculum."
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC606",
    "Course": "Economics Teaching 602",
    "Description": ",Aim: To develop students knowledge and skills in pedagogy and assessment as they relate to teaching the subject of,,,Economics in the FET phase within the national school curriculum framework. To develop competence in teaching,,,Economics in the FET phase (grades 10 to 12).,,,Content:Pedagogical issues in teaching and learning Economics (including economics pedagogy as problem-solving,,,pedagogy)Assessment theory and methods in Economics (including formative and summative assessment, rubrics and,,,feedback)Barriers to teaching and learning in Economics (including mathematical, reading and writing challenges),,Resources development in Economics in the school curriculumEconomics knowledge as contestable knowledge,,,(including ideology in economic theory)Teaching ethics and accountability in Economics (including social justice and,,,economics teaching),,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAC601",
    "Course": "Accounting Teaching 601",
    "Description": "Aim: To develop students knowledge and skills in curriculum and pedagogy as they relate to teaching the subject of,Accounting in the FET phase within the national school curriculum framework. To develop competence in teaching,Accounting in the FET phase (grades 10 to 12).,Content:The nature of Accounting (origin, evolution and contemporary debates)Teaching and learning theories as,they relate to teaching Accounting (constructivist and critical constructivists approaches)Curriculum theory as it relates,to teaching Accounting (liberal and post-liberal approaches to curriculum development)Campus based peer teaching,,peer observation and reflection within the context of FET Accounting teaching in the school curriculum.Resource,development for Accounting teaching in the school curriculum.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAE703",
    "Course": "Adult Literacy & Adult Basic Educ & Training",
    "Description": ",Aim: Students will examine the role of adult education curricula within various examples of adult education in society,,,,different curriculum theories, styles, and models for design; the concepts of needs, objectives, outcomes, innovation and,,,evaluation; implementation of curricula, including factors such as teaching methods and assessment.,,,Content: Curriculum research and development in adult education, the aims, design and implementation of adult,,,education curricula, evaluation of adult education initiatives, the application of relevant theory in curriculum development,,,and implementation in adult education.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAE705",
    "Course": "Foundations of Adult Education",
    "Description": "Aim: The aim of this module to provide students with a general overview of the Adult Education Field.,,Content: The content of this module includes the Philosophy of Adult Education, the Historical growth and development,,of Adult Education, the context of Adult Education, Adult Education and the community.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAE707",
    "Course": "Materials Development in Adult Education",
    "Description": "Aim: Students will examine: Print materials, some theoretical and practical considerations; reading theory; the role of,educational video and some important issues about its use; the theory of non-electronic particpatory materials and some,of the steps in designing and producing them.,Content: Print materials: advantages of print. Reading theory. Steps in production. Design and layout. Writing,illustrations and visual literacy. Evaluation. Video: Advantages of video. Important technical points. Participatory video.,Non-electronic participatory materials: Theoretical understandings. Steps in production. Some production skills. Design,considerations.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAE810",
    "Course": "Curriculum Studies in Adult Education",
    "Description": "Aim: Identify, explore, examine and analyse the contextual, philosophical and ideological issues that impact on the,design of learning programmes for adult participants; identify the main models used in designing learning programmes,for adults; analyse the major current adult education curricula in South Africa in light of the theory on curriculum/learning,programme design,Content: The themes are: defining and examining curriculum design; current developments and trends in curriculum,design; curriculum and learning programme models; curriculum design and learning needs; contextual issues in South,Africa; curriculum implementation in South Africa; factors that impact on curriculum implementation in South Africa;,dialogue, encounters and debates.,Practicals: One.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAE844",
    "Course": "Issues in Adult Literacy and Basic Education",
    "Description": "Aim: To provide an overview of key issues related to adult literacy in the context of developing countries. The module,focuses on key issues and debates in relation to what is understood by the term ‘literacy”, the uses and purposes of,literacy and adult basic education (ABE), approaches to ABE and methods for teaching literacy. The module will also,examine policy and provision of adult literacy and adult basic education in South Africa and refer to the relationship,between adult literacy, development, and globalisation,Content: The themes are: theoretical debates in the study of literacy and in the teaching of reading skills; policy,,legislation and approaches to provision of literacy and ABE and links between literacy and development.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR120",
    "Course": "Arts and Culture 120",
    "Description": "Aim: Experience the positive role played by the Arts in the forging of meaningful links between and among diverse,cultural groups as well as on an inter-personal level. Prepare students to teach the Arts and Culture Learning Area.,Content: Recognise, identify and classify the elements of texture and pattern and form within each art discipline, namely,visual arts, music, drama and dance and other creative pursuits. Devise resource packs which can be used to teach,these elements to learners at school.,Practicals: 4,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR210",
    "Course": "Arts and Culture 210",
    "Description": "Aim: Demonstrate an understanding of the elements of music: aurally, physically, visually and creatively. Exhibit an,ability to integrate the various elements and activities of arts education with each other in order to promote holisticeducation through the arts.Content: Develop knowledge and understanding of music of South Africa and investigate this music as social texts thatdeepen understandings of people and environments. Create meaningful links between the arts and other essentiallearning areas. Learn basic skills in each of the arts and accompanying them with theoretical knowledge.Practicals: 4"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR212",
    "Course": "Creative Arts Education 2",
    "Description": "Aim: To provide students with content knowledge and skills of Creative Arts Education that are necessary to enable,,progression into engagement with theories in Creative arts and social practices in Africa.,,Content: Develop a conceptual framework of creative arts and its relationship to society. Arts and social text that,,deepens understandings of people and environments.  Critically discuss role of Creative arts in education and society,, Develop theoretical knowledge and skills in Music, Visual Arts, Drama and Dance.  Art as a tool to create social ills ,,awareness in society and in education  meaningful links between components of arts and other learning areas ,,Continuation of skills development in each of the art  Stage performances and presentation on cultural groups in an,,African context  Staging a group production to create HIV/ child abuse etc. awareness in society  Use of art for freedom,,of expression for social change  Develop more knowledge and skills on elements of art such as patterns, colour , form,,Practicals: Music, drama, dance and visual arts practicals. A visit of a professional artist/artists to perform and workshop,,students,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR301",
    "Course": "Arts and Culture Method 2",
    "Description": "Aim: Integrate technical and structural elements in an imaginative, skilful and coherent way to represent artistic,expression occurring in each of the following areas: aural, visual, kinesthetic and tactile.,Content: Develop practical knowledge in the arts an how to teach the arts. Develop practical skills in the arts and how,to teach the arts. Develop ideas in the arts for teaching the arts in context.,Practicals: 4,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR312",
    "Course": "Creative Arts Education 3",
    "Description": "Aim: To provide students with content knowledge and skills of Creative Arts Education that are necessary to enable,progression into more deeper engagement with theories in Creative arts and cultural practices in Africa.,Content: Develop awareness of arts across diverse cultures Develop literacies and practical skills in Music, Visual,Arts, Drama and Dance. Developed attitude and knowledge of culture and art in an African context Deepened,understanding of culture, environment and its art forms Understanding of culture, its people and environments. through,art Create meaningful links between the creative arts and culture Integrate practical skills with the relevant theoretical,knowledge. Staging a cultural group activity relevant in a school setting encompassing all art forms,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR411",
    "Course": "Creative Arts Method 3",
    "Description": "Aim: To further develop students classroom teaching skills, philosophical and theoretical knowledge on Creative Artseducation. The aim is to provide students with well-rounded knowledge and research skills on the principles and practicesof teaching Creative Arts within an inclusive education framework.Content: (1) Teaching strategies based on individual qualities and talents in a selected chosen art form (2) DBEcurriculum document implementation and its challenges (3) Link between components of Creative Arts education andother learning areas (4) Various techniques/practices/activities that can be used in the classroom. (5) Creating a classor group activity and assessment strategies relevant in Creative Arts education (6) Use of visual aids and technology foreffective teaching and learning (7) Research topic on a chosen art form in relation to Creative Arts education (8) Practicalskills with pedagogical approaches that contribute to the effective Creative Arts class management"
  },
  {
    "Institution": "UKZN",
    "Code": "EDAR611",
    "Course": "Creative Arts Teaching 602",
    "Description": "Aim: The main purpose of this module is for student teachers to engage critically with pedagogical knowledge, skills and,values related to the teaching and learning of Creative Arts in the Senior Phase in the national school curriculum and to,develop students understanding of the schools curriculum, pedagogy and assessment as it relates to teaching of,Creative Arts.,Content:Advanced creative strategies for Creative Arts teaching and assessmentArts as a tool to create awareness,of societal issues such as HIV/Aids etc.Arts as a means of communication in the South African contextMulticulturalism,in Arts and Culture education and its challengesNational policy documents in relation to Creative Arts in the South,African contextCritical and current issues in Creative Arts educationCampus-based peer teaching, peer observation,and reflectionDevelopment of knowledge and understanding of the arts in past and present contexts,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBS330",
    "Course": "Life Science Education 4 Ecological Studies",
    "Description": "Aim: To develop appropriate knowledge, theories, skills, attitudes and values with regard to the environment in students,who wish to specialise in Biological Science Education.,Content: Biodiversity Ecosystem ecology Southern African biomes Energy flow (detail) Environmental issues –,global & local (includes the human impact-climate change, water, food security loss of biodiversity) Biogeological cycles Population ecology and population dynamics Community ecology (includes Interactions in the environment;,succession) Behavioural ecology (includes social organization in animals),Practicals: This module has a large fieldwork component. Selected practicals are conducted in the laboratory. Further,practical work is conducted during excursions. Students must complete 75% of practical work and/or fieldwork.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBS201",
    "Course": "Biological Science Method 1",
    "Description": "Aim: To develop an understanding of the nature of science, the principles of OBE and the ways in which learners learn,,science; to critically assess the role of practical work in the learning of Biology.,,Content: Nature of Science; Science and society; introduction to OBE in science; rationale for practical work.,,Practicals: 0,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBS220",
    "Course": "Biological Science for Educators 220",
    "Description": "Aim: Students to develop appropriate knowledge, skills, values and attitudes with regard to the Environment.,Content: Environmental Education; A study of a variety of Ecosystems; Interactions; Biodiversity; Population Dynamics.,Practicals: 4 and a number of excursions to study various ecosystems.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBS310",
    "Course": "Biological Science for Educators 310",
    "Description": "Aim: To develop appropriate knowledge, skills, values and attitudes with regard to processes in living organisms,Content: Biological Systems: Anatomy and physiology of systems in plants and animals, including systems related to,nutrition, transport (and immunity), respiration and reproduction. Evolutionary advancements in biological systems.,Practicals: 11,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBS340",
    "Course": "Life Science Education 2 Biological Systems",
    "Description": ",Aim: To extend students, who wish to specialise in Biological Sciences Education, knowledge of the diversity of life,,,,within the context of a comparative study of various systems. To enable students to develop the competence to apply,,,,these concepts and principles in relevant contexts.,,,,Content: Animal and plant tissues Heterotrophic nutrition, including comparative studies of digestive systems.,,,,Transport in plants Circulatory systems –comparative study Immunity and blood composition in mammals Gaseous,,,,exchange systems- comparative study Energy flow in biological systems-Photosynthesis and Cellular respiration,,,,Practicals: Students must complete 75% of practical work and/or fieldwork to relevant centres/sites as appropriate,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU201",
    "Course": "Business Management Method 1",
    "Description": ",Aim: To explore different learning theories and their application to Business Studies teaching.,,,,Content: The Place of Business Management in the school curriculum, An introduction to various approaches to,,,,teaching and learning Business Management in South African schools.,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU220",
    "Course": "Business Management 220",
    "Description": ",Aim: To extend students understandings of the business environment/world, the science of business management and,,,,the functioning of a business organisation.,,,,Content: General Management Principles, Planning and Organising in Management, Leadership and Control in,,,,Management,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU310 ",
    "Course": "Business Management 310",
    "Description": ",Aim: To expose students to the marketing process, marketing instruments and the use of integrated marketing,,,,strategies, and the role of the public relations department in an organisation.,,,,Content: The marketing process, marketing instruments, the public relations function.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU401",
    "Course": "Business Management Method 3",
    "Description": "Aim: To explore different pedagogical approaches to teaching Human Resources Management Operations,Management.,Content: Pedagogical approaches to teaching Human Resources Management Operations Management.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU420",
    "Course": "Business Management 420",
    "Description": "Aim: To examine the role of Financial Management in a business enterprise.,Content: Financial management, Asset management, Financing decisions of a business enterprise.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU602",
    "Course": "Business Studies Teaching 602",
    "Description": "Aim: To develop students knowledge and skills in curriculum and pedagogy as they relate to teaching the subject of,Business Studies in the FET phase within the national school curriculum framework. To develop competence in teaching,Business Studies in the FET phase (grades 10 to 12).,Content:Pedagogical issues in teaching and learning Business StudiesAssessment theory and methods in Business,Studies (including formative and summative assessment, rubrics and feedback)Barriers to teaching and learning in,Business Studies in the school curriculum (reading and extended writing challenges)Resources development in,Business Studies in the school curriculumBusiness Studies knowledge as contestable knowledgeTeaching ethics and,accountability in Business Studies (including corporate social responsibility),"
  },
  {
    "Institution": "UKZN",
    "Code": "EDBU702",
    "Course": "Economic and Business Sciences Education",
    "Description": "Aim: This module aims at providing graduate students with advanced curriculum development knowledge in the field of,Economic and Business Sciences with an emphasis on decolonial imperatives for the African context.,Content: The module includes the following topics: Neoliberalism and Economic and Business Sciences; Assessment,in Economic and Business Sciences; and Contemporary social justice issues in Economic and Business Sciences.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM111",
    "Course": "Intro to the Comp Syst & Data Representation",
    "Description": "Aim: To provide students with the necessary content and skills with which they can demonstrate an understanding of,,the theory of computer systems, computer architecture, number representation, advanced word processing, advanced,,,spreadsheet management, as well as demonstrate strong database management skills. The module develops cognitive,,,and conceptual knowledge and practical techniques in students.,,,Content: Introduction to the Computer System Computer Architecture Number Representation Logic and Boolean,,,algebra. Word-processing Spreadsheet management Database management systems,,,Practicals: There will be at least one 2 hour practical session every week.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM201",
    "Course": "Computer Science Education Method 1",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET band by,,,providing them with methodologies and understanding of the principles of information technology in the classroom.,,,Content: Aims and objectives; planning a whole topic; general lesson plans; approaches to teaching word processing,,,and spreadsheets; methodologies and techniques.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM211",
    "Course": "Objects Oriented Programming",
    "Description": "Aim: To provide students with the necessary content and skills to be able to develop programs for complex data,,,manipulation. Students should be able to use programming tools, program designing principles, as well as software,,engineering paradigms along with methods, classes, objects, strings, and user defined data structures. They must,,demonstrate an understanding of the use of local and global variables, parameters and arguments. In addition, students,,should demonstrate an understanding of the concept of an array and array manipulation including searching and sorting.,,The module develops cognitive and conceptual knowledge and practical techniques in students,,Content: Object Oriented Programming, Use of classes and objects Methods and parameter passing String,,manipulation and Character handling Introduction to Arrays, Sorting and searching,,Practicals: There will be one 2 hour practical every week.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM220",
    "Course": "Computer Science Education 220",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET phase.,,Content: Introduction to programming in a high level language and problem solving.,,Practicals: Thirteen,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM310",
    "Course": "Computer Science Education 310",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET phase.,,Content: Programming in a high level language; data structures; sorting and searching; character handling.,,Practicals: Thirteen,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM312",
    "Course": "Computer Science Education Method 2",
    "Description": "Aim: To provide students with the necessary content and skills to be able to develop appropriate lesson plans based on,,the CAPS curriculum for Computer Science in the FET level and to be able to use appropriate Computer Science,,Education methodologies when teaching programming and other aspects of Information technology, taking cognisance,,of the learner diversity, learner needs and the diverse teaching and learning context,,Content:The Curriculum and Assessment Policy for Information Technology at the FET phase of schoolingPractical,,Assessment Task – Phase I & IIApproaches to teaching programming taking cognisance of learner diversity, needs of,,the learner and the diverse teaching and learning contextLesson plans of specific topics in grade 10 and grade 11 for,,Information Technology within an inclusive education framework.,,Practicals: There will be at least one 2 hour practical every week.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM320",
    "Course": "Computer Science Education 320",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET phase.,,Content: Data Communication, system software and Boolean Algebra.,,Practicals: Thirteen,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM410",
    "Course": "Computer Science Education 410",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET phase and to,,provide an opportunity for students to widen their knowledge in various areas of Computer Science.,,Content: Programming in a high level language, recursion, graphics, links to databases, introduction to algorithmic,,complexity; selection of algorithms from sorting; searching, polymorphism and inheritance.,,Practicals: Thirteen.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM411",
    "Course": "Computer Science Education Method 3",
    "Description": "Aim: To provide students with well-rounded knowledge and skills to be able to function as an effective Information,,Technology teacher which will include planning and presenting appropriate lessons, designing theory and practical,,examination papers, as well as assessment of the practical assessment task within an inclusive education framework.,,Content: The Curriculum and Assessment Policy Statement for Information Technology Assessment of Practical,,Assessment Task in Information Technology – Phase Three Designing a theory paper Designing a practical paper,,Designing a marking memorandum for a theory and practical paper. Problem solving and Programming Paired,,Programming in the classroom Lesson plans of specific topics in grade 10 and grade 11 for Information Technology,,Practicals: There will be at least one 2 hour practical every week.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM603",
    "Course": "Computer Applications Technology 602",
    "Description": "Aim: This module is intended to develop pre-service teachers pedagogical content knowledge, skills and values related,to teaching and learning of Computer Applications Technology in the national school curriculum for the FET phase,(grades 10 to 12). To develop students knowledge and skills of assessment; and to conduct basic educational research,in current issues in in Computer Applications Technology in the FET phase To develop competent teachers of Computer,Applications Technology in the FET phase.,Content: The module aims at equipping the students with knowledge and skills inEducational research and examples,of educational research in Computer Applications Technology (CAT)Current and expected trends and issues in,Computer Applications TechnologyAssessment methods in Computer Applications TechnologyCAT as a subject,discourse in the national school curriculum and SA contextHandling of project work at school level,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCM611",
    "Course": "Information Technology Teaching 602",
    "Description": "Aim: This module is intended to develop pre-service teachers pedagogical content knowledge, skills and values related,to teaching and learning of Information Technology (IT) in the national school curriculum for the FET phase (grades 10,to 12). To develop students knowledge and skills of assessment; and to conduct basic educational research in current,issues in teaching Information Technology in the FET phase. To develop competent teachers of Information Technology,in the FET phase.,Content: The module aims at equipping the students with knowledge and skills in:Information Technology as a subject,discourse in the national school curriculum in a SA contextScience of teaching Information Technology (IT) in the FET,phaseAspects related to educational research in ITCurrent and expected trends and issues in ITAssessment,methods in ITProject work at school level in IT.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCS702",
    "Course": "Curriculum:Context and change",
    "Description": "Aim: To equip students with the knowledge and skills for reflecting critically on curriculum issues. It provides an,introduction to the nature of curriculum and Curriculum Studies, with particular reference to determinants of curriculum,policy and practice as well as online curriculum development, design and evaluation models in South Africa context and,other countries or contexts.,Content: This module focuses on theories of curriculum that are used in different teaching and learning contexts.,Students engage with curriculum documents with the aim of designing and evaluating curriculum tasks while dealing,with issues of diversity and promoting inclusivity to cater for the complex and differentiated nature of South African,community.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDCS704",
    "Course": "Curriculum as Practice",
    "Description": "Aim: Curriculum as Practice is designed to provide teachers and other educators with an overview of the field of,curriculum practice. The module explores various issues related to the nature of desirable curriculum practice, the impact,of the institutions on practice and curriculum decision-making.,Content: Teaching, learning and how people learn. Knowledge that teachers need to be effective in their classrooms,,schools and communities. The nature and process of curriculum decision-making by teachers, The impact of school and,classroom contexts on the quality of curriculum practice. Approaches that work best in empowering teachers.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDE110",
    "Course": "Education and Development 110",
    "Description": "Aim: Students will gain an understanding of global education and development issues.,Content: The current state of economic, political, cultural and environmental conditions in the world. Students will gain,an understanding of why the world is structured the way it is, concerns about this and how it links to education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDE210",
    "Course": "Education Development and Power",
    "Description": "Aim: To introduce students to debates around the education, development and power.,Content: Theories of power and how it is maintained; historical and current perspectives on reproductive education and,productive education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDE302 ",
    "Course": "Issues in Education and Development",
    "Description": "Aim: To develop students ability to critically analyse their context and role in it.,Content: Exploration of students context and role, ranging from specific experiences up to national and global contexts.,Context will include issues of class, race, culture, gender and politics. Identification of key issues facing education and,development from local to global levels.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDE304",
    "Course": "Rural Education and Development",
    "Description": "Aim: To develop an understanding of rural education in relation to development models.,Content: Socio-economic and political marginalisation of rural dwellers; exploration of initiatives such as Millenium,Development Goals and Education for All, Education for the Poor. Agricultural education and training, food security.,Literacy and adult education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDE702",
    "Course": "Advanced Theory in Education & Development",
    "Description": "Aim: This module teaches students how to read and work with theory in education and development in a detailed,,,,informed, nuanced, and critical manner. Students learn how theories work, they practice using different concepts, gain,,,insight into how concepts built into synthetic bigger structures that need to be engaged with holistically rather than using,,,piecemeal concepts.,,,Content: Key theories that are used in education and development and a comparison of older theories to more,,,contemporary theories, a comparison of conservative to radical theories, a comparison of western theories to ‘southern,,,and African theories and a critical contrast of different theories, with examples that develop a critical awareness.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR111",
    "Course": "Introduction to Drama Education",
    "Description": "Aim: The aim of this module is to provide students with fundamental content knowledge of Drama Education and specific,,,skills required in Drama that are necessary to enable progression into more complex and deeper engagement with the,,,theories and practices of Drama.,,,Content: Voice production and modulation, attributes of speech Speaking and performing for an audience though,,,individual and group items such as Public Speaking, Storytelling, story dramatization and dance. Elements of drama,,,,acting and movement such as structure, focus, tension and mood. Drama techniques and forms such as improvisation,,,and creative drama Staging conventions and stagecraft Elementary text analysis though critical reviews and,,,evaluation of peer performance,,,Practicals: The practical training requirements are that of voice modulation development and of developing human body,,,movement techniques and dramatic skills. ● The field trip requirement include a minimum of one visit to a professional,,,theatre production,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR201",
    "Course": "Drama Education Method 1",
    "Description": "Aim: To provide students with knowledge and experience in Drama-in-Education; to equip students with the knowledge,and skills necessary for the teaching of Drama in Senior and FET Phases.,Content: Child Drama, Drama as a learning medium - acquisition of knowledge through Drama; study of the acquisition,of language and social skills through Drama; Dram-n-Education techniques.,Practicals: 12,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR211",
    "Course": "Drama Education 3",
    "Description": "Aim: To provide students with in-depth content knowledge of the development of Western and other forms of Theatre,which will enable them to demonstrate a critical understanding of how and why theatre evolved in different societies from,ancient to modern times.,Content: The beginnings of Theatre and the role of ritual. Ancient Greek Theatre as the foundation of Western Theatre.,Selections from: Roman Theatre to Medieval Theatre Commedia dell ‘Arte to the Italian Renaissance Elizabethan,Theatre to Victorian Theatre Romanticism to Realism in the Theatre Selections from: Pan-African Theatre forms,Asian Theatre forms,Practicals: The field trip requirement is a minimum of one visit to a professional theatre production. The practical,requirements include those performance and theatre skills acquired through the Elements of Drama module.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR220",
    "Course": "Drama Education 220",
    "Description": "Aim: This unit will provide opportunities for development of social skills: teamwork, commitment and collaboration; the,development of critical thinking and interpretive skills, and skills in language and movement.,Content: Experimentation in various modes of dramatic expression, study of the language of movement, development,of public speaking strategies, thematic study of dramatic texts and study of the use of drama as an educational tool.,Practicals: Practicals: Speech and Movement, mini-production.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR310",
    "Course": "Drama Education 310",
    "Description": "Aim: This module will provide opportunities for: personal development in use of speech and movement for effective,communication, teamwork strategies, an overview of Theatre History and the technical aspects of play production.,Content: The study of four aspects of Drama: Exercise, Dramatic Play, Theatre and Drama for education, Theatre,History and Play Production.,Practicals: Practicals: Dissertation, Programme or Dance production.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR312",
    "Course": "Drama Education 4",
    "Description": "Aim: To provide students with in-depth content knowledge of the history of South African Theatre which will enable them,to demonstrate a clear and a critical understanding of the development of South African Theatre, including an,understanding of the new trends (post-1994) in South African Theatre.,Content: ● The African rituals and oral traditional performances of South Africa ● Township theatre, township Musicals,and Gibson Kentas performance style ● Missionary and other influences on the development of drama ● Theatre of,Resistance and Black Consciousness cultural movement ● Protest Theatre, Poor theatre and theatre post-1994,Practicals: The field trip requirement is a minimum of one visit to a professional theatre production. The practical,requirements include those performance and theatre skills acquired through the Elements of Drama module.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR320",
    "Course": "Drama Education 320",
    "Description": "Aim: This unit will provide students with scope to develop critical thinking, aesthetic appreciation and skills in dramatic,interpretation, as well as the gaining of knowledge of play production in schools.,Content: Study and interpretation of Shakespearian texts, an overview of African Theatre, experimental dramatic work,with young people and the appreciation of Drama as a tool for personal development.,Practicals: Practicals: Play production, dialogue. Drama Education 320, (continued).,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR411",
    "Course": "Drama Education Method 3",
    "Description": "Aim: To develop students well-rounded understanding and knowledge of the main principles, practices and practitioners,of Drama pedagogy as preparation for the teaching of Drama at FET level within the CAPS curriculum framework.,Content: Dramatic Arts curriculum/ policy related to Drama Education for FET phase within the CAPS curriculum,Teaching methodologies for enabling learner centred learning Setting up school theatre Problem solving strategies in,Drama Education Assessment in Drama Education,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR420",
    "Course": "Drama Education 420",
    "Description": "Aim: To build specialist knowledge and skills in the appreciation and the teaching of Drama. To gain skills in,management and production, to develop research skills and gain further insights into the work of modern dramatists.,Content: The study of selected modern dramatists and the development of style in play-making, the study of excellent,presentation skills, and a research assignment on theatres, local, school or other.,Practicals: Practicals: Presentation, dramatic production.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDDR602",
    "Course": "Dramatic Arts Teaching 602",
    "Description": "Aim: The main aim of this module is to develop student teachers understanding and knowledge of the main principles,,practices and practitioners of Drama pedagogy as preparation for the teaching of Dramatic Arts for FET in grades 10 –,12 in diverse schooling contexts. To develop competence in teaching Dramatic Arts in the FET phase.,Content:Dramatic Arts Education and Theatre In EducationThe role of Dramatic Arts in the FET phaseDramatic,Arts curriculum and assessment policy in line with the National Curriculum DocumentsTheories of teaching and learning,in the context of Dramatic Arts teachingStrategies for teaching Dramatic Arts theory and practicalsDeveloping learning,programmes in Dramatic ArtsDesigning and presenting lessons in Dramatic ArtsAssessment of Dramatic ArtsSkillsto create school theatreIndependent research on current issues in Dramatic Arts EducationCampus-based teaching,peer observation and reflection in the context of Dramatic Arts teaching.Practicals: A participation in projects of Theatre In Education."
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN110",
    "Course": "English Communication 110",
    "Description": "Aim: To provide students with opportunities for improving their command of both written and oral English; developing,critical thinking; and, insights into the complexities of language usage.,Content: Creative writing and the study of selected novel, poetry and film. Creating texts; interacting with and responding,to a range of texts; language as a social construct; stylistic devices; practical and relevant language usage.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN112",
    "Course": "Eng Ed: Introductory concepts (HL)",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by: Providing insights to the South African education landscape Exploring the roles and,functions of a teacher of English Understanding and interpreting the various documents related to becoming a teacher Understanding and interpreting the curriculum documents required to teach English Understanding how to plan and,prepare lessons for the English classroom taking cognisance of learner needs, diversity of learners and the diverse,teaching and learning context Developing insight into first and second language acquisition theories and theirimplications for the English classroomContent: The module introduces concepts and constructs associated with becoming a teacher of English with specialemphasis on working in and responding to the South African landscape, Interrogates documents, and engages withlesson planning and preparation. It includes development of lesson plans, developing and integrating the use of teachingand learning resources, including ICT and teaching of lesson. The module also focuses on both first and secondlanguage acquisition. The content topics are: Teaching of English: Understanding and responding to the South Africanlandscape Becoming a teacher of English within an inclusive education framework Interrogating documents: NationalEducation Teacher Framework – for the teacher of English Interrogating curriculum documents Lesson planning andpreparation commensurate with the needs of learners, the learner diversity and the diverse teaching and learning contex Language acquisition (first and second language)"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN114",
    "Course": "Introduction to Theory & Practice",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching English by: Providing opportunities,for improving command (both written and oral) of the English language Introducing literary and critical theories,Developing critical thinking, aesthetic appreciation and insight into selected South African works of literature,Encouraging critical discourse Proposing various practices of teaching literary texts,Content: This modules uses various literary theories to study South African poetry, short stories, dramas and novels.,The content topics are: Using literary theories to study SA poetry Using literary theories to study SA short stories,Using literary theories to study SA contemporary drama / Teaching drama Using literary theories to study a SA novel,Grammar: Borrowed and inherited words; Synonyms, antonyms, homonyms, homophones; Idiomatic expressions;,Proverbs,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN210",
    "Course": "English Major 210",
    "Description": "Prerequisite Requirement: English Communication 110, English Language Course or Academic Literacy in Education.,Aim: To prepare students for the challenges of teaching by providing an overview of applied linguistics, insights into,narrative studies and various literary texts and by developing critical thinking and aesthetic appreciation.,Content: Literary texts; introduction to applied linguistics; introduction to narrative studies.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN212",
    "Course": "Eng Ed Meth 1 for SP: Introductory Concepts",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by: Providing insights to the South African education landscape Exploring the roles and,functions of a teacher of English at the Senior phase Understanding and interpreting the various documents related to,becoming a teacher at the Senior phase Understanding and interpreting the curriculum documents required to teach,English at Senior phase Understanding how to plan and prepare lessons for the Senior Phase English classroom taking,cognisance of learner needs, diversity of learners and the diverse teaching and learning context Developing insight into,first and second language acquisition theories and their implications for the Senior Phase English classroom,Content: The module introduces concepts and constructs associated with becoming a teacher of English with special,emphasis on working in and responding to the South African landscape, Interrogates documents, and engages with,lesson planning and preparation. It includes development of lesson plans, developing and integrating the use of teaching,and learning resources, including ICT and teaching of lesson. The module also focuses on both first and second,language acquisition. The content topics are:Teaching of English: Understanding and responding to the South African,landscapeBecoming a teacher of English in the Senior phase within an inclusive education frameworkInterrogating,documents: National Education Teacher Framework – for the teacher of English at the Senior phaseInterrogating,curriculum documents to teach English at the Senior phaseLesson planning and preparation for the Senior Phase,English classroom commensurate with the needs of learners, the learner diversity and the diverse teaching and learning,contextLanguage acquisition (first and second language) and implications for the Senior Phase classroom,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN214",
    "Course": "Eng Ed Meth 1 for IP: Intro Concepts HL",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by:Providing insights to the South African education landscapeExploring the roles and,functions of a teacher of HL English at the Intermediate phaseUnderstanding and interpreting the various documents,related to becoming a HL teacher at the Intermediate phaseUnderstanding and interpreting the curriculum documents,required to teach HL English at Intermediate phaseUnderstanding how to plan and prepare lessons for the Intermediate,phase HL English classroom taking cognisance of learner needs, diversity of learners and the diverse teaching and,learning contextDeveloping insight into first and second language acquisition theories and their implications for the HL,English classroom.,Content: The module introduces concepts and constructs associated with becoming a teacher of HL English with special,emphasis on working in and responding to the South African landscape, Interrogates documents, and engages with,lesson planning and preparation. It includes development of lesson plans, developing and integrating the use of teaching,and learning resources, including ICT and teaching of lesson. The module also focuses on both first and second,language acquisition. The content topics are:Teaching of English: Understanding and responding to the South African,landscapeBecoming a teacher of HL English in the Intermediate phase within an inclusive education frameworkInterrogating documents: National Education Teacher Framework – for the teacher of HL English at the Intermediate,phaseInterrogating curriculum documents to teach HL English at the Intermediate phaseLesson planning and,preparation for the Intermediate HL English classroom commensurate with the needs of learners, the learner diversity,and the diverse teaching and learning contextLanguage acquisition (first and second language) and implications for,the Intermediate Phase HL English classroom.,Practicals: Nil,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN220",
    "Course": "English Major 220",
    "Description": "Aim: To prepare students for the challenges of teaching by developing critical thinking, aesthetic appreciation and insight,into a variety of works of English literature.,Content: Introduction to poetry; Shakespearean drama. film study; and the novel.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN310",
    "Course": "English Major 310",
    "Description": "Aim: To develop critical thinking, aesthetic appreciation and insight into literature; awareness and perspective on various,approaches to literary analysis; and to introduce popular and adolescent literature and the teaching of texts.,Content: Literary texts; introduction to literary and critical theory; popular and adolescent literature and the teaching of,text.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN312",
    "Course": "Eng Ed Method 2 for FET Literacies",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by: Exploring the theoretical assumptions underlying the teaching, learning and,assessment of listening, speaking, reading and writing skills in the FET English classroom Demonstrating an,understanding of appropriate selection, sequencing and pacing of the skills involved in listening, speaking, reading and,writing in the FET English classroom Exploring the theoretical assumptions underlying the teaching, learning and,assessment of critical literacy, visual literacy and media literacy in the FET English classroom Reflecting on and,assessing various classroom practices of teaching critical literacy, visual literacy and media literacy in the FET English,classroom Developing insight into the theories and practices associated with multilingualism and multiliteracies and,their impact on the FET English classroom,Content: The module will focus on literacies in the English classroom including listening, speaking, reading and writing,skills; Critical literacy, Visual literacy; Media literacy; Multiliteracies and Multilingualism. The content topics are:,Listening and speaking skills for the FET phase Reading and writing skills for the FET phase Critical literacy for the,FET phase Viewing skills/ Visual literacy/ Media literacy for the FET phase Multilingualism/ multiliteracies in the,classroom and implications for the FET English classroom,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN314",
    "Course": "Eng Ed Method 2 for IP Literacies FAL",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by: Exploring the theoretical assumptions underlying the teaching, learning and,assessment of listening, speaking, reading and writing skills in the Intermediate Phase English FAL classroom,Demonstrating an understanding of appropriate selection, sequencing and pacing of the skills involved in listening,,speaking, reading and writing in the Intermediate Phase English FAL classroom Exploring the theoretical assumptions,underlying the teaching, learning and assessment of critical literacy, visual literacy and media literacy in the Intermediate,Phase English FAL classroom Reflecting on and assessing various classroom practices of teaching critical literacy,,visual literacy and media literacy in the Intermediate Phase English FAL classroom Developing insight into the theories,and practices associated with multilingualism and multiliteracies and their impact on the Intermediate Phase English FAL,classroom,Content: The module will focus on literacies in the English classroom including listening, speaking, reading and writingskills; Critical literacy, Visual literacy; Media literacy; Multiliteracies and Multilingualism. The content topics are:Listening and speaking skills for the Intermediate Phase English FAL classroom Reading and writing skills for theIntermediate Phase English FAL classroom Critical literacy for the Intermediate Phase English FAL classroom Viewingskills/ Visual literacy/ Media literacy for the Intermediate Phase English FAL classroom Multilingualism/ multiliteraciesin the classroom and implications for the Intermediate Phase English FAL classroom"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN316",
    "Course": "Eng Ed4 Theory and Practice using Period Lit",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by: Providing opportunities for improving command (both written and oral) of the English,language Developing critical thinking and insight into, and aesthetic appreciation of selected works of period literature Providing insights into critical and literary theory Exploring issues of gender, sexuality, religion, race and class in,period literature,Content: The module will engage with a variety of literary theories to study period poetry and period novels as well as,Shakespearean tragedies and Shakespearean comedies. It will also consider approaches to teaching Shakespeare. The,content topics are: Using literary theories to study period poetry Using literary theories to study a Shakespearean,tragedy/ Teaching Shakespeare Using literary theories to study a Shakespearean comedy Using literary theories to,study a period novel,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN319",
    "Course": "SASL Communication Intermediate Phase",
    "Description": "Aim: The aims of the module are to provide students with the opportunity to understand the history of the Deaf and,acquire knowledge of Deaf culture to allow them to respond in a Deaf community. Develop an understanding of the,concept of South African Sign Language and prepare student teachers to meet the challenges of conversing in SASL as,a medium of communication and providing opportunities for improving command (signing) of the SASL language;,Content: The content will include history of the Deaf in South Africa, deaf culture, what is SASL, vocabulary – commonly,used for conversation, Linguistics structure and conventions, Greetings and syntax used is SASL. Students are required,to use special features for communication different from those in all other spoken languages in South Africa. The,distinguishing feature of signed languages is that they are communicated through the medium of space, not sound, and,that they use hands, face, head and upper torso for their realisation.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN401",
    "Course": "English Major Method 3",
    "Description": "Aim: To prepare students to be competent teachers of English.,Content: Assumptions underlying the teaching of writing and language; classroom practices of teaching writing and,language for specific purposes; Teaching of writing; teaching of language skills; teaching of grammar; selection,,sequencing and pacing for the teaching of writing and language skills, assessment of writing and language skills for,specific purposes; the teaching of grammar.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN411",
    "Course": "English Method 3 for FET",
    "Description": "Aim: This module will prepare student teachers to meet the challenges of teaching and developing their own knowledge,and understanding of English by: Exploring language learning theories and approaches relevant to South African FET,English classrooms Demonstrating an understanding of appropriate selection, sequencing and pacing of teaching,grammatical structures and use in the FET English classroom Applying the principles involved in teaching language,structures and use to achieve language outcomes in the FET English classroom Reflecting on and assessing various,theories and classroom practices of teaching critical language awareness in the FET English classroom Demonstrating,an understanding of the language policy related to South African schools,Content: The module focusses on language awareness, including language structures and use and critical language,awareness; Language learning approaches relevant to South Africa (SA) and beyond; and Language policy with special,emphasis on South African schools. The content topics are: Language Learning approaches – relevance to South,African FET English classrooms Language/ Grammatical structures and use in the FET English classroom Critical,language awareness in the FET English classroom Language policy for South African schools,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN420",
    "Course": "English Major 420",
    "Description": "Aim: To develop critical thinking, aesthetic appreciation and insight into literature; insights into mass media; and,,research skills.,Content: Study of various literary texts; media study; research project.,Practicals: 12,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN608",
    "Course": "English Home Language Teaching 602",
    "Description": "Aim: This module will prepare student teachers to critically engage with pedagogical knowledge, skills and values related,to the teaching and learning of English Home Language, to develop their own knowledge and understanding of English,and to meet the challenges in the English Home Language Classroom by:Proposing various approaches, strategies,,and techniques of teaching English Home Language literary textsExploring theoretical assumptions underlying the,teaching, learning and assessment of critical language awareness, critical literacy, visual literacy and media literacy and,reflecting on and assessing various classroom practices of teaching these literacies in an English Home Language,classroomExploring first language learning theories and approaches relevant to Home Language classroomsDemonstrating an understanding of appropriate selection, sequencing, and pacing of teaching grammatical structures,and use, andApplying the principles involved in teaching language structures and use to achieve English Home,Language outcomesExploring assessment practices related to the teaching of English as a Home Language in the FET,Teaching phasesExploring basic research skills to enable teachers to serve as researchers.,Content: The module focuses on the theories and practices used to teach literary texts, critical language awareness,,language structures in teaching English Home Language. It also focuses on assessment practices and basic research,skills. The content topics are:Teaching literary textsCritical literacy/Critical language awarenessViewing skills/Visual,literacy/Media literacyLanguage/Grammatical structures and useAssessmentResearch skillsCampus-based micro-,teaching and peer observation,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDEN612",
    "Course": "English 1st Additional Language Teaching 602",
    "Description": "Aim: This module will prepare student teachers to critically engage with pedagogical knowledge, skills and values related,to the teaching and learning of English First Additional Language, to develop their own knowledge and understanding of,English and to meet the challenges of teaching English as First Additional Language by:Proposing various approaches,,strategies, and techniques for teaching literary texts in the English First Additional Language classroomExploring the,theoretical assumptions underlying the teaching, learning and assessment of critical language awareness, critical,literacy, visual literacy and media literacy and reflecting on and assessing various classroom practices of teaching these,literaciesExploring language learning theories and approaches relevant to First Additional Language classroomsDemonstrating an understanding of appropriate selection, sequencing and pacing of teaching grammatical structures,and use, and applying the principles involved in teaching language structures and use to achieve English First Additional,Language outcomesExploring assessment practices related to the teaching of English as a First Additional Language,in the FET as well as exploring basic research skills to enable teachers to serve as researchers,Content: The module focuses on the theories and practices used to teach literary texts in English First Additional,Language, critical language awareness and language structures. It also focuses on assessment practices in English as,First Additional Language and basic research skills. The content topics are:Teaching literary texts in English First,Additional LanguageCritical literacy/Critical language awarenessViewing skills/Visual literacy/Media literacyLanguage/Grammatical structures and useAssessment of English First Additional LanguageResearch skillsCampus-based micro-teaching and peer observation,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES110",
    "Course": "Professional Studies 110",
    "Description": "Aim: Provide basic foundational knowledge and practical skills to ensure successful teaching and learning during the,first school practice experience. Design, produce and use resources for specific teaching purposes. Develop basic,strategies for effective classroom management and control. To practice presentation skills and build self-confidence in,a micro-teaching environment.,Content: Introduction to curriculum studies. Outcomes-based education in the classroom. Learner-centred approaches,to teaching and learning. Planning and presentations of learning experiences. Introduction to classroom organisation,,management and control. Design, construct and use various resources for teaching (audio-visual and low-cost).,Reflective practice.,Practicals: 16,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES113",
    "Course": "An Introduction into the Study of Education",
    "Description": "Aim: The aim of the module is to introduce students to the field of Education Studies as a discipline and to locate the,present South African school education systems within a genesis of school education reforms nationally and globally,over periods of note.,Content: Academic literacy development Introduction into Curriculum Studies Introduction into Psychology as a lens,for teaching and learning A basic introduction into Philosophy and Sociology of Education History of South African,education International trends in educational historiography The current South African school education system,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES130",
    "Course": "Teaching Learning and Classroom Practices",
    "Description": "Aim:To develop students knowledge and understanding of the different worldviews, theories and principles of teaching,and learningTo foster thinking about own experiences (as learners in schools, as students at UKZN, as practitioners-to-be) in relation to broader understandings & perspectives of teaching and learningContent:Developing academic literacyHow is learning and teaching understood by students, parents, psychologists,DOE officials, business, sociologists, historians, politicians, philosopherslearner & teacher identitiesWhat are teachersexpected to do?What are learners roles in school?Teaching and learning theories and approachesDesigning lessonsfor teachingDesigning and integrating teaching and learning resources in teachingClassroom management &leadershipSA schools teaching contexts"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES210",
    "Course": "Professional Studies 210",
    "Description": "Aim: To investigate and critically reflect on specific classroom related issues from the students first practice teaching,experience. Extension of students knowledge and practical experience with regard to participative approaches and,techniques that would lead to learner self-directedness.,Content: Reflective practice and personal development techniques for educators and learners. Dimensions of teacher,efficacy. Theory and practical application of advanced approaches to teaching and learning. Planning and designing of,learning programmes for a specific phase/level/learning area and/or subject: progression and differentiation.,Practicals: 4,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES213",
    "Course": "Education Studies 210",
    "Description": "Aim: A Foundational Academic Studies module which serves to provide students with an understanding of how modern,education systems have evolved, in respect of the world in general, and of Africa and South Africa in particular. There isa strong focus on placing developments into their political, historical and economic contexts.Content:Pre-modern/non-western Educatio Modern society and education with special reference to Africa and SouthAfrica Post-modern/globalised society and education."
  },
  {
    "Institution": "UKZN",
    "Code": "EDES221",
    "Course": "Professional Studies 220",
    "Description": "Aim: This module aims to develop an understanding of the deliberate processes that combine to give direction within,educational contexts. The module introduces students to the legal aspects of South African education, educational,leadership and management at classroom and school levels, and to managing learning. The module offers the,opportunity for: exploration and analysis of official policy documents and other factors that influence school and,classroom practices; designing strategies, activities, programmes and policies that facilitate positive learning contexts,and learner independence; mediation and management of conflict and discipline within and outside the classroom; a,critical examination of effective school and classroom management, and for an understanding, critical examination and,application of the legal aspects of South African education,Content: 1. Legal aspects of the South African Education 2. Managing Learning: Introduction3. Section 1: Creating a,positive learning environment 4. Section 2: Lesson Management Skills 5. Section 3: Discipline 6. Section 4: Inclusivity,and Diversity 7. ICT Integration in the classroom,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES301",
    "Course": "Creative Arts in ECD",
    "Description": "Aim: In this module students will critically analyse the concepts of creativity and aesthetics as it applies to the ECDcontext. Cognitive, affective and imaginative aspects will be explored as it applies to ECD. Cognitive, affective andimaginative aspects will be explored through art, drama, movement and music. The latter will be examined by analysingoutcomes in the integrated curriculum for preschool and the arts and culture learning area for the foundation phase.Content: The concept of creativity; the concept of aesthetics; promoting creativity and aesthetics in ECD; the earlychildhood art programme; dramatic play and puppetry in ECD; creative movement; music and learning in ECD.Practicals: Four"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES311",
    "Course": "Education Studies 4",
    "Description": "Aim: To develop in students a sound theoretical and conceptual knowledge base of Psychology with a view to facilitating,,critical engagement with psychology of education, specifically the application of psychological principles in teaching and,,learning.,,Content: Developing academic literacy A general introduction into the discipline of Psychology. Schools of thought,,in Psychology; Biological bases of behaviour, cognition and memory The human brain and learning Child,,development and learning theories Psychological framework for understanding of issues in education, teaching and,,learning. Inclusive Education and White Paper 6 informing South African schooling system Identifying, understanding,,and responding to barriers to learning,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES401",
    "Course": "Curriculum Development in ECD",
    "Description": "Aim: In this module students will examine historical and contemporary perspectives of curriculum in early childhood,,education. They will investigate the dominant models used in the South African context and its impact on outcomes-,,based education as an entitlement curriculum in the Foundation Phase.,,Content: Historical Models in the early years. The influence of child development on the curriculum in the early years.,,,,Contemporary models and its impact on early childhood education in South Africa. Outcomes-based education and theearly years curriculum. Developing an early years curriculum (0-5 years).Practicals: 18"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES411",
    "Course": "Education Studies 6",
    "Description": "Aim: To introduce students to a theoretical, conceptual and methodological frameworks to facilitate critical engagement,with philosophy and sociology of education, specifically the application of philosophical and sociological theories in,teaching and learning.,Content: Academic literacy development Thinking philosophically and sociologically about education Aims and,conceptions of education Ethics and values in education Knowledge and education African philosophy and sociology,of education Key concepts/ definitions in sociology of education Theories in sociology of education Diversity and,Culture in Education Citizenship, human rights, school governance Role of the school in society and ecology of the,school,Practicals: None,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDES420",
    "Course": "Education Studies 420",
    "Description": "Aim: To familiarise students with issues pertaining to professionalism and get students to engage with policy issues and,in literature- and school-based research.,Content: Professional Issues; Human rights, Ethics, SACE code of conduct, Legal aspects, SACE, teacher associationsand unions; Aspects of educational management, Education and the school in relation to the community. Research inEducation Policy and Practice Review of the development of education policy, Research methods."
  },
  {
    "Institution": "UKZN",
    "Code": "EDES612",
    "Course": "Education Studies: Teach Learn and Contexts",
    "Description": "Aim: Develop students foundational knowledge and conceptual understanding of broad issues in education and,schooling at a systemic, school and classroom level.Develop students ability to critically engage in a variety of relevant,educational topics in relation to historical, sociological and psychological perspectives,Content:The current state of education in South AfricaHistorical perspectives on the current state of educationSociological perspectives on inequality in educationTheories of teacher learning and developmentClassroom,ManagementTeachers identity, teachers work and professionalismThe critical, reflective practitioner and research.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGE701",
    "Course": "Gender and Education",
    "Description": "Aim: This module introduces students to feminism, its origins, politics and key features. It examines the concept of,gender. It explores how gender operates in education (particularly in school settings), both within the hidden and overt,curriculum and aims to get students to reflect on their own practices and institutional locations.,Content: Students will engage with theories of gender in relation to the curriculum, become familiar with South African,policies and guidelines on gender and schooling, critically consider gendered practices in school that lead to bullying,and violence and understand the connections between gender, sexuality and HIV.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGE703",
    "Course": "Gender Regimes and Justice",
    "Description": "Aim: This module introduces students to Gender Inequality and the pursuit of Gender Justice. It explores how gender,inequalities operate on a global scale and in education (particularly in school settings). Approaches to gender justice,which encourages students to reflect on their own practices and how they are able to integrate theory with their practices,in school.,Content: Students will engage with theories of gender regimes and justice in relation to schooling practices. Students,need to reflect on their own gendered practices that lead to gender injustices and understand the connections between,patriarchy, gender norms, stereotypes and the perpetuation of gender inequality.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGG201",
    "Course": "Geography for Educators Method 1",
    "Description": "Aim: To provide students with a broad understanding of the role of geography education and its associated challenges,in a global context. It also aims to introduce students to the nature and philosophy of geography education, the value of,appropriate resources, the use of assessments and the implementation of the latest curriculum and assessment policy,in SA.,Content: The nature and philosophy of geography education, the role of geography education, challenges in a global,context, appropriate resources, new CAPS document.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGG220",
    "Course": "Geography for Educators 220",
    "Description": "Aim: To expose students to a critical understanding of the spatial and historical processes that have led to the,emergence of urban settlements around the world.,Content: A study of the historical growth, function, location and diversity of urban settlements, this to include an analysis,of problems facing cities in particularly developing countries.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGG310",
    "Course": "Geography for Educators 310",
    "Description": "Aim: To equip students with a critical understanding of the nature of relationships between man and the environment,with respect to vulnerability, risks and hazards that occur. To enable students to think, devise and discuss mitigation,strategies in an attempt to minimise risk in different geographical settings.,Content: A study of cultural, chemical, physical and biological hazards and risk analysis and management in more and,less developed countries.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGG401",
    "Course": "Geography for Educators Method 3",
    "Description": "Aim: To equip students with the content knowledge and teaching strategies for teaching Geographic Information,Systems and mapwork.,Content: GIS concepts and teaching strategies, mapwork concepts and skills.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGG420",
    "Course": "Geography for Educators 420",
    "Description": "Aim: To introduce students to research skills, concepts and values, and to enable the students to apply them to a freely,chosen topic pertaining to Geographical education.,Content: A study of various research methods and techniques, leading to a dissertation.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGG602",
    "Course": "Geography Teaching 602",
    "Description": "Aim: To prepare Geography educators to teach key issues and trends, and to thereby become skilled practitioners,,through diverse technologies. To develop understanding of key Geographical issues and trends, focusing on the FET,,phase. This module will enable trainee Geography educators to develop sound skills, pedagogical knowledge, skills and,,values bases for teaching Geography. To develop competence in teaching Geography in the FETphase (grades 10 to,,12).,,Content: E-teaching for Geography educationGeography education and controversial issuesDevelopment trends,,and debatesEducation for Climate ChangeField work and excursions in Geography educationAssessments and,,recording methods in Geography educationChallenges facing the teaching of Geography education in the 21st century,Campus-based practical learning (lesson and DVD analysis).,,Practicals: No fieldwork required Campus-based practicals (e-teaching, Climate Change Education) in the Morton,,Laboratory,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDGO114",
    "Course": "Development Studies",
    "Description": "Aim: The main aim of this module is to prepare Social Sciences student teachers in the intermediate and senior phases,,as part of their initial teaching qualification, to become competent in engaging with the development studies demands ofthe Social Sciences curriculum document and related assessment criteria, and to translate this into effective teachingand learning opportunities. The student teachers would furthermore be assisted in developing programmes based ontheir individual teaching styles and philosophies.Content: The core content topics for the module are: Development paradigms Globalisation, migration and settlemen Factors and challenges affecting development, migration and settlement Opportunities for development Spatialdevelopment of South Africa, Africa and the World- historic and current Development across scales: town, city, region,national, international Resource use: renewable and non-renewable Sustainable use of resources (sustainabledevelopment) Demography and development Conservation and development Food resources and developmentWater resources and development Current development issues and reports, for example the HDR.Practicals: Practicals, an hour and a half long, will be offered. If circumstances permit (number in class, health andsafety requirements), a field trip may be offered (this is not definite though)."
  },
  {
    "Institution": "UKZN",
    "Code": "EDGO214",
    "Course": "Geography Education 4",
    "Description": "Aim: The main aim of this module is to prepare Social Science student teachers in the intermediate and senior phases,to, as part of their initial teaching qualification, to become competent in mapwork and GIS content. To achieve this they,would be guided towards professional competence informed by a sound knowledge, skills and values base.,Content: The core content topics for the module are: Mapwork: purpose and types of maps, symbols and projections Mapwork Skills GIS: components GIS: uses and advantages of GIS GIS: data acquisition, data manipulation, data,analysis GIS software and application.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHE631",
    "Course": "Teaching and Learning in Higher Education",
    "Description": "Aim: To enhance and theorise diverse practices in teaching and learning.,Content: Theories of learning, teaching and learning in the African context, and the practical implementation of diverse,practices to enhance teaching and facilitate students learning. Taking cognisance of the pedagogical needs of diverse,disciplines, large and small group strategies, individual and collaborative methods, contact and mixed methods, class-,based and off-campus learning are included. The module includes teaching and learning in the context of research,supervision.,"
  },
  {
    "Institution": "UKZN",
    "Code": "Aim: To enable higher education practitioners to develop a theoretical historical and projective perspective on the",
    "Course": "EDHE854",
    "Description": "purposes, roles and functions of student services in African higher education. It will equip participants with the skills to,bring into effect appropriate research-led programmes and services in this sector of higher education.,Content: The module will cover the development, purposes, functions and roles across the range of Student Affairs,activities and the theories that inform these. It will also critically examine research, policy issues and professional,development related to the area.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHE856",
    "Course": "Diversity in Higher Education",
    "Description": "Aim: To enable higher education practitioners to develop a critical understanding of the role of diversity in contemporary,higher education endeavours, as well as develop an appreciation for the scholarship of diversity in higher education.,Participants will be challenged to reflect on their own and others conceptions of diversity, how these conceptionsinfluence processes in higher education, how these processes may be researched, and how a proactively diverse highereducation environment can enhance the functioning and profile of higher education institutions."
  },
  {
    "Institution": "UKZN",
    "Code": "EDHE858",
    "Course": "Professional Services in Higher Education",
    "Description": "Aim: To enable higher education practitioners to align and integrate workplace professional and administrative service,,,,activities with the key functions of higher education. Participants will develop an understanding of the role of,,,,administration in higher education, and how this contributes to the successful attainment of higher education objectives,,,,and goals.,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS111",
    "Course": "Themes from South African History",
    "Description": "Aim: The main aim of this module is for History student teachers in the intermediate and senior and FET phases to,,,,critically engage with historical knowledge related to South African History from pre-history to the present. At the end of,,,,the module students should have gained well rounded broad education that equips the graduate with the knowledge,,,,base, theory and methodology of the discipline to enable them to demonstrate initiative and responsibility in an academic,,,,and professional context. Ultimately the module should empower History student teachers to teach to themes from South,,,,African History with confidence.,,,,Content: The core content topics for the module are: Pre-colonial South Africa African societies of South Africa,,,,Migration as a factor in South African History Colonisation, Conquest and Settlement From an agrarian to an industrial,,,,society Union and Disunion From a White to an African state,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS113",
    "Course": "History Philosophy Theory and Method",
    "Description": "Aim: The main aim of this module is for History student teachers in the intermediate and senior and FET phases to,,critically engage with philosophies, theories and methods related to the subject. Ultimately the module should empower,,History student teachers in understanding the nature of the subject and serve to instruct them in researching and writing,,history. At the end of the module students should have developed basic introductory subject knowledge, cognitive and,,conceptual tools, practical techniques and the ability to employ general principles of the discipline with more specific,,procedures for application.,,Content: The core content topics for the module are: What is history? The values and uses of history/Why study,,history Historiography and historical thinking Historical evidence and sources Researching history Writing history, Key issues in writing history such as fact, truth, interpretation, objectivity, gender, race, class,,Practicals: Students must visit an archival repository in their own time.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS210",
    "Course": "History for Educators 210",
    "Description": "Aim: To empower prospective History educators, as part of there initial teaching qualification, with sound historical,,knowledge on the nature, philosophy and importance of the subject. This module would furthermore serve to instruct the,,students in how and by whom History is written, the factors that influence the writing process as well as the sources used,,by Historians.,,Content: What is History?; Why study History?; What does the Historian do?; Trends in Historiography; Prominent,,Historical thinkers; Re-writing History; Historys relationship with other disciplines; History and objectivity; Gender, Class,,and Race in History; Writing History; Historical sources – location, authenticity, reliability.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS215",
    "Course": "History Education Method 1",
    "Description": "Aim: The main aim of this module is to prepare History student teachers to teach History in the Further Education and,,Training Phase of schooling, as part of their initial teaching qualification. At the end of the module the students should,,have developed a sound knowledge base and sound understanding of theoretical principles of history teaching and be,,able to apply this specific knowledge in their teaching of History at the FET phase of schooling , taking cognisance of,,the needs of the learners, the diversity of learners and the diverse nature of the teaching and learning contexts. To,,achieve this they would be guided towards professional competence informed by a sound knowledge, skills and values,,base. The student teachers would furthermore be assisted in developing and presenting programmes based on their,,individual teaching styles and philosophies.,,Content: The core content topics for the module are: The nature of school History Profiling the History teacher – the,,identities, roles, duties and work of a History teacher Profiling the history learner – the identities of a History learner,,The philosophies, theories and methods underpinning History teaching and learning within an inclusive education,,framework The CAPS History curriculum for the FET phase of school in South Africa Selecting and integrating,,sources/evidence to teach history (for example documents, artefacts, visual media, ICT) Planning history lessons for,,diverse learner population and diverse teaching and learning sites,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS301",
    "Course": "History for Educators Method 2",
    "Description": "Aim: To prepare prospective History educators, as part of there initial teaching qualification, to become competent in,,the teaching methods of History.,,Content: Using sources to teach History: secondary sources; feature films and History; Oral History; Historical fieldwork;,History in Education and IT; the three basic History skills: Time, Cause and Effect, Empathy; Local History; the,interdisciplinary nature of History: Archaeology and Genealogy.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS311",
    "Course": "History Education Method 2",
    "Description": "Aim: To prepare History student teachers to teach History in the Further Education and Training Phase of schooling, as,part of their initial teaching qualification. At the end of the module students should have gained well rounded broad,education that equips the graduate with the knowledge base, theory and methodology of the discipline to enable them,to demonstrate initiative and responsibility in an academic and professional context, taking into consideration the needs,of the learners, the diversity of learners and the diverse teaching and learning contexts. The student teachers would,furthermore be assisted in developing and preserve programmes based on their individual teaching styles and,philosophies.,Content: The core content topics for the module are: Teaching controversial and sensitive issues for the FET phase,of school History in South Africa Games and simulations in the FET phase History classroom in South Africa Teaching,contemporary History for the FET phase of school in South Africa Identifying barriers to learning History at the FET,phase of schooling Teaching school History to large classes in a disadvantaged school within an inclusive education,framework Assessment in History for the FET phase of school in South Africa Identity and heritage in a multicultural,society for the FET phase of school in South Africa Developing a personal History teaching philosophy Identifying,barriers to learning History at the FET phase of schooling,Practicals: Practical teaching exercises,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS313",
    "Course": "History Education 4 Themes from SA History",
    "Description": "Aim: This module is for History student teachers in the intermediate and senior and FET phases to critically engage with,historical knowledge related to South African History from pre-history to the present. At the end of the module students,should have gained well rounded broad education that equips the graduate with the knowledge base, theory and,methodology of the discipline to enable them to demonstrate initiative and responsibility in an academic and professional,,context. Ultimately the module should empower History student teachers to teach to themes from South African History,with confidence.,Content: The core content topics for the module are: Pre-colonial South Africa African societies of South Africa,Migration as a factor in South African History Colonisation, Conquest and Settlement From an agrarian to an industrial,society Union and Disunion From a White to an African state,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS401",
    "Course": "History for Educators Method 3",
    "Description": "Aim: To prepare students to become competent in the teaching methods of History.,,Content: Evaluation in History; teaching controversial issues in History; museums and the teaching of History;,,contemporary History; games and Simulations in History education; projects and assignments in History; functioning as,,a professional in History education; History education for citizenship; values education and History.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS411",
    "Course": "History Education Method 3",
    "Description": "Aim: The main aim of this module is to prepare History student teachers to teach History in the Further Education and,,Training Phase of schooling, as part of their initial teaching qualification. At the end of the module, the students should,,have become competent in engaging in research in History Education. To achieve this they would be guided towards,,research competence informed by a sound knowledge, skills and values base. The student teachers would furthermore,,be assisted in developing and presenting a research proposal based on their individual focus and paradigmatic,,inclination/s.,,Content: The core content topics for the module are: Research paradigms for History Education Background and,,rationale for research study Selecting and using literature in History Education Relevant theory for History Education, Research methodology for History Education Proposal writing for History Education,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS601",
    "Course": "History Teaching 601",
    "Description": "Aim: To prepare History student teachers in the FET phase (grades 10 – 12), as part of their initial teaching qualification,,,to become competent in History teaching methods so as to be able to teach in schools. The modules aims to develop,,students pedagogical content knowledge, skills and values related to the teaching and learning of History in the national,,school curriculum. To achieve this in this module they will be introduced to and prepared towards professional,,competence and develop a sound knowledge, skills and values base. The student teachers will, furthermore, be assisted,,in developing and presenting lessons based on their individual teaching styles and philosophies. All this will be done,,with reference to the national school curriculum document.,,Content: The core content topics for the module are:The nature of school HistoryThe teacher of school HistoryThe,,learner of school HistoryThe learning of school HistoryThe school History curriculumDeveloping a personal History,,teaching philosophyCampus-based peer teaching, peer observation and reflection,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS701",
    "Course": "Issues in Teaching African History",
    "Description": "Aim: To examine and debate the nature of African History and how it manifests itself within the South African school,context. Selected issues that impact on this recent inclusion in the curriculum will be explored so as to empower students,to effectively conceptualise methodologies, policies and theories to teach African History effectively.,Content: This module covers the philosophical issues that History teachers have to consider in their practice. These,issues include African identity, consciousness and representations in relation to the nature of African history. The,relevance of various theoretical perspectives to African history will be explored, contemporary debates in post-colonial,Africa will be explored.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS703",
    "Course": "Teaching Historical Literacy",
    "Description": "Aim: To provide students with a theoretical understanding and practical competencies in the theories of Historical,literacy. The influence and impact of Historical literacy on teaching, learning and the curriculum will be analysed in,relation to different contexts, particularly post-apartheid South Africa.,Content: This module covers the conceptualisation of Historical literacy. To understand Historical literacy, the module,critically analyses the necessity of an index of Historical literacy and evaluates its implications for teaching and learning,of history. Various theorisations from all parts of the world are considered and applied to the local context.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDHS705",
    "Course": "Perspectives in Social Science Education",
    "Description": "Aim: To provide a theoretical grounding in the teaching and learning of Social Science in an interdisciplinary context as,it relates to the professional development of educators (compulsory for students doing the Social Science Education,specialization).,Content: Understanding the nature of Social Science Education. Theories on Social Science Education as an,interdisciplinary discourse. Disciplinary studies in an interdisciplinary Social Science Education context. Exploring the,curricular, methodological & pedagogical nature of Social Science Education in Africa. Social Science Education & the,struggle for presence & relevance in the African higher education system. Critical analysis of policies related to Social,Science Education.,Practicals: 3,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS111",
    "Course": "Comp Syst Operating and Application Software",
    "Description": "Aim: The aim of this module is to equip students with content knowledge and skills for competently operating a computer,systems,Content: Computer hardware and devices Computer configuration (and troubleshooting); System types (PDAs,,notebooks, desktop, server, mainframes); I/O devices; embedded computer devices (e.g. cell phones); Factors,affecting performance and reliability; Installation of devices; device connectivity (e.g. USB, firmware, wireless),Systems Software Operating systems (at a conceptual level. To include types – stand alone, network, etc. functions-,processing techniques); File management Installing and un-installing software; Adding devices; Hard disk,management Word-processing (advanced) Keyboarding skills (use of typing tutor software for windows),Practicals: There will be one 2 hour practical every week.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS201",
    "Course": "Information Systems Education Method 1",
    "Description": "Aim: To provide students with methodologies and understanding of the principles of Information Systems in the,,classroom. To prepare students towards the teaching of Computer Applications Technology in the FET phase.,,Content: Aims and objectives; planning for a whole topic; general lesson plan; approaches to teaching wordprocessing,,and spreadsheets; different types of methodologies and techniques.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS211",
    "Course": "IS Education 3: Ethical and Social Issues",
    "Description": "Aim: To equip students with content knowledge and skills in the areas on the Impact of computers: social, economic,,,ethical issues, Microsoft PowerPoint Presentation Desktop publishing skills. The module develops in students the ability,,to employ general principles of the discipline with more specific procedures for application.,,Content: Impact of computers: social, economic, ethical Human computer interaction and career issues Security,,issues MS PowerPoint Presentation skills Information systems and case studies Computers and file management,,Desktop publishing,,Practicals: There will be at least one 2 hour practical session every week.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS220",
    "Course": "Information Systems Education 220",
    "Description": "Aim: To prepare the student towards the teaching of End-User Computing in the FET phase. Intended for teachers who,wish to teach the subject, Computer Applications Technology, in the new FET curriculum.,Content: Human- computer interactions, E-Communications, Spreadsheets.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS310",
    "Course": "Information Systems Education 310",
    "Description": "Prerequisite Requirement: Information Systems Education 220.,Aim: To prepare the student towards the teaching of End-User Computing in the FET phase. Intended for teachers who,wish to teach the subject, Computer Applications Technology, in the new FET curriculum.,Content: Data Communications, operating systems and Power Point Presentations.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS312",
    "Course": "Information Systems Education 2",
    "Description": "Aim: To equip students with the content and skills for developing appropriate lesson plans, using appropriate problem,,solving strategies and applying appropriate teaching strategies in the teaching of all aspects of Computer Application,,Technology in the FET phase.,,Content: Implementation and management of a computer centre Educational research and examples of educational,,research Issues in education Assessment Technology for teaching Integration of multimedia and educational,,software Lesson plans of topics specific to grades 10 and 11.,,Practicals: There will be one 2 hour practical every week.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS320",
    "Course": "Information Systems Education 320",
    "Description": "Aim: To give students an in-depth understanding of why computers are essential components in business and society,,and to prepare the students towards the teaching of end-user Computing applications in the FET phase. Intended for,teachers who wish to teach the subject, Computer Applications Technology.,Content: Impact of computers: Social, Economic, ethical, Human Computer Interaction and career issues. Security,issues, Presentation skills, Information systems and Case studies, Computer and file management, Desktop publishing.,Practicals: 39,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS410",
    "Course": "Information Systems Education 410",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET phase and to,provide an opportunity for students to widen their knowledge in various areas of Computer Science.,Content: Theory of DBMS, Database development process database analysis and applications using ACCESS and,Number Theory and data representations.,Practicals: Thirteen.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDIS420",
    "Course": "Information Systems Education 420",
    "Description": "Aim: To prepare students towards the teaching of Information Technology (Computer Studies) in the FET phase and to,provide an opportunity for students to widen their knowledge in various areas of Computer Science.,Content: Web site development, Special topics w.r.t. current trends and technology.,Practicals: Thirteen,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLE120",
    "Course": "Language and Literacy 120",
    "Description": "Aim: In this module students examine key concepts about language acquisition and development and curricular,instructional principles which guide effective teaching and learning for first and second language learners in their primary,language, their second language and in academic instruction. Students will also explore the connection between cultural,practices of home / community and instruction in school, and ways in which schools engender home-school links.,Content: First language acquisition; second language acquisition; bilingualism; code-switching; language policy;language in the classroom."
  },
  {
    "Institution": "UKZN",
    "Code": "EDLE320",
    "Course": "Language and Literacy 320",
    "Description": "Aim: To examine materials, methods and strategies for teaching reading and writing with a focus on research-based,instruction in basic reading/viewing and writing skills and comprehension strategies to meet the needs of culturally,diverse students.,Content: Learning to read and write; reading and writing to learn; language (reading and writing) across the curriculum;,text evaluation and generation; assessment in reading and writing; reading problems.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLE701",
    "Course": "Lang Learning & Teaching in Multicultural Soc",
    "Description": "Aim: To explore and critique insights from sociolinguistic research that have implications for the multicultural language,,,classroom. Students are encouraged to consider the implications of these issues for language policy in schools and the,,,teaching/learning practices within the language classroom in a multicultural and multilingual society.,,,Content: Content include: An introduction to Multicultural Teaching, the impact of language diversity within the school,,,curriculum, Culture, ethnicity and education considered from a sociolinguistic perspective, Issues of identity and Power,,,relations within the school, Critical inclusivity, Stereotyping and Representation.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLE703",
    "Course": "Narratives in Education",
    "Description": "Aim: The program is designed to inform your understanding of narratives in the explication of short stories, the novel,,plays and film texts. Key concepts of narratology are studied and applied to the critical analysis of fiction. The utility of,narratives in pedagogy and educational research will also receive attention through close reading of selected texts.,Content: This module enables students to acquire knowledge of narratology through a study of selected literary texts,media and selected readings. This includes the concepts and theories of narrative that have been productively deployed.It also focuses on developing an insight into narratives in educational research and pedagogy within an African context."
  },
  {
    "Institution": "UKZN",
    "Code": "EDLE707",
    "Course": "Understanding Academic Literacy",
    "Description": "Aim: The aim of this module is to introduce students to the conventions of academic literacy. Students will be trained in,critical literacy pertaining to postgraduate writing, research and presentations in appropriate rhetorical conventions and,analytical rigor.,Content: The module adopts an academic literacies approach to reading and writing in appropriate academic registers,and genres. Students are introduced to various texts types that provide insight into the analysis of discourse, academic,and rhetorical conventions, and multimodal text types from both theoretical and practical perspectives.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF112",
    "Course": "Life Orientation Education 2",
    "Description": "Aim: The main aim of this module is to prepare Life Orientation student teachers in the Senior Phase and FET, as part,of their initial teaching qualification, with basic knowledge in fundamental concepts related to physical education and,sport, the benefits of PE in schools, an understanding of personal and environmental health, functional anatomy and,common sports injuries in PE, the different physiological systems and nutrition. The intended outcome is to develop,sound subject knowledge in the teaching specialisation with a view to develop the student as a subject specialist in PE,for the Senior Phase and FET. The student teachers would furthermore be assisted in developing programmes based,on their individual teaching styles and philosophies.,Content: The module focuses on the fundamental concepts related to PE and sport, the benefits of PE in schools, an,understanding of personal and environmental health, functional anatomy and common sports injuries in PE, the different,physiological systems and nutrition.,Practicals: The practicals could include laboratory and/or field based practical sessions on the functioning of the,different physiological systems.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF201",
    "Course": "Life Orientation Method 1",
    "Description": "Aim: To introduce students to the National Curriculum Statement for Life Orientation and to equip students with life skills.,,Content: Critical analysis of the National Curriculum Statement for Life Orientation; designing Life Orientation learning,,experiences; strategies for teaching and learning in Life Orientation; life skills facilitation including topics such as: time,,management, goal setting, conflict management, developing empathy, stress management.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF210",
    "Course": "Life Orientation 210",
    "Description": "Aim: To investigate various theories and approaches in the field of ethics, looking at the implications for society ingeneral and more specifically in the education arena, focusing on moral education.Content: An introduction to the study of ethics looking at meta-ethics, normative ethics (including different ethicaltheories and theorists), applied ethics, ethics in education; an investigation of applied ethics; Human Rights; ethics ineducation including topics like racism in schools, plagiarism and cheating, vandalism ; moral education and approachesto the facilitation thereof in the classroom."
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF212",
    "Course": "Life Orientation Education Method 1 FET",
    "Description": "Aim: To prepare Life Orientation Education student teachers in the FET, as part of their initial teaching qualification, to,become competent in engaging with the demands of the social and personal development aspects of the Life Orientation,curriculum document and related assessment criteria, and to translate this into effective teaching and learning,opportunities. The student teachers would furthermore be assisted in developing programmes based on their individual,teaching styles and philosophies.,Content: The core content topics for the module are: An introduction to the Curriculum and Assessment Policy (CAPS),for Life Orientation (Grades 10 – 12) The interpretation and implementation of CAPS for Life Orientation Assessment,in Life Orientation,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF300",
    "Course": "Life Orientation Education Content 4",
    "Description": "Aim: To prepare Life Orientation student teachers in the senior and FET phases, as part of their initial teaching,qualification, with basic knowledge in CAPS PE LO curriculum in the senior phase, physical activity and chronic diseases,,fitness testing: measurement and evaluation, and organisation and management of sport to become competent in,engaging with the Life Orientation demands of the Life Orientation curriculum document and related assessment criteria,,and to translate this into effective teaching and learning opportunities. The student teachers would furthermore be,assisted in developing programmes based on their individual teaching styles and philosophies.,Content: The module focuses on the CAPS PE LO curriculum in the senior phase, physical activity and chronic diseases;,fitness testing: measurement and evaluation, and organisation and management of sport.,Practicals: The practicals will include laboratory based and field based measurement and evaluation of a number of,physical fitness components as well as sport management related practical sessions.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF324",
    "Course": "Life Orientation Education Content 5",
    "Description": "Aim: To prepare Life Orientation Education student teachers in the FET phase, as part of their initial teaching,qualification, to become competent in engaging with the integrated nature of Life Orientation by exploring contemporary,issues in Life Orientation as they pertain to the personal, social and physical development of learners. This module aims,to develop the teacher as a scholar, researcher and lifelong learner, by providing the basis for critical theoretical,engagement as it relates to teaching and learning. This modules also aims to introduce Physical Education student,teachers in the FET phase, as part of their initial teaching qualification, to the theory, principles, concepts, and practices,that can be applied in the field of coaching with special emphasis on the developing school athletes,Content: This module focuses on the integrated Personal, Social and Physical Development aspects of Life Orientation,and concentrates on Human Rights Education, Citizenship Education, Human Development, Environmental and healthy,lifestyles. This module will also focus on coaching theory, principles, concepts, and practices that lead to success in the,field of coaching such as a coaching philosophy, setting coaching objectives, coaching styles, coaching diverse athletes,,communicating with athletes, motivating athletes, teaching technical and tactical skills, training basics, training for energy,and muscular fitness, drugs and managing relationships.,Practicals: The practicals will involve student teachers working with various athletes in individual and/or team sports.,,and coaches on various aspects of coaching such as talent identification, screening of athletes, and conducting a trainingsession."
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF411",
    "Course": "Life Orientation Method 3 FET",
    "Description": "Aim: The main aim of this module is to prepare Life Orientation student teachers in the FET, as part of their initial,,teaching qualification, to become competent in engaging with the Life Orientation demands of the Life Orientation,,curriculum document and related assessment criteria, and to translate this into effective teaching and learning,,opportunities. The student teachers will be equipped with strategies, methods and techniques to teach the Physical,,Education (PE) aspect in Life Orientation.,,Content: This module engages the science of teaching PE as part of Life Orientation in using diverse approaches. It,,covers strategies, methods and techniques underpinning PE teaching in the FET as well as segments specific to Physical,,Education teaching and learning and assessment. The module focuses on available and the use of technology and,,resources in teaching PE, motivation, behavior management, preventative classroom management, introduction to,,adapted PE and Sport, adapted sport, instructional strategies for adapted PE, student assessment and evaluation in PE,,,the importance of practice and feedback and safety issues in PE and Sport,,Practicals: The practicals will include athletics, swimming, cricket, soccer, rugby, indigenous games, netball, basketball,,,tennis, hockey, volleyball, badminton and baseball.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF603",
    "Course": "Life Orientation Teaching 602",
    "Description": "Aim: The module is intended for pre-service Senior Phase and Further Education and Training Teaching Phase Life,,Orientation teachers. The main purpose of this module is for students to critically engage with pedagogical knowledge,,,skills and values related to the teaching and learning of Life Orientation in the national school curriculum which focuses,,on the Personal, Social and Physical development of learners.,,Content:Life Orientation in the South African school curriculum and diverse social contexts as determined by the,,National Curriculum documents.The critical roles and competencies of the Life Orientation teacher as a facilitator and,,classroom manager.Life Orientation programme planning including the design of individual lessons.Teaching and,,learning strategies for Life Orientation in the Senior Phase and Further Education and Training Teaching and Further,,Education and Training Teaching phases.Assessment strategies.Campus-based peer teaching, peer observation and,,reflection.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDLF702",
    "Course": "Current Debates in Physical Education & Sport",
    "Description": "Aim: The purpose of this module is to present current debates in Physical Education (PE) and sports to highlight the,need for an active citizenry, especially school children.,Content: The module focuses on understanding the nature of PE in the school curriculum; current threats to health,,exercise and fitness; charters and policies for PE and sports; resistance training in youth; sport in post-apartheid South,Africa; constructions of masculinities and sexualities in PE and Sport; miseducation of a student-athlete and quotas in,sports.,Practicals: The practicals will include presentations on various topics on health, fitness and sports.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA134",
    "Course": "Primary Mathematics Education 110",
    "Description": "Aim: The general outcome of this module is that pre-service teachers will effectively facilitate the learning of Mathematics,in the Foundation Phase / Intermediate Phase of the GET Band.,Content: The teaching and learning of: numbers; operations and relationships; measurement and algebra; including the,use of appropriate technology.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA144",
    "Course": "Mathematics for Life and Teaching",
    "Description": "Aim: This module is intended for prospective FET phase teachers who have not studies Mathematics to grade 12 level.,The purpose is to develop mathematical literacy skills in these students and to engender self-confidence in their ability,to deal with quantitative situations that may arise in their professional lives as teachers.,Content: Numbers and number sense; mathematics in financial contexts; reasoning in mathematics; measurement;,geometry - symmetry, transformations, fractal geometry; foundational statistics.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA160",
    "Course": "Math for FET Teachers 1:Geometry & Trigometry",
    "Description": "Aim: The module is intended for pre-service mathematics teachers. It aims to help the student to employ general,principles of discipline with more specific geometric and trigonometric procedures for application. The purpose is to,develop personal confidence and competence in mathematics content, especially geometry. This will prepare teachers,for effective facilitation of learning of mathematics in the FET and SP bands.,Content: It covers the following topics: Basic geometric concepts such as point, distance, lines, planes. Euclidean,,Non Euclidean, Analytical, and Transformation Geometry The use of technology such as Sketchpad in exploring proof,and roles of proof in mathematical thinking,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA201",
    "Course": "Mathematics for Educators Method 1",
    "Description": "Aim: This module is intended for prospective GET or FET Mathematics teachers. The purpose is to develop the ability,to facilitate the learning of Mathematic in the Senior Phase, which entails personal conceptual competence in all aspects,of the subject content, pedagogic content knowledge and an understanding of how mathematical concepts develop in,learners.,Content: Teaching and learning Algebra, Statistics in the Senior / FET Phase. The work will be related to current,curriculum documents and international research on how key concepts in these topic areas are best learnt.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA211",
    "Course": "Primary Mathematics Education 210",
    "Description": "Aim: The general outcome of this module is that pre-service teachers will effectively facilitate the learning of Mathematics,in the Foundation Phase of the GET Band.,Content: The teaching and learning of: numbers, operations and relationships, measurement and algebra; including the,use of appropriate technology.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA221",
    "Course": "Mathematics Foundations Intermediate Phase",
    "Description": "Aim: The aim of this module is to provide an overview of the mathematical topics taught in the Intermediate Phase, and,to promote personal competence in these topics.,Content: Personal competence in topic areas of mathematics covered in the Intermediate Phase. Number sense with,whole and rational numbers Measurement – common benchmarks, SI units and conversions, calculations of perimeter,,area, volume. Geometric ideas such as shape, symmetry, transformations. Statistical literacy,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA226",
    "Course": "Mathematics Education for FI Phase",
    "Description": "Aim: The aim of this module is to provide a sound basis of the educational theories that underpin mathematics teaching,in the Foundation Phase and Intermediate Phases, and in depth understanding of the mathematics content areas taught,in the Foundation Phase and Intermediate Phases.,Content: Introduction to theoretical basis of mathematics education: Views on the nature of mathematics Views on,how children learn mathematics Mathematical proficiency Development of algebraic thinking Study of important and,foundational mathematics education ideas applicable to Foundation and Intermediate Phase teaching of Number,Operations Patterns Early algebra Proportional reasoning,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA231",
    "Course": "Maths Educ for FET Teachers : Diff Calc",
    "Description": "Aim: The module is intended for pre-service FET mathematics teachers. The purpose is to develop personal confidence,,and competence in mathematics content. This will prepare teachers to have the requisite content knowledge for effective,,facilitation of learning of mathematics in the FET Phase.,,Content: The following topics will be covered: Limits; Continuity; Differentiability; Differentiation; Implicit,,Differentiation; Applications of Differentiation,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA310",
    "Course": "Mathematics for Educators 310",
    "Description": "Aim: The purpose of this optional module is to provide pre-service teachers with the opportunity to increase their,personal confidence and competence in Maths, to develop a broad understanding of a selection of Maths topics, and to,prepare pre-service teachers to facilitate the learning of Maths in the FET band.,Content: Further applications of derivatives; derivatives of exponential and logarithmic functions; integration; simple,integration techniques; some application of integrals,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA320",
    "Course": "Mathematics for Educators 320",
    "Description": "Aim: The purpose of this optional module is to provide pre-service teachers with the opportunity to increase their,personal confidence and competence in Maths, to develop a broad understanding of a selection of Maths topics, and to,prepare pre-service teachers to facilitate the learning of Maths in the FET band.,Content: Further application of integrals; transcendental functions and differential equations; further integration,techniques; ordinary differential equations; modeling of differential equations; numerical method.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA322",
    "Course": "Maths Ed for SP3 Algebra and Functions",
    "Description": "Aim: The module is intended to prepare pre-service teachers to facilitate the teaching and learning of mathematics in,the Senior Phase. The purpose is to develop personal confidence and competence in mathematics content especially in,algebra concepts. This will prepare teachers for effective facilitation of learning of mathematics in the SP bands of study.,It aims to provide a sound knowledge base in algebra topics allowing them to apply the specific knowledge in a way that,connects to various concepts in mathematics.,Content: Study of important and foundational mathematics education ideas applicable to Senior Phase teaching of,algebra: Variables Using patterns as a tool for generalisation Working with algebraic expressions and language,Solving equations, inequalities and proving identities Functions and relations and graph work involving selective,functions Problem solving,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA324",
    "Course": "Maths EM2 SP Algebra and Functions",
    "Description": "Aim: To prepare student teachers to facilitate the teaching and teaming of Algebra and Functions in the Senior Phase.,Content:The teaching and learning of algebra and a selection of functions related to the Senior Phase using variety of,resources such as technology. manipulatlves etc.Analysing misconceptions in Algebra and Functions.A study about,theories of learning mathematics.,Practicals: A minimum class mark of 40% and a minimum attendance of 75% of the module contact time as per,attendance register.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA326",
    "Course": "Mathematics Education Method 1 Intern Phase",
    "Description": "Aim: To provide a sound basis of the pedagogical content knowledge, teaching strategies and classroom practices,required to effectively facilitate mathematics learning in the Intermediate Phase.,Content: Overview of current national curriculum requirements for Intermediate Phase Mathematics Models and artifacts,for number Common misconceptions and errors in number Selection and design of games to promote mathematical,learning Use of childrens literature to motivate and enhance mathematical learning Using technology in the mathematics,classroom.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA329",
    "Course": "Maths Ed for FET Teachers 5 Stats and Prob",
    "Description": "Aim: The module is intended for pre-service FET mathematics teachers. The purpose is to develop personal confidence,and competence in mathematics content. This will prepare teachers for effective facilitation of learning of mathematics,in the FET band.,Content: It will cover the following: Descriptive statistical methods; Shapes of Distributions, Measures of Centre and,Spread, The Fundamental Counting Principle, Use of Venn diagrams to calculate probabilities, Permutations and,combinations in probability calculations, Least Squares Regression Line; linear regression and Correlation, Sampling,distributions, Interval estimates for a population mean, standard deviation and proportion, A confidence interval for a,population mean and proportion, Hypothesis tests for means and proportions,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA410",
    "Course": "Mathematics for Educators 410",
    "Description": "Aim: To provide pre-service teachers with the opportunity to increase their personal confidence and competence in,,Maths, to develop a broad understanding of a selection of Maths topics, and to prepare pre-service teachers to facilitate,,the learning of Maths in the FET band.,,Content: The Real Number System; Series; Sequences; Continuity; Countibility; Cluster points; Financial Mathematics.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA412",
    "Course": "Maths EM3 SP Statistics and Probability",
    "Description": "Aim: To prepare pre-service teachers to facilitate the teaching and learning of data handling in the Senior Phase.,,Content: Study of important and foundational mathematics education ideas applicable to Senior Phase teaching of data,,handling: Formulation of questions designed to solve an everyday problem. Data collection techniques (e.g., surveys,,,experiments, and simulations such as sampling) using an interesting problem.Linking assessment strategies with,,statistical thinkingDevelopment of statistical reasoning in investigating and solving real life problems/issues.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA414",
    "Course": "Mathematics Education Method 1 for FET",
    "Description": "Aim: To prepare student teachers to facilitate the teaching and learning of mathematics in the FET Phase.,,,Content: A study about theories of learning mathematics, including van Hiele, Piagetian and visualisation theories,,,,The use of diagrams, manipulatives, and technology in teaching and learning mathematics. Designing of Lesson Plans.,, Marking techniques. Teaching and learning of Trigonometry, proof and proving, Euclidean, Non-Euclidean and,,,Coordinate Geometry. Misconceptions in Geometry and Trigonometry.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA600",
    "Course": "Mathematics Teaching FET 601",
    "Description": "Aim: The module is intended for pre-service FET phase Mathematics teachers to introduce to and engage students with,,,the skills, attitude and knowledge required to teach Mathematics in the FET phase. The purpose is to develop knowledge,,,about teaching and learning Mathematics in the FET phase; develop specialist teaching skills and competencies; develop,,,practical skills for teaching Mathematics; introduce educational and professional issues relevant to Mathematics; design;,,,and produce Mathematics resources and technology for specific teaching purposes.,,,Content: The module will cover the following content:The Mathematics FET assessment and policy documentsThe,,,Mathematics FET content as prescribed by the national curriculum documents for example a selection of the following,,,content areas: Functions; Number Patterns, Sequences, Series; Finance, growth and decay; Algebra; Differential,,,Calculus; Probability; Euclidean Geometry and Measurement; Analytical Geometry; Trigonometry and Statistics will be,,,discussed.Affective issues in Mathematics FET learningThe selection, sequencing and pacing in Mathematics FET,,,teaching as per the national curriculum requirementsIssues and debates in Mathematics education, learning about the,,,African context (diversity, inclusivity, socio-economic factors and HIV/Aids)The use of innovative instructional,,,strategies, technology and manipulatives in FET Mathematics teachingCampus-based peer teaching, peer observation,,,and reflection within the context of FET Mathematics teaching,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA602",
    "Course": "Mathematical Literacy Teaching 602",
    "Description": "Aim: The module is intended for pre-service FET phase Mathematical Literacy teachers to further develop students with,respect to the skills, attitude and knowledge required to teach Mathematical Literacy in the FET phase. The purpose is,to further develop knowledge about teaching and learning Mathematical Literacy; further develop specialist teaching,skills and competencies and further develop practical skills for teaching Mathematical Literacy.,Content: The module will cover the following content:The nature of Mathematical LiteracyExpressing specialist,pedagogic content knowledge with respect to mathematical concepts in Mathematical Literacy with reference to current,school topics as per the national curriculum documents. The topics include a selection of the following content areas:,Interpreting and communicating answers and calculations; Numbers and calculations with numbers; Patterns,,relationships and representations; Finance; Measurement; Maps, plans and other representations of the physical world;,Data handling and Probability.Designing tasks and assessments in Mathematical Literacy as per the national curriculum,requirementsReflecting on and extending ideas revolving around situational and practical learningLearner,misconceptions within the context of Mathematical Literacy teaching in Africa,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMA607",
    "Course": "Mathematics Teaching FET 602",
    "Description": "Aim: The module is intended for pre-service SP Mathematics teachers to introduce to and engage students in the skills,,,attitude and knowledge required to teach Mathematics in the Senior Phase. The purpose is to develop knowledge about,,teaching and learning; develop specialist teaching skills and competencies; develop practical skills for teaching;,,introduce educational and professional issues relevant to Mathematics; and design and produce resources and,,technology for specific teaching purposes.,,Content: The module will cover the following content:The Mathematics SP national curriculum, assessment and policy,,documentsMathematics SP content as prescribed by the national curriculum documents for example a selection of,,topics from the following content areas Numbers, Operations and Relationships; Patterns, Functions and Algebra; Space,,and Shape (Geometry); Measurement; and Data Handling will be discussed.Affective issues in Mathematics SP,,learningThe selection, sequencing and pacing in Mathematics SP teaching as per the national curriculum requirements,Campus-based teaching, peer observation, peer assessment and reflection within the context of SP Mathematics,Issues and debates in Mathematics education and learning about the African context (diversity, inclusivity, socio-economic factors and HIV/Aids)The use of innovative instructional strategies, technology and manipulatives inMathematics SP teaching."
  },
  {
    "Institution": "UKZN",
    "Code": "EDMN712",
    "Course": "Intro to Educ Leadership & Management",
    "Description": "Aim: To introduce students to concepts, theories and models of leadership and management. The emphasis is on linking,concepts, theories and models to practices and also how practices in turn inform concepts, theories and models. This,module will also bring into dialogue African, Western and/or Eurocentric notions of leadership and management.,Content: This module focuses on concepts, theories and models of educational leadership and management. It covers,contested meanings of leadership and management and its synergy to each other. Theories such as servant leadership,,leadership for learning, distributed and ethical leadership; collegial, formal and subjective theories are discussed.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMN716",
    "Course": "Leading and Managing Educational Change",
    "Description": "Aim: In this module, students will critically analyse key aspects of leading and managing educational change from,Africanised, Westernised, and European perspectives. The module will examine the structural, human resource, cultural,,and political perspectives in relation to leading and managing change in educational organisations. Furthermore, uses,theories and practice to investigate how education institutions and individuals experience educational change.,Content: Students will explore organisational issues of change and key organisational and personnel issues involved,with leading and managing educational change successfully. By reflecting on their own practices, drawing on literature,and critically engaging on theoretical models, students will explore complexities of change, and how people react to,change.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDMN814",
    "Course": "Leading Prof in Learning Communuties",
    "Description": "Aim: The module seeks to critically examine theory, research and practice in relation to the leadership of human,resources within professional learning communities, and to explore leadership within a constantly changing educational,context.,Content: The module exposes students to critical engagements with theories and perspectives on educational change,,leadership for organizational learning and organizational cultures within communities of practice.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDNS112",
    "Course": "Foundational Concepts in Physical Sciences",
    "Description": "Aim: The aim of this module is to familiarise students with foundational concepts in physics and chemistry. This module,will equip students with knowledge and specific skills to enable them to teach relevant topics in Natural Science in the,Senior Phase. It will enable students to develop the competence to apply concepts and principles in relevant contexts.,Content: Forces: foundational concepts and laws related to forces Energy sources, energy flow and energy,transformations Basic electrostatics Particle theory of matter: foundational concepts, models and principles related to,the classification of matter. Atomic structure: different models of atomic structure Chemical bonding and reactions:,foundational concepts and theories related to chemical bonding.,Practicals: Practical sessions as required,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDNS211",
    "Course": "Natural Science Education Method 1",
    "Description": "Aim: This module will focus on the nature of the sciences and of indigenous knowledge systems. Emphasis will be on,the Natural Sciences school curriculum, the purpose of practical work in science, and laboratory safety. A fundamental,aspect of this module is to engage students in meaningful reflection on their Professional Practice experience.,Content: The nature of knowledge: Nature of Science and Indigenous Knowledge Systems, The Natural Science,Curriculum, History of Science, Gender and Science Education, Practical work, Laboratory safety, Reflections on,professional practice,Practicals: None,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDNS213",
    "Course": "Natural Science Education4:Energy and Change",
    "Description": "Aim: To teach relevant physical sciences content, concepts and processes within Natural Science in the Senior Phase.,Content: The module introduces students to forces & fields, energy & energy transfer, heat and thermodynamics,,thermochemistry, electrical circuits,Practicals: Practical sessions as required,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDNS311",
    "Course": "Natural Science Education Method 2",
    "Description": "Aim: This module will focus on the development of conceptual and cognitive skills and practical techniques related to,teaching the content topics covered in Natural Sciences Education content modules. In particular, it will introduce,students to teaching approaches which are particular to the Natural Sciences; to interrogate strategies for teaching large,classes, e.g. co-operative learning strategies; to further extend students competences in lesson planning and,presentation with emphasis on assessment; to develop competence in the use of resources, including ICT, in science,learning commensurate with the needs of learners, the learner diversity and the diverse nature of the teaching and,learning environments.,Content: Inquiry based learning Resource-based learning Cooperative learning Teaching large classes in science Lesson planning and presentation Assessment Reflections on professional practice,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDNS601",
    "Course": "Natural Sciences Teaching 601",
    "Description": "Aim: The main aim of this module is to introduce students who wish to specialise in Natural Sciences teaching in the,Senior Phase (grades 7 – 9) to the knowledge, skills, values and attitudes required to teach Natural Sciences within the,national school curriculum framework. To develop competence in teaching of Natural Science in the Senior phase.,Content: The module will cover the following contentTeaching and learning Natural SciencesUsing an inquiry,approach to teach Natural SciencesPractical work and investigations for Natural SciencesPrinciples of curriculum -,Natural Sciences National Curriculum DocumentsBasic planning and instruction strategies for Natural SciencesPractical learning through micro-teaching, lesson observations and lesson transcriptsLearning about diverse school,and Natural Sciences classroom contextsIdentifying and managing barriers to learning Natural SciencesCurrent,issues and debates in Science in societyCareer choices and professional progression as a Science teacherCampus,based peer teaching, peer observation and reflection,Practicals: A number of practical investigations based on the school curriculum are required for this module and will becarried out in the laboratory."
  },
  {
    "Institution": "UKZN",
    "Code": "EDPD601",
    "Course": "Music Teaching 601",
    "Description": "Aim: The main purpose of this module is for student teachers to engage critically with pedagogical knowledge, skills and,values related to the teaching and learning of Music in the FET phase (grades 10 – 12) in the national schools curriculum.,To introduce students to the schools curriculum, pedagogy and assessment as it relates to teaching Music. To prepare,students to be able to teach Music competently in the FET phase.,Content:The role of music in the education of a childThe Music FET curriculum and assessment policy documentsDesigning lesson plans and resource material for teaching MusicStrategies for teaching Music theory and practicalsAssessment in Music for the FET phaseIntroduction to teaching and learning of a musical instrument (e.g. recorder),and sight readingClassroom management skills for effective Music pedagogyUse of technology and resources for,successful Music teachingCampus-based teaching, peer observation and reflection,Practicals: Musical instrument playing (recorder) in the music room.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPD614",
    "Course": "Visual Arts Teaching 601",
    "Description": "Aim: The main purpose of this module is for student teachers to engage critically with pedagogical knowledge, skills and,values related to the teaching and learning of Visual Arts in the FET phase (grades 10 – 12) in the national school,curriculum. To introduce students to the school curriculum, pedagogy and assessment as it relates to teaching of Visual,Arts. To prepare students to be able to teach the main components of Visual Arts competently in the FET phase.,Content:The role of Visual Art/Artist in education and societyThe relevance of Visual Arts Education in the school,curriculumVisual Arts education and the mediaVisual Arts aesthetics in South AfricaVisual Arts FET curriculum and,assessment policy documentsStrategies for teaching Visual Arts theory and practicalsAssessment in Visual ArtsLesson planning and resources for teaching Visual ArtsCampus-based peer teaching, peer observation and reflectionClassroom management for successful Visual Arts teaching,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPD704",
    "Course": "Mentoring in Schools",
    "Description": "Aim: The purpose of this module is to facilitate the professional development of (experienced) teachers as on-site,mentors. It will develop the specific roles and responsibilities of senior/experienced teachers particularly in mentoring,colleagues in South African schools. It emphasizes the developmental approach to mentoring.,Content: The module content is on teacher mentoring and engages students on literature, theory and processes of,mentoring as part of teacher development, both of novice teachers and of experienced teachers. It further engages on,issues of mentor/mentee relationships for the professional growth of teachers.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPD712",
    "Course": "Teacher Identities and Teacher Change",
    "Description": "Aim: The module aims to explore how teachers negotiate their personal and professional identities within a range of,contextual/social realities. The focus of the module is on the links between the personal - professional and its relation to,varying social contexts, in working towards reconstructing / re-inventing selves as teachers and professionals.,Content: The module content centres around global and local discourses and debates relating to teacher identities and,teacher work (includes engagement with the self, teachers lives, teacher identities, teacher reflection, teacher personal,and professional knowledge, teacher change),"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPD715",
    "Course": "Teacher Stress and Wellbeing",
    "Description": "Aim: The purpose of this module is to contribute to the continuous professional development of teachers by creating,knowledge about job demands and by developing strategies how to effectively manage such demands. Teachers will,also acquire knowledge and skills on how to create and foster personal and job resources to sustain their wellbeing.,Content: The module content is on job demands and resources in the teaching profession as well their role for stress,,burnout and wellbeing of teachers. The Module further engages students on how to activate personal and job resources,to sustain their wellbeing and provide quality teaching and learning.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPD808",
    "Course": "Researching Teacher Development",
    "Description": "Aim: To expose students to the research and research agendas within teacher development. Current issues impacting,on teachers and education, methodologies, methods and research literacy will be the primary focus of this module to,develop in students the knowledge, skills and values of educational research in the area of teacher development and,teacher studies.,Content:Research in the areas of teacher knowledge, teacher learning, teacher work and teacher identit Current,issues in teacher development and education, nationally and internationall Research foci within the domain of current,issues in teacher development and education, nationally and internationall Research methods and methodologies,informing the research agendas within teacher development, nationally and internationallResearch ethics.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS111",
    "Course": "Chemical Reactions",
    "Description": "Aim: The aim of this module is to familiarise students with the chemistry content of solution chemistry of salts,,electrochemistry, main group elements, organic chemistry. This module will equip students with subject knowledge,,theory and specific skills to enable them to teach relevant topics in Physical Sciences in the FET phase of schooling,,and enable them to develop the competence to apply concepts and principles in relevant contexts.,Content: Solution chemistry of salts Inorganic – electrochemistry Main group elements (groups 4, 5,6,7 –sulfur,,phosphorus, nitrogen, oxygen & halogens) Organic chemistry,Practicals: Practical sessions as required,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS210",
    "Course": "Physical Science for Educators 210",
    "Description": "Aim: This module will equip students with knowledge and scientific skills to enable them to teach relevant topics in,Physical science from Grade 10 to Grade12 of the FET phase of schooling competently and confidently.,Content: Mechanics – Vectors, Newtons laws, Momentum, Kinematics, Work & Energy, Elasticity, Moments.,Practicals: 20,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS220",
    "Course": "Physical Science for Educators 220",
    "Description": "Aim: This module will equip students with knowledge and scientific skills to enable them to teach relevant topics in,Physical Science in the FET phase of schooling.,Content: Basic Chemistry; Stoichiometry; Periodic Table/Chemical bonding; Nature of Science.,Practicals: 30,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS310",
    "Course": "Physical Science for Educators 310",
    "Description": "Aim: This module will equip students with knowledge and scientific skills to enable them to teach relevant topics in,Physical Science from grade 10 to Grade12 of the FET phase of schooling competently and confidently.,Content: Electrostatics, Direct and alternating current & circuits, Electromagnetism, Electromagnetic induction, Basic,electronics.,Practicals: 20,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS330",
    "Course": "Physical Science Education 2 Chemical Reactions",
    "Description": "Aim: To familiarise students with the chemistry content of solution chemistry of salts, electrochemistry, main group,elements, organic chemistry. This module will equip students with subject knowledge, theory and specific skills to enable,them to teach relevant topics in Physical Sciences in the FET phase of schooling, and enable them to develop the,competence to apply concepts and principles in relevant contexts.,Content: Solution chemistry of salts Inorganic – electrochemistry Main group elements (groups 4, 5,6,7 –sulfur,,phosphorus, nitrogen, oxygen & halogens) Organic chemistry,Practicals: Practical sessions as required,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS332",
    "Course": "Phys Sc Ed 4 Electricity & Atomic Structure",
    "Description": "Aim: The module develops in students the knowledge base, theories and methodologies required for teaching this,specialisation with a view to developing the student as a subject specialist for the FET phase of teaching. In particular,,this module will familiarise students with the content of electrostatics, electricity, electromagnetism, and electrochemistry.,This module will equip students with knowledge and specific skills to enable them to teach relevant topics in Physical,Sciences in the FET phase of schooling.,Content: Electrostatics Electric and electronic circuits Electromagnetism and Induction Historical experiments,related to the development of atomic models Electron behaviour and light – atomic spectra, photoelectric effect,Practicals: Practical sessions as required,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS334",
    "Course": "Phy Sc Ed Method 2 Teaching and Learning",
    "Description": "Aim: To provide students with a broad-based sound knowledge that equips the graduate with the knowledge of theories,and methodologies of the discipline to enable them to demonstrate the initiative and responsibility in an academic and,professional context within and inclusive education framework. In particular, it will assist students in developing an,awareness of the various teaching and learning strategies in Physical Science education; to make students aware of the,kinds of misconceptions learners; to develop skills in assessment; to develop skills in selecting and using resources in,science teaching and to engage in professional reflective practice.,Content: The following content will be covered : teaching and learning strategies in physical sciences ; resource-based,learning ; assessment ; identifying and addressing alternative (mis)conceptions, as well as reflection on the applicationof the above during Professional Practice Teaching and learning strategies in physical sciences (cooperative learningetc…) Resource-based learning (types of resources, use of selected resources eg. simulations) Assessment – tests,examinations, practical reports Identifying and addressing alternative (mis)conceptions Reflection on the applicationof the above during Professional Practice"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS410",
    "Course": "Physical Science for Educators 410",
    "Description": "Aim: This module will equip students with knowledge and scientific skills to enable them to teach relevant topics in,Physical Science from grade 10 to Grade12 of the FET phase of schooling competently and confidently.,Content: Waves, Optics, Atomic structure, radioactivity and nuclear physics, wave-particle duality.,Practicals: 30,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS420",
    "Course": "Physical Science for Educators 420",
    "Description": "Aim: This module will equip students with knowledge and scientific skills to enable them to teach relevant topics in,Physical Science in the FET phase of schooling.,Content: Solutions, redox reactions, electrochemistry, introductory organic chemistry.,Practicals: 30,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPS602",
    "Course": "Physical Sciences Teaching 602",
    "Description": "Aim: The aim of this module is to introduce and engage students who wish to specialise in Physical Sciences teaching,,,with the pedagogical knowledge, skills, values and attitudes required to teach Physical Sciences in the FET phase. To,,,develop competent teachers of Physical Sciences.,,,Content: The Nature of Science and Science Education Problem solving and scientific reasoning Communication,,,,language and models Assessment in Physical Sciences Advanced planning and instruction strategies for Physical,,,Sciences Professional ethics for Physical Sciences Practical learning through micro-teaching, lesson observations,,,and lesson transcripts Learning about diverse school and classroom contexts,,,Practicals: Practical activities are required for this module.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY110",
    "Course": "Numeracy in the early years",
    "Description": "Aim:To introduce students to fundamental concepts of early mathematics to strengthen their basic mathematical,,,knowledge.To provide students with knowledge of number sense and how to deal with numbers in number relationships,,,and in operations in the early years of schoolingTo explore early geometric thinking, geometric concepts and to develop,,,students reasoning about space and shape in the early years of schooling.To provide students with an understanding,,,of the indigenous concepts of measurement; the measuring process and the use of mathematics vocabulary in the early,,,years of schooling To equip students with knowledge of early data handling including collection, organisation,,,,representing and interpreting data.,,,Content: Fundamental concepts of mathematics to strengthen students mathematical knowledge. Number sense,,,and how to deal with numbers in number relationships and in operations. Geometric thinking, geometric concepts and,,,reasoning about space and shape. The concepts of measurement; the measuring process and the use of mathematics,,,vocabulary. Data handling including collection, organisation, representing and interpreting of data.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY202",
    "Course": "Understanding Child development & Learning FP",
    "Description": "Aim: To introduce students to fundamental concepts about child development from birth to nine years To provide,students with basic introductory knowledge to understand how the child develops from birth to nine To equip students,,with knowledge , skills, and values to communicate and implement the principles of child development To expose,,students to a variety of learning theories in order to analyse the impact they have on the indigenous child rearing practices,,in various contexts To explore the relationship between knowledge of child development and teaching and learning in,,diverse early childhood settings,,Content: Fundamental concepts about child development from birth to nine years Basic introductory knowledge to,,understand how the child develops from birth to nine Principles of child development Learning theories on the,,indigenous child rearing practices Teaching and learning in diverse early childhood settings,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY204",
    "Course": "English Literacy Method 2 FAL",
    "Description": "Aim: To develop students knowledge of FAL acquisition and stages of development in the early years (e.g. Krashens,input hypothesis) To acquaint students with knowledge of using FAL for communication and learning in foundation,phase (e.g. BICS & CALP) To expose student to a variety of global theoretical perspectives on teaching and learning,the FAL in different contexts in foundation phase. To equip students with critical knowledge of basic FAL skills and,teaching strategies in the foundation phase To equip students with comprehensive knowledge on assessment of basic,FAL literacy skills in foundation phase,Content: Knowledge of FAL acquisition and stages of development in the early years Knowledge of using the FAL,for communication and learning in foundation phase Variety of global theoretical perspectives on teaching and learning,the FAL in different contexts in foundation phase. Critical knowledge of basic FAL skills and teaching strategies in the,foundation phase Comprehensive knowledge on assessment of basic FAL literacy skills in foundation phase,Comprehensive knowledge of debates around FAL teaching in foundation phase; e.g. policies Knowledge of using a,range of strategies in foundation phase FAL teaching in different contexts Knowledge of FAL teaching strategies in,foundation phase multilingual contexts Critiquing observed FAL for foundation phase teaching lessons through different,theoretical lenses Development of a variety of teaching and learning resources for effective FAL teaching in foundation,phase Variety of planning and assessment strategies for effective FAL teaching skills in foundation phase,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY206",
    "Course": "IsiZulu Literacy Method 2 HL",
    "Description": "Aim: To develop students knowledge of HL acquisition and stages of development in the early years To introduce,students to the knowledge of using the language for learning To develop students understanding of a variety of global,theoretical perspectives on teaching and learning the HL in the early years. To equip students with comprehensive,knowledge of assessment of basic HL literacy skills in the foundation phase To equip students with knowledge to,address barriers related to language learning in the early years To develop students knowledge to incorporate play-,based strategy in early language teaching To equip students with basic knowledge of developing early literacy teaching,resources using waste.,Content: Knowledge of HL acquisition and stages of development in the early years Knowledge of using the language,for learning in the early years Variety of global theoretical perspectives on teaching and learning the HL in the foundation,,phase Comprehensive knowledge of assessment of basic HL literacy skills in the foundation phase Knowledge of,,incorporating play-based strategy in early language teaching Basic knowledge of developing early literacy teaching,,resources using waste,,Practicals: None.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY321",
    "Course": "Life Skills 2",
    "Description": "Aim: To provide students with an introduction to Life Skills conceptualisation in the South African context. To introduce,,students to Life Skills curriculum policys, mandate. To introduce and develop students knowledge of Life Skills content,,areas:- o Beginning knowledge o Personal and social well being o Creative arts o Physical education To equip students,,with knowledge and debates around Life Skills content areas. To introduce students to theoretical perspectives,,underpinning Life Skills,,Content: Introduction to Life Skills conceptualisation in the South African context Life Skills curriculum policys,,mandate Knowledge of Life Skills content areas Knowledge and debates around Life Skills content areas in different,,contexts. Theoretical perspectives underpinning Life Skills,,Practicals:,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY324",
    "Course": "Mathematics for Foundation Phase Method 1",
    "Description": "Aim: To provide students with theoretical understanding of how Foundation Phase Learners learn Mathematics To,,empower students to plan and teach the Mathematics curriculum in the Foundation Phase (Grades R-3) To introduce,,students to various approaches for teaching Foundation Phase learners: - Number sense and number relationships -,,Patterns and Algebra - Geometry (Space and Shape) - Data handling. To equip students with knowledge and strategies,,of assessing Mathematics in the Foundation Phase. To provide students with knowledge and skills to develop,,Foundation Phase Mathematics resources.,,Content:Theoretical understanding of how Foundation Phase Learners learn Mathematics Planning and teaching,,Mathematics curriculum in the Foundation Phase (Grades R-3) A variety of approaches for teaching: - Number sense,,and relationships - Patterns and Algebra - Geometry (Space and Shape) - Data Handling. Knowledge and strategies,,of assessing Mathematics in the Foundation Phase. Knowledge and skills of developing Foundation Phase,,Mathematics resources.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY326",
    "Course": "Mathematics Education Method 1 for IP",
    "Description": "Aim: To provide students with theoretical understanding of how Foundation Phase Learners learn Mathematics. To,,empower students to plan and teach the Mathematics curriculum in the Foundation Phase (Grades R-3). To introduce,,students to various approaches for teaching Foundation Phase learners: - Number sense and number relationships -,,Patterns and Algebra - Geometry (Space and Shape) - Data handling. To equip students with knowledge and strategies,,of assessing Mathematics in the Foundation Phase. To provide students with knowledge and skills to develop,,Foundation Phase Mathematics resources.,,Content: Theoretical understanding of how Foundation Phase Learners learn Mathematics. Planning and teaching,,Mathematics curriculum in the Foundation Phase (Grades R-3). A variety of approaches for teaching: - Number sense,,and relationships - Patterns and Algebra - Geometry (Space and Shape) - Data Handling. Knowledge and strategies,,of assessing Mathematics in the Foundation Phase. Knowledge and skills of developing Foundation Phase,,Mathematics resources.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY411",
    "Course": "Life Skills 3",
    "Description": "Aim: To develop in students a sound understanding of the role of creative arts and physical education in promoting a,healthy living environment amongst young children. It includes developing an awareness of creativity and perceptual,development for the holistic development of children.,Content: Knowledge and development of dance techniques Dramatic acting skills development Music genre and,skills in using musical instruments Creative imaginations through drawings, pictures and collages Rhythm and balance,development through play and movements Games and sports for early childhood development,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY701",
    "Course": "Human Development and Learning",
    "Description": "Aim: The aim of this module is designed to afford educators deeper insight into understanding human development and,learning in order to become more effective teachers: to acquire knowledge and skills in order to promote the optimal,development of learners and to enhance teaching and learning.,Content: Discourses of childhood development; early development theories; recent theories of development; socio-,cultural perspective on development and learning; constructivist approach of teaching and learning; contextual, social,and interpersonal factors that promote/impede development and learning; positive development and learning context.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY710",
    "Course": "Introduction to Inclusive Education",
    "Description": "Aim: The purpose of the module is to raise awareness regarding the debates around the shift in emphasis from ‘special,,,needs to ‘addressing barriers to learning and development in school, community and society with a view to achieving,,,inclusive teaching.,,,Content: Theoretical underpinnings, understandings of exclusion and inclusion, including conceptualisations in recent,,,policy documents in South Africa and the world. Exploration of interventions aimed at increasing the participation of,,,those learners who are marginalized on account of difference from the culture and curriculum of the school.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY810",
    "Course": "Inclusive Education Theory and Practice",
    "Description": "Aim: To raise awareness regarding the debates around the shift in emphasis from “special needs” to “addressing barriers,,,to learning and development in school, community and society”. Theoretical underpinnings of this shift will be debated,,,,including conceptualisations in recent policy documents in South Africa. The module will focus mainly on research studies,,,on the subject of Inclusion.,,,Content: Changing perspectives in special needs education: Historical analysis. Policy development and legislation in,,,South Africa. Challenges (local & international) regarding the implementation of inclusive education: charting the way,,,forward.,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDPY812",
    "Course": "Psychological Interventions in Education",
    "Description": "Aim: To equip students with knowledge and skills to make them capable of providing basic, brief and supportive,,,,,counselling services in schools. The general goal of the module is to make students competent in applying psychological,,,,,and or psycho-educational services to enhance the well-being of learners and their teachers.,,,,,Content: Psychological Interventions; Helping relationship; Psychological Testing/ Assessment; Dysfunctional Families;,,,,,Mental Health, Traumatised children; Learning difficulties, School Psychological Services; School Violence; Ethical,,,,,Issues; Career Guidance; HIV/AIDS counselling; Crisis Intervention.,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDRS732",
    "Course": "Independent Research Project (IRP)",
    "Description": "Aim: The purpose of this module is to provide Bachelor of Education Honours students with the experience of a small,,,,,independent research project, to foster intellectual independence and critical reflection. The module will develop research,,,,,capacity in the methodology and techniques of a particular education specialisation.,,,,,Content: Concepts that underpin research for example: proposal development, methodology, data collection, data,,,,,analysis, issues of ethics, conducting and writing independent research. Students may also work with research in the,,,,,field to explore issues of diversity and inclusivity within South African society.,,,,,Practicals: None,,,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDRS821",
    "Course": "Research Discourses and Methodology",
    "Description": "Aim: To develop in students a critical research literacy and proficiency in the language and practice of educational,,,,,research. The module further aims to develop students understanding of a range of research designs, methodologies,,,,,,methods of data production with a view to making appropriate selection decisions of research design.,,,,,Content: Research, discourses and education.Research traditions and paradigms, including positivist, interpretivist,,,,,,critical and post-modernist. Key concepts: Ontology, epistemology, methodology, methods, ethics, axiology. Qualitative,,,,,approaches – Discourses related to methods and various research designs. Quantitative approaches - Discourses,,,,,related to methods and various research designs. Mixed methods approaches - Discourses related to methods and,various research designs.The researcher, participant and the power relations in education research. Ethical research in,education. Focus on a range of research methodologies and how they are used in educational research.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSE131",
    "Course": "Electronics and Electricity",
    "Description": "Aim: The main aim is to introduce students to basic electronics and industrial systems, with respect to industrial,automation by developing students knowledge, skills and understanding of basic electrical systems, mechanical,systems, electronics, hydraulics, pneumatics, gas and arc welding, fabrication and its application to industry.,Content: Introduction to Electronics and Electricity – application in schools and industry Principles of blueprint reading Introduction to Industrial systems Application of Systems Control & Automation Fabrication, manufacturing and,machining Manufacturing Systems Metal Forming And Sheet Metalworking Material removal processes Special,Processing And Assembly Technologies,Practicals: Practical work and fieldwork as required by the content.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSE212",
    "Course": "Technology Education 3 Renewable Energy Tech",
    "Description": "Aim: This module aims to introduce students to Renewable Energy Technologies (RETs) and the concepts behind the,design of renewable and efficient electric power systems. Distributed power generation and its economics are discussed,,followed by a detailed analysis of the design and operation of solar (photovoltaic - PV), wind, hydro and other renewable,power systems. Students are exposed to the problem of meeting energy demands while implementing strategies to,reduce greenhouse gas emissions. Furthermore, the module provides an overview of the status of RETs locally and,internationally and explores the debates and politics surrounding the provision of cleaner and cheaper energy in the 21st,century.,Content: Content Topics are selected from the list below: Defining the concept of Energy (Scientific and mathematical,definitions) The historical development of electricity as our major energy source Solar & wind technologies Hydrogen,(electrolysis) & fuel cell technologies Energy storage & conversion Introduction to hybrid renewable energy systems Introduction to renewable energy system design & management. Load & weather simulations Energy politics and,sustainability,Practicals: Practical work and fieldwork as required by the content.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSE313",
    "Course": "Tech Education 4 Project Based Learning",
    "Description": "Aim: This module engages students in project based learning in Technology education and its application to the,knowledge strands from the other 3 core content Technology Education modules. The focus is on the design, research,and development experience in Technology Education.,Content: Topics are selected from the list below: The topics that form the contents of this module are drawn from /based,upon the core content of the previous 3 Technology modules. These topics allow for students to engage in research that,will catapult technological innovation via project based learning. This type of learning allows for head-heart-hands on,engagement that can be used to alleviate many contextual problems encountered locally. The topics include: An,Introduction to problem based learning in Technology Project Guide Project management Project Investigation,From design specification to Product specification Generating and developing ideas Testing and evaluation Planning,and making prototypes Planning the making and the manufacturing Project presentation,Practicals: Practical work and fieldwork as required by the content,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSE806",
    "Course": "Science and Technology in Society",
    "Description": "Aim: This module is for students to develop an understanding of the approach used and the skills required to critique,,develop and research Science and Technology in Society phenomena.,Content: Historical development of the STS approach;STS in different contexts; Critique of the STS approach; STS,approach and the South African curriculum; Research within the field of STS.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSJ101",
    "Course": "Diversity and Learning",
    "Description": "Aim: To develop an understanding of how the diversity of social groups are caught up in relations of inequality, and how,these impact on learning and education. To develop a sense of agency in working for equity within education and the,broader society.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSJ702",
    "Course": "Race Racism and Education",
    "Description": "Aim: The primary aim of the module is to develop educators who will have an understanding of race as a social construct,,who will understand racism as a form of oppression with effects at personal, institutional and societal levels, and who,will have resources to challenge racism in their spheres of influence, but particularly within education.,Content: Race and racism receive a great deal of attention, yet few courses in teacher education deal with these,questions in a systematic way. Using a social justice framework, this module focuses on theoretically informed ways of,addressing and developing an understanding of these issues, and links this understanding to questions of action and,questions of research.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSJ706",
    "Course": "Diversity and Education",
    "Description": "Aim: To promote a critical understanding of issues of diversity and the relationship of diversity to oppression in society,in South Africa. It aims to equip students with conceptual understandings of oppression related to one or more specific,forms of oppression. The forms of oppression that this module focuses on are sexism and heterosexism.,Content: The module focuses on conceptual understandings of gender, sexism and heterosexism. In addition, students,develop an understanding of sexism/heterosexism as complex, systemic, multi-faceted, and interconnected, and identify,specific issues in the research on sexism/heterosexism in education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSJ803",
    "Course": "Disability and Inclusion",
    "Description": "Aim: To provide students with insight into the politics of disability, including the various discourses debated in current,literature. The course will move beyond the welfare model to a social justice model which recognises the multiple voice,of peple with disabilities.,Content: Students will engage in critical reflection on issues of representation of disability and its articulation with gender,,sexuality, race, class and other categories of social difference. The complexities faced by school administrators, teachers,and parents in creating educational sytems that guarantee equality of opportunity and full participation will be explored.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSJ813",
    "Course": "Social Foundations Social Justice & Educ",
    "Description": "Aim: To extend the principles and practices of social justice and transformation to the arena of education through socio-,political critique.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSJ833",
    "Course": "Peace Education and Conflict Resolution",
    "Description": "Aim: The Peace Education and Conflict Resolution module aims to critically examine conditions of peace and conflict,within personal, organisational, country and global contexts. It further aims to develop knowledge, skills and values which,allow for creative and sustainable responses to conflict. The module attempts to develop an appreciation and in-depth,knowledge of the range and variety of approaches and skills of Peace Education and Conflict Resolution in terms of their,theoretical and real life underpinnings. Students are required to critically apply such knowledge and skills to human,relations in education and society, including a critical awareness of their own role as actors in a social context. Themodule is intended to strengthen the ability of educators to create an education system based on peace and justice.Content: Perspectives on peace education, Forms of peace education and conflict resolution, Peace educationpractices, curricula and pedagogy, Peace education through peace action, Conflict analysis, Developing conflictresolution programmes, Researching conflict, peace & peace education."
  },
  {
    "Institution": "UKZN",
    "Code": "EDSM702",
    "Course": "Curriculum Development in Science & Mathemati",
    "Description": "Aim: The purpose of this module is to provide educators with an understanding of the nature of curriculum, factors which,influence its development and the determinants of transformation and change.,Content: Students will engage with current curriculum policy documents with the aim of designing appropriate tasks in,science and mathematics while dealing with issues of diversity and promoting inclusivity in order to cater for the needs,of the complex and differentiated nature of South African society.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSM704",
    "Course": "Assessment in Science and Mathematics Education",
    "Description": "Aim: To introduce educators to assessment models and issues in science and mathematics education, with emphasis,on reflecting on current practice and developing new forms of assessment appropriate to the curriculum.,Content: This module focuses on assessment in science and mathematics teaching and learning contexts. Students,engage with models of assessment, rubrics, designing performance assessment tasks as integral components of the,learning process whilst promoting inclusivity in order to cater for the needs of the differentiated nature of South African,society.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSM707",
    "Course": "Teaching & Learning in Sc & Maths Ed I",
    "Description": "Aim: To introduce educators to current thinking about particular areas or activities used in teaching and learning in,,science and mathematics education. Emphasis will be on problematizing these areas and promoting critical reflection,,on current practice.,,Content: This module will cover learning theories within science/mathematics/computing education, motivation,,,reasoning and argumentation. It will also cover practical work within science/mathematics/computing education, project,,work within science/mathematics/education and pragmatism.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSP410",
    "Course": "Sports Science for Educators 410",
    "Description": "Aim: To provide students with understanding and knowledge of research in sport; environmental aspects influencing,,exercise and training and community recreation; practical and theoretical aspects of various movement activities; and,,,to assist students apply this understanding in developing and presenting programmes.,,Content: Research Methodology; and environmental aspects influencing exercise, training and community recreation; ,,,water activities, games and recreation.,,Practicals: 25,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSS201",
    "Course": "Social Science Education Method 1 SP",
    "Description": "Aim: The main aim of this module is to prepare Social Sciences student teachers in the intermediate and senior phases,,as part of their initial teaching qualification, to become competent in integrated and cross-disciplinary teaching methods,within an inclusive education framework. At the end of the module the students should have developed a sound,knowledge base and sound understanding of theoretical principles of history and be able to apply this specific knowledge,in context, taking cognisance of the needs of the learners, the diversity of learners and the diverse nature of the teaching,and learning contexts. To achieve this they would be guided towards professional competence informed by a sound,knowledge, skills and values base. The student teachers would furthermore be assisted in developing and presenting,programmes based on their individual teaching styles and philosophies.,Content: The core content topics for the module are: The philosophies, theories and methods underpinning Social,Sciences teaching and learning Teaching and learning for critical thinking in an integrated and cross-disciplinary,manner The relationship/s between history and geography Using sources/evidence to teach history in an integrated,and cross-disciplinary manner (for example documents, artefacts, visual media, ICT) Using sources/evidence to teach,geography in an integrated and cross-disciplinary manner (for example maps, GIS, visual media, fieldwork) Integrating,history and geography teaching and learning,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSS301",
    "Course": "Social Sciences Education Method 2 SP",
    "Description": "Aim: The main aim of this module is to prepare Social Sciences student teachers in the intermediate and senior phases,,as part of their initial teaching qualification, to become competent in engaging with the Social Sciences CAPS curriculum,document and related assessment criteria and to translate this into effective teaching and learning opportunities within,an inclusive education framework. At the end of the module students should have gained well rounded broad education,that equips the graduate with the knowledge base, theory and methodology of the discipline to enable them to,demonstrate initiative and responsibility in an academic and professional context, taking into consideration the needs of,the learners, the diversity of learners and the diverse teaching and learning contexts. The student teachers would,furthermore be assisted in developing and preserve programmes based on their individual teaching styles and,philosophies.,Content: The core content topics for the module are: The teacher of school History The learner of school History,The learning of school History The school History curriculum Teaching controversial issues in school History,Teaching school History to large classes in a disadvantaged school Assessment in History Developing a personalHistory teaching philosophy Campus based / practical teaching and learning by means of tutorials, peer observationand reflection Analysis and reflections on case studies within the context of history teaching and learning about and inthe context of southern AfricaPracticals: No practicals and fieldwork required"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSS601",
    "Course": "Social Sciences Teaching 601",
    "Description": "Aim: The main aim of this module is to prepare Social Science student teachers in the Senior Phase (Grades 7 – 9) to,become competent in Social Studies teaching as part of their initial teaching qualification; to introduce students to the,skills, attitudes and knowledge in teaching Social Science in an integrated manner; to introduce students; to Social,Science curriculum documents, assessment and pedagogy as it relates to teaching. The student teachers will,,furthermore be assisted in developing and presenting lessons based on their individual teaching styles and philosophies.,Content: Introduction to Social Science component of the National Curriculum document and its application,Assessment and Social Science Strategies to teach Social Science Stratagems of integrating History into Geography,and vice versa Effective classroom management Lesson planning and resources for teaching Social Science Use,of resources for a successful Social Science lesson Fundamentals of Social Science Knowledge of subject teaching,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDSS701",
    "Course": "Perspective in Social Sciences in Education",
    "Description": "Aim: The purpose of this module (compulsory for students doing the Social Sciences in Education Honours programme),is to provide perspectives in the Social Sciences in Education, focusing on disciplinarities and research methodologies,in multiple contexts in Africa and South Africa.,Content: The module content will include exploring contextually relevant topics from intra-disciplinary, inter-disciplinary,,multi- disciplinary and trans- disciplinary perspectives, and research design and methodologies in the Social Sciences,in Education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE201",
    "Course": "Technology Education Method 201",
    "Description": "Aim: To prepare prospective Technology educators, as part of their initial teaching qualification, to become competent,and confident in the teaching methods of Technology Education. To achieve this, they will be guided towards professional,competence informed by a sound skill and value base. The prospective technology educator would furthermore be,assisted in developing and presenting a learning programme based on the models discussed in the literature.,Content: Develop the students understanding of why Technology should be taught. Present various definitions of,Technology Education. Critically engage with curriculum changes in South Africa. Explore possible ways to develop a,Technology programme. Reinforce the role of the “Design Process” in Technology teaching. Explore the key content and,specific aims of CAPS. Demonstrate types of assessment that can be used in Technology Education. Develop useful,Assessment tools for Technology. Explore ideas for setting up a Technology room in a range of schools. Critical analysis,of three theoretical models of learning and how they can be adapted for the technology class.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE211",
    "Course": "Science and Technology Education 2",
    "Description": "Aim: To further extend students knowledge of the content and processes with regard to Natural Science and Technology,,related to Energy and Change and Earth and Beyond in order to build a sound knowledge base and understanding of,,theoretical principles. To enable students to develop the competence to apply their knowledge base in relevant contexts.,,Content: Earth, Moon and Sun systems (day and night; eclipses; seasons) Surface of the earth- rocks and soils,,Fossils, with special reference to South African fossils Energy: heat and sound Electricity-illegal connection (STS),,Systems and control – electrical systems, electronic components Food processing Clay processing Sedimentary,,rock processing,,Practicals: Students must complete 75% of practical work and/or fieldwork to relevant industries or science centres as,,appropriate,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE220",
    "Course": "Technology Education 220",
    "Description": "Aim: To introduce students to the basic knowledge and skills needed to process common materials and produce,,functional products of clay, paper, woods, metals, plastics, textiles and composite materials. This will include exposure,,to laboratory safety, use of hand tools, operation of machines, and teaching strategies. Students will be provided with,,laboratory experiences in materials 201 testing and construction of multi-material projects.,,Content: Modern computer numeric control (CNC) milling and lathe machines, vacuum forming and bending, pressure,,forming and blow molding of plastic materials; contemporary and historical examples of the art and craft of ceramics;,,designing ceramic forms and expressing individual ideas through the medium of clay.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE312",
    "Course": "Science & Technology Education Method 2",
    "Description": "Aim: To introduce students who wish to specialise in Science and Technology to the relationship between Science and,,Technology with the view of integrating these two disciplines in their teaching. To introduce students to teaching,,approaches which are particular to Natural Science and Technology; to develop students competences in lesson,,planning and presentation with emphasis on assessment; to develop competence in the use of resources in science and,,technology learning. Furthermore a fundamental aspect of this module is to educate students to reflect meaningfully on,,their Professional Practice experience,,Content: Specific aims of the Natural Science curriculum Specific aims of the Technology curriculum Integration of,,the aims of both disciplines in lesson planning Appropriate teaching strategies in Science and Technology Resource-,,based learning Assessment Reflections on professional practice,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE314",
    "Course": "Science & Technology Education Method 1",
    "Description": "Aim: To further extend students knowledge of strategies for teaching Natural Sciences and Technology with a focus on,,teaching large classes, co-operative learning strategies, and inquiry based learning. It will also develop the students,,ability to plan learning programmes on selected topics within the discipline, which are informed by relevant science and,,technology education research, and include appropriate assessment strategies. This will provide the students with a,,well-rounded, broad education in these disciplines that will equip them with the knowledge base, theories and,,methodologies required to demonstrate initiative and responsibility in an academic and professional context within an,,inclusive education framework.,,Content: Inquiry based learning Cooperative learning Teaching large classes in Science and Technology Learning,,Programmes Assessment Reflection on professional practice,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE601",
    "Course": "Technology Teaching 601",
    "Description": "Aim: The main aim of this module is to introduce and engage students who wish to specialise in Technology teaching,,in the Senior Phase (grades 7 – 9) to the nature and history of Technology education, principles of the national curriculum,,document in terms of knowledge, skills, values and attitudes required to teach and assess Technology. To develop,,competence in teaching Technology in the Senior Phase.,,Content:Teaching and learning TechnologyPrinciples of the National Curriculum Documents for Technology teaching,,and assessmentThe nature and history of Technology and Technology EducationCampus-based practical learning,,through peer teaching, peer observation and reflectionBasic planning of learning programmeAssessing Technology,,in the following areas: Technological process, Graphical communication, StructuresAnalysis and reflection on case,,studies within Technology EducationLearning about diverse school and Technology classroom contextManagement,,and safety in the Technology classroom/workshopCampus-based peer teaching, peer observation and reflection.,,Practicals: A number of practical investigations and projects based on the school curriculum are required for this module,,in the Technology laboratories.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE701",
    "Course": "Curriculum Devel in Technology Education",
    "Description": "Aim: The purpose of this module is to provide students with a critical understanding of the principles and debates, which,characterize the inclusion of Technology Education in the South African curriculum - and its increasing inclusion in the,general education curricula of other countries.,Content: Critical review of historical developments in this field; The relationship between Technology Education,,Technical Education and Science Education; The vocational / academic debate; The nature of Technology Education,curricula in selected countries.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTE703",
    "Course": "Indigenous Science and Technology",
    "Description": "Aim: This module explores issues associated with Indigenous Knowledge Systems (IKS), with particular reference to,Science and Technology (S&T). Furthermore, the module explores the implications of the inclusion of IKS in the,curriculum for sustainable development, capacity building and intellectual development of S&T in Africa in the 21st,century.,Content: Content topics includes: Medicine and African Traditional Medicine (ATM), Mathematics, Agricultural Science,- Food Processing & Storage and Textile technology, Metallurgy, Building Technology (architecture and engineering),,Astronomy and Navigation. This module explores issues associated with Indigenous Knowledge Systems (IKS), with,particular reference to Science and Technology (S&T). Furthermore, the module explores the implications of the inclusion,of IKS in the curriculum for sustainable development, capacity building and intellectual development of S&T in Africa in,the 21st century.,Practicals: Field trip: visiting a nursery that focuses on indigenous plants.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTP121",
    "Course": "Teaching Practice 1",
    "Description": "Aim: The aim of the module is to introduce students to the different contexts of teaching in KwaZulu-Natal.,,Content: Introduction to different contextual teaching of different schools via case studies – through and exploratory,,framework focusing on learning context. Technologies in teaching and the preparing and presenting in small groups,,through Classroom technologies and Micro teaching.,,Practicals: Preparing and teaching for different contexts.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTP221",
    "Course": "Teaching Practice 2",
    "Description": "Aim: The aim of the module is to develop in students a sound knowledge and understanding of the nature of teaching,and learning in an authentic school environment, using theories and principles of teaching and learning within a socially,diverse and inclusive South African education system,Content:On site teaching practice – planning and teaching of lessons across all teaching subject specialisation,,applying generic teaching methods in their teaching of lessonsDevelop and appreciation and an understanding of the,school and professional policies relating to schooling, teaching and learning, and the teaching professionObserve,classroom and school management processes and practices during the school based teaching practice sessionDeveloping an understanding of being a professional teacher.,Practicals: Placement at a school of the students choice in consultation with the teaching practice coordinator, for a,continues period of 4 weeks in school following by alternative teaching practice to be delivered in online or contact,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTP321",
    "Course": "Teaching Practice 3",
    "Description": "Aim: To develop students competence in teaching their respective teaching subject specialisations within an authentic,,,school context, using their subject content knowledge, the knowledge of the CAPS curriculum and the theories and,,,principles of teaching, learning and assessment.,,,Content: On site teaching practice – planning and teaching of lessons across all teaching subject specialisation,,,,applying appropriate pedagogical content knowledge in their teaching of lessons Work within the school and,,,professional policies relating to schooling, teaching and learning and the teaching profession Implement classroom and,,,school management processes and practices during the school based teaching practice session Developing,,,professional ethics as a teacher,,,Practicals: Placement at a school consultation with the teaching practice coordinator, for a continuous period of 4 weeks,,,in school. Practical assessments through presentations and submissions. (equivalent to approximately 4 weeks).,,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTP430",
    "Course": "Teaching Practice 4",
    "Description": "Aim: The aim of the module is to further develop students competence in teaching their respective teaching subject,specialisations within an authentic school context, using their subject content knowledge, the knowledge of the CAPS,curriculum as it relates to their teaching subjects and the theories and principles of teaching, learning and assessment.,In addition, the module intends to develop in students a teacher professional identity.,Content:On site teaching practice – planning and teaching of lessons across all teaching subject specialisation,,applying appropriate pedagogical content knowledge in their teaching of lessonsWork within the school and,professional policies relating to schooling, teaching and learning and the teaching professionImplement classroom and,school management processes and practices during the school based teaching practice sessionDeveloping,competence in being a teacher with full school responsibilities,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTP612",
    "Course": "School Experience 602",
    "Description": "Aim: The main aim of this module is to further develop students as professionals-in-training for teaching their respective,teaching subject specialisations in a school as a workplace setting. It provides opportunities for development of beginner,teacher competence through integrative learning that links theoretical knowledge with workplace (school) practices . In,addition, the module intends to develop in a student a teacher professional identity.,Content: School-based component will expose students to:Teaching practice in a schoolPlanning and presenting a,sequence of coherent lessons in respective teaching subject specialisationsCritical analysis of a school as an education,organisationEngagement in assessment practicesSchool and professional policies related to schooling, teaching,,learning and managementClassroom and school management processes and practicesDeveloping as a classroom,leaderDeveloping competence in being a professional ethical teacher with full school responsibilitiesDeveloping a,teacher identity in relation to personal teaching philosophy,Practicals: Placement at a school, in consultation with the Teaching Practice co-ordinator, for a continuous block period,for 6 weeks in the second academic semester (equivalent to 30 teaching days).,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTT210",
    "Course": "Travel and Tourism Education 210",
    "Description": "Aim: To provide students with an understanding of the nature of travel & tourism and travel & tourism management,within the socio-economic and political context of South Africa.,Content: Tourism Theory; Tourism: Know your own country; Hospitality: An introduction; Structures and operations,within the tourism industry.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTT301",
    "Course": "Travel and Tourism Education Method 2",
    "Description": "Aim: Module is aimed at developing teaching skills and pedagogical approaches to teaching tourism. It also aimed at,exploring various assessment strategies in tourism education.,Content: Teaching strategies for tourism. Assessment in tourism education. Developing assessment tasks for tourism.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTT320",
    "Course": "Travel and Tourism Education 320",
    "Description": "Aim: To develop knowledge of hotel management and related industries and the concept of environmental responsibility,in tourism.,Content: Accommodation sector and market segments; Technology : Communications in tourism; Eco-tourism : An,Introduction (Case Studies); Africa: tourism trends.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTT410",
    "Course": "Travel and Tourism Education 410",
    "Description": "Aim: To develop basic knowledge of marketing principles in travel and tourism, global trends in tourism and calculations,needs for international travel.,Content: Marketing and advertising in the tourism industry; Public Relations and the Media; International trends in travel,and tourism; Basic calculations; foreign exchange and time zones.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTT601",
    "Course": "Tourism Teaching 601",
    "Description": "Aim: To develop students integrated and applied knowledge of curriculum, pedagogy and assessment as it relates to,,teaching the subject Tourism in the Further Education and Training Teaching phase (grades 10 to 12). To develop,,competence in teaching Tourism in the FET phase.,,Content: The content of this module includes:Teaching and learning theories for teaching TourismPlanning of lessons,,and resources for teaching TourismUnderstanding and interpretation of Tourism National Curriculum documents,Issues and trends in Tourism teaching and learningThe selection, sequencing and pacing in Tourism teaching as per,,National Curriculum documentsCampus-based peer teaching, peer observation and reflectionsIssues and debates in,,Tourism education, learning about context (diversity, inclusivity, socio-economic factors, HIV/Aids)The use of innovative,,instructional strategies for teaching Tourism,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDTT701",
    "Course": "Travel and Tourism",
    "Description": "Aim: To provide students with an understanding of the nature of travel & tourism and tourism management within the,socio-economic, cultural & political context of Southern African and the regional context.,Content: Tourism organisation and development; careers in tourism; transport and accommodation sector; tourist,destinations: national and regional; South African History and Culture and Arts.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU110",
    "Course": "Communication in isiZulu 110",
    "Description": "Aim: To provide students with opportunities to attain skills that contribute to effective communication, negotiation and,managing conflict.,Content: The communication process; functions of communication; language and communication; listening; township,music: kwaito; culture.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU120",
    "Course": "Communication in isiZulu 120",
    "Description": "Aim: To encourage students to engage in discussions, sharing of ideas, opinions and information ; to ensure students,apply their knowledge successfully and effectively in varied contexts ; to help students develop an interest in and,appreciation of isiZulu language and its traditional literature.,Content: Interpersonal communication ; communication and perception ; non-verbal communication ; developing oral,skills ; effective communication ; media ; language attitudes ; essay and short story writing; traditional music : Maskandi,& Isicathamiya; literature : short stories and one act plays; culture,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU130",
    "Course": "Intergrated isiZulu and Literacy Studies",
    "Description": "Aim: To equip course participants with sound knowledge base of integrated isiZulu language and literacy, and sound,understanding of theoretical principles of language and literacy development for diverse learners; to enable them to,apply this integrated isiZulu language and literacy knowledge in mono- and multi-cultural contexts; for example, young,,adult, second language and first language speakers and in varying contexts such as mono- and multi-cultural contexts.,Students will also be exposed to relevant theories such as the socio-cultural theory, critical theory, etc.,Content: Debates and discourses about isiZulu language and literacy: social literacies, dialogic language, multi-,literacies, etc. IsiZulu literacy as social practice rather than technical skills. IsiZulu literacy development: young and adultlearners: theory and practice (e.g. socio-cultural theory). Literacy development in multilingual contexts IsiZulu academicliteracy development. IsiZulu critical language awareness. IsiZulu Foreign language (ZFL) classrooms. IsiZulu languageand literacy development for learners with special needs. IsiZulu language and literacy development and assessmentapproaches: implications for educational settings."
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU132",
    "Course": "IsiZulu Lang AcquisitionLearn & Teach (FAL)",
    "Description": "Aim: To develop in student teachers sound knowledge base and sound understanding of theoretical principles of isiZulu,teaching and learning concepts and the principles of current school curriculum documents to enable them to demonstrate,the ability to apply this knowledge base in the isiZulu classroom (in the intermediate, senior and FET phases); and,interpreting the learning outcomes; approaches to the teaching of listening and speaking in isiZulu.,Content: Becoming an ideal isiZulu teacher. IsiZulu language acquisition (first, second and foreign). Theories and,strategies of language learning. Approaches to isiZulu language teaching and learning (e.g. learner-centred,,communicative and text-based approaches). Approaches to the teaching of listening and speaking. Policies and isiZulu,language curriculum documents. Lesson planning and preparation. Assessment strategies for listening and speaking,skills in the classroom.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU134",
    "Course": "IsiZulu for Communication & Lang. usage in Ed",
    "Description": "Aim: -To promote the acquisition and continued pursuit of a communicative ability in isiZulu. -To provide students with,the repertoire of common isiZulu expressions that may be used spontaneously in conversation with isiZulu speakers.,Content: -Starting a conversation (weather); personal information (relations, body, etc.). -Vocabulary and language use,in various contexts, and contextualised within particular themes. -Situations (themes) for using isiZulu language: at home;,at the university; at school; at the court; at the bank, at the hospital, and other situations. -Basic phonetic, phonological,and morphological skills. -Language structures related to the selected themes or particular situations: for example,nouns, verbs, concords, tenses, adjectives, adverbs, etc. -Language usage related to the selected themes or particularsituations: sentence construction, interrogatives, polite conventions, etc."
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU210",
    "Course": "isiZulu (mother tongue) 210",
    "Description": "Aim: To provide students with useful language skills for both personal and social development and to ensure that,students apply their knowledge successfully and effectively in the classroom with appreciation of the value of their cultural,heritage.,Content: Phonetics and phonology I ; literary theory; short stories and essays.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU215",
    "Course": "IsiZulu Education Method 1 for Inter Phase HL",
    "Description": "Aim: To develop in student teachers sound knowledge base and sound understanding of theoretical principles of isiZulu,teaching and learning concepts and the principles of current school curriculum documents to enable them to demonstrate,the ability to apply this knowledge base in the isiZulu classroom (in the intermediate, senior and FET phases); and,interpreting the learning outcomes; approaches to the teaching of listening and speaking in isiZulu.,Content: Becoming an ideal isiZulu teacher. IsiZulu language acquisition (first, second and foreign). Theories and,strategies of language learning. Approaches to isiZulu language teaching and learning (e.g. learner-centred,,communicative and text-based approaches). Approaches to the teaching of listening and speaking. Policies and isiZululanguage curriculum documents. Lesson planning and preparation. Assessment strategies for listening and speakingskills in the classroom."
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU217",
    "Course": "IsiZulu Education Method 1",
    "Description": "Aim: To develop in student teachers sound knowledge base and sound understanding of theoretical principles of isiZulu,teaching and learning concepts and the principles of current school curriculum documents to enable them to demonstrate,the ability to apply this knowledge base in the isiZulu classroom (in the senior and FET phases); and interpreting the,learning outcomes; approaches to the teaching of listening and speaking in isiZulu.,Content: Becoming an ideal isiZulu teacher. IsiZulu language acquisition (first, second and foreign). Theories and,strategies of language learning. Approaches to isiZulu language teaching and learning (e.g. learner-centred,,communicative and text-based approaches). Approaches to the teaching of listening and speaking. Policies and isiZulu,language curriculum documents. Lesson planning and preparation. Assessment strategies for listening and speaking,skills in the classroom.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU301",
    "Course": "isiZulu (mother tongue) Method 2",
    "Description": "Aim: To prepare students to meet the challenges of teaching isiZulu NMT. Emphasis will be on the teaching and,assessment of reading; applying the principles involved in teaching reading to the Language Literacy and,Communication outcomes.,Content: The teaching of reading; literature, reading for academic purposes; comprehension skills-précis, summary,,notes abstracts; assessment of reading skills; teaching of media and the teaching of materials development.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU311",
    "Course": "isiZulu Education 5",
    "Description": "Aim: To develop a well-rounded broad education that equips the graduate with the knowledge base and theory of the,sociolinguistic aspect and language usage of the IsiZulu language and the historical development of the language, the,language varieties and dialects to demonstrate initiative and responsibility in an academic and professional context on,IsiZulu Language usage and culture.,Content: IsiZulu history and development. IsiZulu varieties, dialects, values. Language planning and policy issues and,IsiZulu language. Language society and culture; Class and language usage; the royal family and their use of language,IsiZulu language and culture; how cultural values manifest in the language e.g. in proverbs and in idiomatic expressions.,Gender, age and language usage,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU314",
    "Course": "IsiZulu Education 4",
    "Description": "Aim: To develop in course participants the ability to sensitively read and to critically analyse seemingly ‘simple texts,,and to develop critical appreciation of the work of a range of authors of childrens isiZulu literature through the,examination of works from different historical and socio-cultural backgrounds as well as different literally genres,,including media texts.,Content: Reading various genres and visual literacy. Insight development into reading and viewing through books and,media texts. Story construction and telling. Reading strategies for children. Stories and legends of indigenous people of,Africa and South Africa. Evaluating childrens isiZulu literary and non-literary texts. Integrating isiZulu media in education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU316",
    "Course": "IsiZulu Education 3",
    "Description": "Aim: To develop in pre-service student teachers the ability to read and use literary theory to critically analyse texts, and,to develop critical appreciation of the work of a range of authors and film-makers of isiZulu film, poetry and drama through,the examination of works from different historical and socio-cultural backgrounds.,Content: Understanding poetry, film study and drama Understanding traditional literature such as folk songs, praise,poetry, lullabies, clan praises, etc. Literary theory integrated with film study, poetry, folklore, and drama. Developing,insights into reading and viewing (film, poetry, folklore, and drama) Discussions on construction of film, poetry, folk songs,,lullabies, clan praises, praise poetry, and drama. Discussions based on the selected works of different authors / film,makers,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU320",
    "Course": "isiZulu (mother tongue) 320",
    "Description": "Aim: To provide students with useful language skills for both personal and social development and to ensure that,students apply their knowledge successfully and effectively in the classroom with appreciation of the value of their cultural,heritage.,Content: Morphology; drama; media,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU410",
    "Course": "isiZulu (mother tongue) 410",
    "Description": "Aim: To provide students with useful language skills for both personal and social development and to ensure that,,students apply their knowledge successfully and effectively in the classroom with appreciation of their cultural heritage.,,Content: Syntax and semantics; traditional prose; introduction to research.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU413",
    "Course": "IsiZulu Education Method 3 for SP",
    "Description": "Aim: To develop a well-rounded broad education that equips the graduate with knowledge base and theory of isiZulu,language with a focus on isiZulu poetry, drama and film studies, to enable them to demonstrate initiative and,responsibility in an academic and professional context to meet the challenges of teaching the writing and presentation,skills with a focus on isiZulu poetry (modern, and traditional such as folk songs praise poetry), drama and film studies.,Emphasis will be on the teaching and assessment of writing and presentation applying the principles involved in teaching,writing and presentation according to the prevailing school CAPS curriculum documents and within an inclusive,education framework.,Content: Theoretical approaches to writing. Teaching writing and presentation skills in isiZulu language. Using isiZulu,texts in teaching the language structure and conventions, and the writing process (brainstorming, multiple drafting,,editing and proofreading strategies). Teaching of analytical and interpretation skills of various texts (e.g. drama, poetry,,film). Assessment strategies for isiZulu poetry, writing, and presentation skills."
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU601",
    "Course": "IsiZulu Home Language Teaching 601",
    "Description": "Aim: The aim of this module is to prepare students to teach language skills (listening, speaking, reading, writing and,viewing) and presentation skills with a focus on isiZulu as a Home Language in the national school curriculum. The,module includes the teaching of various texts (traditional and modern isiZulu literature including novel, short stories,,essay, drama and film studies). Emphasis will be on the teaching and assessment of language and presentation skills,and applying the relevant principles according to the prevailing school curriculum documents and pedagogy. To develop,competent teachers of IsiZulu as a Home Language in both the Senior Phase and FET phase.,Content:Teaching isiZulu as a Home Language: Understanding and responding to the South African landscapeBecoming a teacher of isiZulu as a Home languageInterrogating documents: National Curriculum Documents and,National Education Teacher FrameworkLesson planning and preparationMicro teaching, peer observation and,reflectionAnalysis and reflections on case studies within the context of teaching isiZulu in South African classroomsLanguage Learning approaches – relevant to SA classroomsHome language acquisition theoriesTheoretical,approaches to reading and writing; listening and speakingTeaching writing and presentation skills in isiZulu languageUsing isiZulu texts in teaching the language structure and conventions, and the writing process (brainstorming, multiple,drafting, editing and proofreading strategies)Introducing students to multilingualism in the South African context.,"
  },
  {
    "Institution": "UKZN",
    "Code": "EDZU609",
    "Course": "IsiZulu Fist Additional Language Teaching 601",
    "Description": "Aim: The aim of this module is to prepare students to teach language skills (listening, speaking, reading, writing and,viewing) and presentation skills with a focus on isiZulu as a First Additional Language in the national school curriculum.,The module includes the teaching of various texts (novel, short stories, essay, drama and film studies). Emphasis will,be on the teaching and assessment of language and presentation skills and applying the relevant principles according,to the prevailing school curriculum documents, school curriculum and pedagogy. To develop competent teachers of,IsiZulu as a First Additional Language in both the Senior Phase and FET phase.,Content: 12. What is the content of this module?Micro teaching, peer observation and reflection.Teaching isiZulu,First Additional Language: Understanding and responding to the South African landscapeBecoming a teacher of isiZulu,First Additional languageInterrogating documents: National Curriculum Documents National Education Teacher,Framework; curriculum and language policyLesson planning and preparationFirst Additional (Second) Language,acquisition theoriesTheoretical approaches to reading and writing; listening and speaking.First Additional (Second),Language Learning approaches that are relevant to SA classroomsTeaching comprehension skillsTeaching writing,and presentation skills in isiZulu language.Using isiZulu texts in teaching the language structure and conventions, and,the writing process (brainstorming, multiple drafting, editing and proofreading strategies).Introducing students to,multilingualism in the South African context.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ENGL705",
    "Course": "Mediating South African Identities 1",
    "Description": "Aim: This module investigates some of the ways in which South African identities have been mediated, both historically,and in the present. It engages with theoretical debates about definitions of 'the popular', 'the literary', 'mass culture', and,so on.,Content: A range of materials including fiction and autobiography by leading South African writers, journalism, film, oral,performance and the built/natural environments.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ETHS311",
    "Course": "Ethics of Literature Media",
    "Description": "Aim: The course aims to explore the complex relationship between literature and Ethics as well as Media and ethics,,concentrating on ethics as a tool for analyzing role of literature and media in moral education.,Content: Module content include: The moral connections of literary texts, Ethical criticism of literature, and the writer,and readers duty and responsibility, Approaches to media Ethics, Media harm and offense, Sex and violence in the,media, The Ethics of Reality TV, Censorship and the Media.,"
  },
  {
    "Institution": "UKZN",
    "Code": "FREN311",
    "Course": "Advanced French Language I",
    "Description": "Aim: This module aims to deepen the students knowledge of the French language by using a taskbased approach.,Student will continue to develop their communicative skills in French.,Content: More advanced authentic written and oral documents, advanced grammatical structures and vocabulary.,"
  },
  {
    "Institution": "UKZN",
    "Code": "FREN313",
    "Course": "Advanced French Language II",
    "Description": "Aim: This module aims to deepen the students knowledge of the French language by using a task based approach. In,addition to the B1 level of the CEFRL, students will be prepared towards the B2 level of the CEFRL.,Content: More advanced authentic written and oral documents, advanced grammatical structures and vocabulary.,"
  },
  {
    "Institution": "UKZN",
    "Code": "HIST701",
    "Course": "African States in Comparative Perspective",
    "Description": "Aim: To provide a historical understanding of predicaments faced by contemporary African states and South Africa inparticular.Content: Political commentators frequently refer to African states as ~failures~. This module investigates the Africanstate through historical and comparative analysis. After interrogating the notion of “state failure”, we explore the historyof state-society relations in Africa. Are contemporary state formations in Africa legacies of the colonial period or do theirorigins rest with Africas pre-colonial polities? Comparisons will be made with former colonies in South Asia and LatinAmerica. The central focus will be to situate the South African experience."
  },
  {
    "Institution": "UKZN",
    "Code": "LIIS642",
    "Course": "Records Management",
    "Description": "Aim: Understanding of basic principles of records and documents management in the administration of information,systems. To demostrate knowledge of records management and how to apply such knowledge in development and,management of records system.,Content: Information and records management, terminology, concepts evolution,trends, records manager/archivist,paradigm. Setting up records management programmes, strategic management of records and document in archives,and offices. Appraisal, disposition, disaster planning and control.,Practicals: 10 x 1hr,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS102",
    "Course": "Introduction to Media Studies",
    "Description": "Aim: To familiarise first level students with some of the basic subject matter, concepts, approaches to the study of,culture, media and communication.,Content: Introduction to the study of media forms (such as print, photography, film, television and radio) and key,concepts in the field, including semiotics, mediation, and representation.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS202",
    "Course": "Introduction to Cultural Studies",
    "Description": "Aim: To introduce students to the basic conceptual tools for the study of culture in contemporary society, and to provide,the foundation module for the cultural studies strand within Media and Cultural Studies.,Content: In keeping with the diverse nature of ‘cultural studies, this course will address a number of inter-related areasof critical theory (ideology and discourse, identity); story-telling, myth, narrative and genre; and popular culture (music,television, advertising)."
  },
  {
    "Institution": "UKZN",
    "Code": "MECS212",
    "Course": "Public Relations",
    "Description": "Aim: To introduce Public Relations as an integral element of Corporate Communication and reputation management.,Content: An introduction to public relations as corporate communication and an exploration of issues such as PR,strategies and tools, as well as cultural diversity and ethics in PR.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS301",
    "Course": "Advanced Cultural Studies",
    "Description": "Aim: To develop an understanding of a range of methodologies and key topics in contemporary cultural studies at an,advanced level.,Content: The course covers a selection historical and contemporary approaches to the study of culture and society such,as literary, sociological, political economic, culturalist and anthropological. It also considers more general disciplinary,questions such as the indigenisation, appropriation and application of cultural studies globally into South Africa and the,effect the emergence of new media is having on the discipline. This module is strongly recommended for students who,hope to proceed to graduate study in CCMS.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS311",
    "Course": "Writing for the Media",
    "Description": "Aim: To provide students with the skills needed for writing in a range of media.,Content: The course will cover a selection from the full range of media such as: news; feature and editorial writing;,advertisement construction and copywriting; and on-line communication.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS321",
    "Course": "New Media Studies",
    "Description": "Aim: To provide students with an overview of the theoretical, technological and socio-economic dimensions of the fast-,changing, globalised - ‘new media - landscape.,Content: The course will cover the theoretical tools through which to make sense of the changing media environment,,in areas such as the Internet and digital telecommunications and broadcasting. Empirical case studies from home and,abroad will be used to illustrate the theoretical propositions.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS701",
    "Course": "Advanced Television Studies",
    "Description": "Aim: Co-taught by the Department of Media and Cultural Studies and the Audio -Visual Unit of UKZN, Advanced,Television Studies aims to combine theory and practice,introducing students to television/vidoe production within the,context of critical reflection and analysis.,Content: The course gives students practical hands-on experience with equipment and processes of live and field,produced video enabling them to complete a short group project. The practical aspect is informed by discussion around,key concepts and current debates in Television Studies,focusing on both factual and fictional programming as well as,new content platforms.,Practicals: University Audio-Visual Unit supervised field work related to shooting vidoe for group projects.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS703",
    "Course": "Media and Warfare",
    "Description": "Aim: To provide an understanding of key concepts and debates in the multidisciplinary field of warfare and media.,Content: The course introduces key issues in this relatively new field of study via an initial focus on the pre-,television/computer age of so- called traditional warfare. The dynamic relationship betwen warfare and media is futher,explored in the focus on more contemporary war and communications, with specific reference to the development of,new paradigms and theories.,Practicals: None,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS705",
    "Course": "Digital Design for the New Media",
    "Description": "Aim: Design, publishing and use of New Media, including web and print. Including Information Age, political and,economic and corporate concerns on the Internet, online activism and cyberculture. Use of rich-media and multimediapublishing, including theory, tools and techniques.Content: Design and typography, Colour and space, introduction to software tools and methods, working with text, stylesheets, layout techniques in multiple media, text and graphic effects, new media production process, presentation ofassignments / or more on design and field trip to a new media house (if possible) /or session available to cover otherareas of design.Practicals: Designing brochure and/or website; writing a brief for design work."
  },
  {
    "Institution": "UKZN",
    "Code": "MECS708",
    "Course": "Strategic Corporate Communication",
    "Description": "Aim: The module equips learners with with an understanding of corporate communication and the way it can be,strategically applied in the private and public sectors.,Content: Content will be selected from a range of specialized areas such as advertising (including campaign,construction), brand communication, political communication and corporate social responsibility.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MECS710",
    "Course": "Advanced Video Production",
    "Description": "Aim: Builds on the skills and understanding already learnt in the basic course (MECS709), with emphasis placed on,more technical and aesthetic theory, field production and longer works. Students will learn advanced techniques in,scripting, audio and post production. The module will further emphasize the constraints of planning and budget in video,production.,Content: Advanced video production from scripting through production to presentation in DVD format."
  },
  {
    "Institution": "UKZN",
    "Code": "MECS750",
    "Course": "Introduction to Documentary Video",
    "Description": "Aim: To introduce students to the theory and practice of documentary video as an example of digital video production.,Content: This module will combine seminars on the theory of documentary with a practical introduction to video,production. Each student will be expected to produce a short documentary for assessment.,Practicals: 72 hours of practical instruction plus 6 hours of viewing.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC1A1",
    "Course": "Aural Perception 1A",
    "Description": "Aim: To increase facility in perceiving, identifying and naming aspects of pitch and duration.,Content: Identifying and singing intervals within the octave and triads in all inversions, melodic and rhythmic dictation.Comprehensive revision of material covered in Basic Aural Perception A/B."
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC102",
    "Course": "Foundational Practical Studies B",
    "Description": "Aim: Foundational Practical Studies B provides continued basic/beginner training for instrumental and vocal performers.,The module helps students to develop basic instrumental/vocal/dancing fluency; to read basic musical notation fluently;,to develop a working knowledge of basic instrumental/vocal repertoire; to develop basic skills in performing in musical,groups.,Content: Beginner instrumental/vocal technique, beginner strategies for effective practice, beginner exercises in,notational reading fluency, varied beginner instrumental/vocal repertoire, beginner ensemble technique and practice.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC104",
    "Course": "Foundational Performance Skills B",
    "Description": "Aim: The aim of Foundational Performance Skills B is to continue providing a basic introduction to students of the,practical skills they require to become professional practicing musicians.,Content: Beginner skills in improvisation, arrangement, accompanying, keyboard skills or diction and foreign languages;,beginner skills in public performance; beginner concert management, performance etiquette and performance,programme planning; beginner performance critique, reflection and research.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC106",
    "Course": "Introduction to Music Fundamentals B",
    "Description": "Aim: The module trains students to achieve proficiency in five competencies while relating them to diverse contexts:,conventions of pitch organisation; measuring complex musical intervals; conventions in basic musical harmonisation;,conventions in notating complex musical rhythms and metres; and conventions in musical performance directions.,Content: Scales/modes; complex intervals; triads/quartads; conventions of harmonisation; mixed metres; complex,rhythmic patterns and syncopation; performance directions.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC108",
    "Course": "Intro to Academic English and Literature B",
    "Description": "Aim: Introduction to Academic Literacy in Music B equips students with skills in academic reading and comprehension;,learning and writing; working with academic sources; and academic argumentation.,Content: Introduction to academic reading; identifying keywords in a reading passage; writing summaries using,keywords; taking notes using keywords; writing effective paragraphs; how to work with academic sources; how to create,academic arguments; proof reading your work.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC111",
    "Course": "Music and Society 1",
    "Description": "Aim: Music and Society 1 provides students with an overview of the music of Africa, exposing students to the diversity,of musical styles, forms, elements and cultural trends, and to the roles of music and musicians in different regions.,Content: Introduction to music, culture and history and to the elements of music; music of Sub-Saharan Africa; African,instruments; music as tradition; music in society; introduction to jazz.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC114",
    "Course": "Performance Skills 1",
    "Description": "Aim: The aim of Performance Skills 1 is to introduce students to the practical skills they require to become professional,practicing musicians. Depending on the instrumental or vocal specialisation, the module includes components such as,introductory skills in improvisation/arrangement, accompanying, diction and foreign languages, programme planning,,performance etiquette, recital management and organisation, and writing skills.,Content: Basic skills in improvisation, arrangement, accompanying, keyboard skills or diction and foreign languages;,basic skills in public performance; introduction to concert management, performance etiquette and performance,programme planning; introduction to performance critique, reflection and research.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC118",
    "Course": "Practical Studies 1B",
    "Description": "Aim: Practical Studies 1B continues to provide preliminary training for instrumental and vocal performers. The module,helps students to develop instrumental/vocal fluency; to understand the full capabilities of the instrument/voice; to read,musical notation fluently; to develop a broad knowledge of local and international instrumental/vocal repertoire; to,develop skills in performing in musical groups.,Content: Instrumental/vocal technique (dance technique for the study of African music), strategies for effective practice,,exercises in notational reading fluency, varied instrumental/vocal repertoire, ensemble technique and practice.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC212",
    "Course": "Music and Society 2B",
    "Description": "Aim: Music and Society 2B presents a balanced representation of musical traditions and cultures of the world. It focuses,on detailed discussions and analyses, including the study of conceptual issues, of specific music traditions and of set,works.,Content: Modern jazz; South African orchestral music; Isicathamiya choral traditions; popular music as social discourse;The Rock Hero: The Music of Queen; Stravinskys Rite of Spring."
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC216",
    "Course": "Music Theory and Perception 2B",
    "Description": "Aim: There are two different streams within this module (western and jazz). In both the students will be equipped with,an understanding of key terms, concepts and symbols, general principles of harmonic usage, rules of voice leading, and,methods of analysis,Content: Western classical specialization: The resources of chromatic harmony; motivic and formal analysis. Jazz,specialization: Modal harmony and melody writing; voice leading; use of inversions, pedal point and ostinato; incomplete,hybrid and constant structures; reharmonization.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC220",
    "Course": "Performance Skills 2B",
    "Description": "Aim: The aim of Performance Skills 2B is to expose students to the practical skills they require to become professional,practicing musicians. Depending on the instrumental or vocal specialisation, the module includes components such as,intermediate skills in improvisation/arrangement, accompanying, diction and foreign languages, programme planning,,performance etiquette, recital management and organisation, and writing skills.,Content: Intermediate skills in improvisation, arrangement, accompanying, keyboard skills or diction and foreign,languages; intermediate skills in public performance; concert management, performance etiquette and performance,programme planning; performance critique, reflection and research.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC224",
    "Course": "Practicals Studies 2B",
    "Description": "Aim: Practical Studies 2B provides intermediate training for instrumental and vocal performers. The module helps,students to develop further instrumental/vocal fluency; to understand the full capabilities of the instrument/voice; to read,musical notation fluently; to further develop a broadening knowledge of local and international instrumental/vocal,repertoire; to further develop skills in performing in musical groups.,Content: Intermediate instrumental/vocal technique (dance technique for the study of African music), intermediate,strategies for effective practice, intermediate exercises in notational reading fluency, intermediate varied,instrumental/vocal repertoire, intermediate ensemble technique and practice.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC312",
    "Course": "African Music Outreach B Community Dev",
    "Description": "Aim: To introduce students to public sector ethnomusicology and arts administration, providing them with necessary,skills for running effective community arts programmes,Content: Folk festivals and folk life; festival management, marketing and publicity; public sector,ethnomusicology/applied ethnomusicology; proposal writing, fundraising and project management; arts advocacy;,curating exhibitions and programmes.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC316",
    "Course": "Choral Studies B",
    "Description": "Aim: Choral Studies B provides specialist training for choral directors including conducting, choral/vocal technique, sight,singing, repertoire studies, critical thinking and academic writing skills.,Content: Specialist conducting technique, physiology of the voice, advanced vocal and choral exercises, preparing and,analysing musical scores, rehearsal technique, sight singing, techniques for listening to and assessing choral music,,critical thought as it relates to choirs and choral music, developing a personal academic writing style.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC320",
    "Course": "Composition B",
    "Description": "Aim: The aim of the module is to train versatile composers and for students to assemble a portfolio of compositions that,demonstrates that versatility.,Content: Advanced analysis of music and numerous compositional and arrangement techniques,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC324",
    "Course": "Music and Society 3B",
    "Description": "Aim: Music and Society 3B develops a high level of understanding and critical evaluation of musical traditions by,continuing to explore the history, structure and significance of music to peoples and cultures world-wide. Students,continue to learn at an advanced level about musical genres, approaches to composition, changing musical styles and,expression.,Content: Varies from year to year and may include such topics as: music and the brain; music therapy; music in film;,music and gender; indigenous bow music of Southern Africa; Miles Davis; musical constructions of space; and WA,Mozart: Vesperae Solennes De Confessore – K339.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC328",
    "Course": "Music Technology B",
    "Description": "Aim: To provide students with fundamental skills and knowledge that form the basis of music creation, production and,distribution used in the music and broadcast industry as well as audio visual environments today.,Content: Sound, Audio, Music Production, MIDI, Computer Notation and CAI.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC332",
    "Course": "Music Theory and Perception 3B",
    "Description": "Aim: Two different streams are offered within this module. In both the students will be equipped with an understanding,of key terms, concepts and symbols, general principles of harmonic usage, a variety of compositional techniques, and,methods of analysis, illustrated with examples primarily drawn from the field of specialization but always with an,awareness of relationships with other musical styles.,Content: Western classical specialization: Compositional techniques in post-tonal and atonal styles; analyticaltechniques for 20th and 21st-century music; detailed analysis of selected non-tonal compositions Jazz specialization:Introduction to serialism; compound and twelve-note chords; mirror writing and palindromes; isorhythm and isomelos;pandiatonicism; orchestration techniques Both specializations: Analytical listening with examples from the area ofspecialization."
  },
  {
    "Institution": "UKZN",
    "Code": "MUSC336",
    "Course": "Musicology B",
    "Description": "Aim: To build on students knowledge of the theoretical underpinnings of music research covered in Musicology A. To,seek practical applications of theory in a topic related to any aspect of music making that resonates with the students,own interest and experience. These applications will not involve interviews,Content: Developing a research question; literature review; theoretical and methodological positions; summarizing and,discussing a selection of 4- 6 readings; exploring music-making context in a particular context; representation,information.,"
  },
  {
    "Institution": "UKZN",
    "Code": "PPOL808",
    "Course": "Monitoring Evaluation and Analysis",
    "Description": "Aim: To develop a sound theoretical, practical and experiential understanding and application of public policy monitoring,,evaluation and analysis in South African contexts.,Content: Definitions and concepts of policy monitoring and evaluation, evaluation processes, types, rationale and,purposes; approaches and techniques of policy analysis, policy structuring, theoretical and judgement forecasting; theory,mapping, modelling, scenario planning, impact assessment, integration of theory and practice in public policy monitoring,,evaluation and analysis.,Practicals: Fieldwork application of classroom learning - project policy analysis, public policy monitoring, evaluation of,project processes and outcomes.,"
  },
  {
    "Institution": "UKZN",
    "Code": "PSYC814",
    "Course": "Research Methods in Psychology",
    "Description": "Aim: The overall aim is to equip students with advanced knowledge and skills in paradigmatic foundations of research,,including the analysis and interpretation of data using qualitative or quantitative methods. This module contributes to the,basic theoretical and practical foundation for conducting research as well as an understanding of good research practice,for interventions sensitive to cultural and contextual factors.,Content: Independent research related to specific aspects of the research process: qualitative research design,,quantitative research design, proposal writing, the ethics of social science research, data collection, data analysis, the,use of computer-based data analysis/management systems, and report writing. Seminars which address key theories in,health and psychology may also be included.,"
  },
  {
    "Institution": "UKZN",
    "Code": "SOCY101",
    "Course": "Introduction to Sociology",
    "Description": "Aim: To develop one's sociological imagination through the practice of thinking sociologically, and adopting a,sociological perspective to examining social issues in South Africa and Africa in a systematic and critical way.,Content: May include (but is not limited to): The sociological imagination; key theorists and theoretical perspectives;,social research methods; societies; culture; and groups and organisation.,"
  },
  {
    "Institution": "UKZN",
    "Code": "SOCY301",
    "Course": "Contemporary Sociological Theory",
    "Description": "Aim: Introducing students to contemporary sociological theories and thinkers, by building on and connecting to their,knowledge and application of classical sociological theories,Content: he course may include (but is not limited to): Key contemporary theorists (Western and African included), key,themes, concepts, debates and questions, including discussions on scientific knowledge in the social sciences.,Additional perspectives, topics, examples and case studies from South Africa and Africa will be examined.,"
  },
  {
    "Institution": "UKZN",
    "Code": "SOCY720",
    "Course": "Clinical Sociology Methods and Applications",
    "Description": "Aim: This course introduces students to methodological skills, ethical practice, Clinical and applied methodology and,,professional ethics, required for working with clients; these include effective engagement, active listening, interviewing,,,assessment and goal setting. Focus is placed on the whole person in the sociological model.,,Content: The module content centres around research applications, Clinical Sociology concepts and methodologies;,,research foundations; Sociological perspectives, Applied and Clinical Sociology, defining the Applied and Clinical field(s).,,Students study the professional field via ethical implications of social practice.,,"
  },
  {
    "Institution": "UKZN",
    "Code": "SOCY7RC",
    "Course": "Research Project Clinical Sociology",
    "Description": "Aim: This course aims to facilitate the design and execution of a Clinical model, supervised research project. Clinical,sociologists specialize in one or two levels of intervention, when developing models; the practitioner will move among a,number of levels (e.g., individual, organization and community) in order to analyse and/or intervene.,Content: The module content centres around, identifying a social problem and developing a Clinical intervention,culminating in a written research project. Areas included in the research project includes research methodology,,theoretical approaches, Clinical interventions, data collection and analysis and writing up a research report.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ZULM101",
    "Course": "Introduction to IsiZulu A",
    "Description": "Aim: To introduce learners to the study of isiZulu grammar, history and culture.,Content: Aspects of isiZulu grammar, Modern prose and language awareness.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ZULU718",
    "Course": "Theories of Orality & the Zulu Tradition",
    "Description": "Aim: This module looks at the form, function and effect of the traditional form of orality and its various sub genres. This,module introduces learners to the various general theories of orality which serves as a basis for an historical survey of,older forms juxtaposed to the modern counterparts and its current mutations. It investigates the ongoing validity and,relevance of this oral art form in modern society. The learner is expected to be able to compare and contrast the different,approaches and theories of orality and to evaluate them critically.,Content: General theories of orality (e.g. Finnegan, Jousse, Scheub, Axel-Olrik, Levi Strauss); traditional oral forms of,Zulu poetry e.g. praise poetry, songs, lyrics, proverbs & idioms etc.; traditional oral forms of Zulu narrative e.g. folktales,,myths & legends.,"
  },
  {
    "Institution": "UKZN",
    "Code": "AMET212",
    "Course": "Environmental Instruments:Life/Earth Sciences",
    "Description": "Aim: To provide students taking agriculture and environmental science options with the skills to set up an automatic,weather station.,Content: Datalogging measurement and control techniques using an automatic weather station (AWS) and other,sensors for measurement and control purposes. Internet techniques, information retrieval and storage and data display.,Practicals: Identifying, checking electronic components. Use of an AWS. Grass reference estimation; fire index; wind,chill and chilling index estimation. Internet techniques, information retrieval and storage and data display.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ENVS210",
    "Course": "Biophysical Environments of Southern Africa",
    "Description": "Aim: To introduce students to the physical processes that shape the biophysical environment in southern Africa.,Content: Weather producing systems and southern African climates and their variability; the biogeography of the region,in terms of the distribution of biota through climatic and other environmental factors; a discussion of biomes, biodiversity,and conservation; the properties of geomorphic materials as well as erosion, transport and deposition processes that,shape and modify the landscape.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ENVS315",
    "Course": "Soil Erosion and Land Degradation",
    "Description": "Aim: To introduce the processes, social & physical consequences of soil erosion & land degradation issues in Africa.,Content: Land degradation & sustainability; causes & consequences of degradation; risk assessment in relation to the,sustainability of soil; food security & degradation; political & socio-economic aspects of soil erosion; physical & chemical,erosion processes; human-environment processes & influences; conservation practices; magnitude-frequency,considerations; desertification; land use systems in a historical context; soil conservation strategies; principles, planning,& policy issues.,Practicals: Case studies & applications. Possible four day excursion.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ENVS322",
    "Course": "Environmental Management",
    "Description": "Aim: To develop an understanding of environmental management theory and practice.,Content: Theoretical and critical examination of the issues of environmental management by examining the history of,environmentalism and mainstream approaches and their alternatives. The relationship between environment and,planning; examination of the different tools and methods used in environmental management.,Practicals: Use of methods and techniques related to environmental management tools.,"
  },
  {
    "Institution": "UKZN",
    "Code": "GEOG220",
    "Course": "Geographies of Urban and Rural Change",
    "Description": "Aim: To introduce students to spatial transformations in urban and rural contexts in southern Africa.,Content: Spatial transformations in urban and rural contexts are explored in light of appropriate theory drawn from urban,,economic, cultural and political geography. Regional change is interpreted in the context of post-apartheid planning and,development practice, as well as in the global economy. Particular attention is paid to contested urban landscapes and,new urban forms; the impact of land reform initiatives & the spatial impacts of development theory and planning.,"
  },
  {
    "Institution": "UKZN",
    "Code": "GEOG314",
    "Course": "Land Issues and Rural Development in SA",
    "Description": "Aim: To deepen understanding of land issues in the African context.,Content: Explanations of rural poverty (including globalization and HIV/AIDS). Historical background to the land question,in Southern Africa. Land demand and use in Southern Africa. Natural resources and rural development, rural livelihoods,and food security. Women/gender and rural development, and enhancing conditions for the promotion of rural,development.,"
  },
  {
    "Institution": "UKZN",
    "Code": "Aim: To develop an understanding of sustainable urban processes in Sub-",
    "Course": "GEOG220",
    "Description": "Saharan Africa, and to appraise these in the context of development theory and practice. Content: Contemporary transformation and urban change within cities; strategies for urban sustainability and growth. Urban policies,,democratization, decentralization and social movements. People-land relationships and urban land use in Africa.,"
  },
  {
    "Institution": "UKZN",
    "Code": "COMP102",
    "Course": "Computer Programming",
    "Description": "Aim: To introduce students to programming in a high level language.,Content: Procedural programming in a high level programming language. Structured data types. Sorting. Searching.,Recursion. Program testing. Program documentation. Introduction to object-oriented programming.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MATH130",
    "Course": "Introduction to Calculus",
    "Description": "Aim: To introduce and develop the Differential Calculus as well as the fundamentals of proof technique and rudimentary,logic.,Content: Fundamental Concepts - elementary logic, proof techniques. Differential Calculus - Functions, graphs and,inverse functions, limits and continuity, the derivative, techniques of differentiation, applications of derivatives,,antiderivatives.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MATH212",
    "Course": "Advanced Calculus & Linear Algebra",
    "Description": "Aim: To give a coherent treatment of basic theories & problem solving techniques from Advanced Calculus and LinearAlgebra and their applications.Content: Advanced Calculus: Functions of several variables. Partial derivatives, differentiability, chain rules, implicitdifferentiation. Extrema and Lagrange multipliers. Multiple integrals, change of variables. Linear algebra: axioms forvector spaces. Linear independence, bases and dimension. Matrices and linear transformations. Change of basis.Eigenvectors and eigenvalues, diagonalization and its applications (including linear differential equations). Orthogonality,Gram-Schmidt process."
  },
  {
    "Institution": "UKZN",
    "Code": "ECON111",
    "Course": "Intro to Economic Concepts",
    "Description": "Content: This one-semester course investigates important economic concepts like scarcity, unemployment, inflation,,economic growth, the market, social injustice and inequality that are frequently encountered in the media. The course,explains both microeconomic and macroeconomic concepts that are applied to case studies from South Africa and,abroad.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ECON102",
    "Course": "Principles of Macroeconomics",
    "Description": "Content: An introduction to macroeconomics. The operation of the money market is examined, and the main,components of expenditure (consumption, investment, government spending and net exports) are used to build simplemacroeconomic models. Fiscal and monetary policy tools and their ability to influence key macroeconomics concerns ofinflation, unemployment and growth are assessed."
  },
  {
    "Institution": "UKZN",
    "Code": "ECON202",
    "Course": "Intermediate Microeconomics & Applications",
    "Description": "Content: Intermediate microeconomics and applications. This module covers intermediate microeconomic theory, its,application to solving real-world economic problems and the analysis of policy-related issues. Traditional theories of,consumer (utility) behaviour and production (output and profit optimisation) behaviour are examined. In addition, students,are exposed to modern theories – such as game theory and transaction cost theory. Applications include the analysis of,risk in consumption, investment and insurance decisions and the efficient allocation of resources and output under,welfare economics.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ECON309",
    "Course": "Macroeconomic Policy in SA",
    "Description": "Content: The theoretical foundations of macroeconomics are used to understand the objectives of and conflicts in,macroeconomic policy. The module will examine monetary policy and the S.A. financial system, as well as fiscal and,budgetary policy. Open-economy macroeconomic issues will be analysed, as will the co-ordination between monetary,,fiscal and balance of payments policies.,"
  },
  {
    "Institution": "UKZN",
    "Code": "LAWS1LS",
    "Course": "Introductory Legal Studies",
    "Description": "Content: : Introduction to Law will provide students with a basic background to law and the legal system in South Africa.,Students will acquire an understanding of: -Some legal philosophies and be able to apply these philosophies to current,legal situations. -The structure of the legal system and be able to identify the correct tribunal and procedure. -The sources,and classifications of South African Law. -The basic principles of criminal law and be able to apply these principles to a,factual scenario.,"
  },
  {
    "Institution": "UKZN",
    "Code": "LAWS3CS",
    "Course": "Constitutional Law",
    "Description": "Content: Fundamental concepts and theories of constitutional law; South African constitutional history; basic structures,of the South African Constitution; the structure of states; electoral systems; the composition, powers, responsibility, and,limits of the legislatures; the composition, powers, responsibility and limits of the executive; the composition, powers,,responsibility and limits of the judiciary; the operational provisions of the Bill of Rights; discussion on selected Chapter 9,Institutions.,"
  },
  {
    "Institution": "UKZN",
    "Code": "LAWS3FM",
    "Course": "Family Law",
    "Description": "Content: Part A: The Law relating to marriages, including customary and religious marriages; civil-unions and,cohabitative relationships: specifically engagements; legal requirements for the conclusion of a marriage/civil union; legal,consequences of a marriage/civil-union;dissolution of marriages/civil-unions as well as the consequences thereof; and,,the legal duties between cohabitees. Part B: Law of Parent and Child/ Care and Protection of Children: childrens rights;,parental rights and responsibilities; discipline and the childs right to choose; child abuse; temporary alternative care;,adoption; trans-jurisdictional aspects; education.,"
  },
  {
    "Institution": "UKZN",
    "Code": "LAWS2LP",
    "Course": "Law of Persons",
    "Description": "Content: Legal personality (the beginning and end of legal personality); Status and capacity: Factors affecting status:,domicile; gender; age (minority); extra-marital birth (legitimacy)-includes parental power and adoption of extra-marital,children; artificial insemination; proof of paternity; mental illness; prodigality; and inability to manage ones own affairs.,"
  },
  {
    "Institution": "UKZN",
    "Code": "LAWS2LW",
    "Course": "Interpretation of Law",
    "Description": "Content: Introduction; basic concepts and an historical overview; nature and process of interpretation; Theories of,interpretation: the textual approach; the literal approach; the contextual approach; the current approach of courts; general,aids to interpretation; internal and external aids; restrictive and extensive interpretation; maxims; presumptions; a critical,analysis of the Interpretation Act 33 of 1957; constitutional interpretation; basic principles of constitutional interpretation.,"
  },
  {
    "Institution": "UKZN",
    "Code": "ENTR2IE",
    "Course": "Introduction to Entrepreneurship",
    "Description": "Aim: The aim of the module is to provide an introduction to the theoretical base and practical applications of the principles,and concepts underlying entrepreneurship. The course explains the nature and fundamentals of entrepreneurship, how,business opportunities are identified and developed into a successful business venture.,Content: Nature and fundamentals of entrepreneurship; Identification of entrepreneurial opportunities; Implementation,of management functions in an entrepreneurial business; Launching and running a successful entrepreneurial venture;,Growing and developing an entrepreneurial venture,"
  },
  {
    "Institution": "UKZN",
    "Code": "MGNT2SM",
    "Course": "Responsible and Sustainable Mgnt Principles",
    "Description": "Aim: This module aims to provide an overview of the nature and fundamentals of responsible and sustainable,management and leadership; the role, dynamics, and impact of corporations in the creation of sustainable social,,environmental and economic value, critical issues relating to global and national social responsibility, governance and,sustainability.,Content: Interrogating WHAT sustainability is about, and WHY it is important to think about and to understand,sustainability principles and practices. Exploring HOW business enterprises can honour sustainable management,principles, through sustainable management practices,"
  },
  {
    "Institution": "UKZN",
    "Code": "MARK2MK",
    "Course": "Introduction to Marketing",
    "Description": "Aim: The aim of this module is to introduce students to the conceptual and theoretical foundations underlying Marketing.,It serves as a stand alone module but also as the basis for the more advanced level modules offered in the discipline.,Content: An overview of Marketing and its organisation within the business entity; Analysis of the marketing,environment; Understanding consumer decision making; Marketing Information Systems and Market Research;,Overview of Marketing Strategy; Segmentation, targeting and positioning; Product decisions; Marketing Channels and,the role of intermediaries; Promotional Strategies and Marketing communications; Pricing Concepts; Overview of the,marketing plan.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MARK302",
    "Course": "Marketing Communications",
    "Description": "Aim: This module aims to develop students understanding of the theoretical foundations, strategies and decision-,making processes that underlie marketing communications, an important function of marketing.,Content: The course outlines the various promotional mix tools and the steps in developing marketing communications,,as well as the promotional-budgeting process used to enhance integrated marketing communications in an organization.,In examining the changing communications environment, students learn about the strategies used in marketing to,promote socially responsible marketing as well as techniques used to coordinate the promotion elements in order to,deliver a clear, consistent and compelling message about the organization and its products.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MARK305",
    "Course": "Special Topics in Marketing",
    "Description": "Aim: The aim of this module is to introduce learners to specialist areas and contemporary issues in Marketing.,Content: This module may include, but is not restricted to, advanced concepts, theories and principles of e-commerce,and e- marketing; customer-relationship marketing; marketing ethics; knowledge management and other specialist areas,in marketing such as services marketing and business-to-business marketing.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MGNT307",
    "Course": "Corporate Strategy",
    "Description": "Aim: The module aims to enable candidates to understand and apply the strategic management process. The module,focuses on the nature of strategic management and strategic direction; analysing the business environment; the different,levels of strategy; the organisational alignment and how a strategy can be implemented, managed and controlled.,Strategy will also be explored from entrepreneurial and responsible perspectives.,Content: The strategic management process is specifically explored as it establish company direction: vision, objectives,,strategies; industry and competitive analyses; evaluating resource and competitive capabilities; strategy and competitive,advantage; tailoring strategy to fit specific situations; strategy in diversified companies; building resource strengths and,core competencies; managing the internal organization; and related issues are explored.,"
  },
  {
    "Institution": "UKZN",
    "Code": "MGNT314",
    "Course": "Technology Management",
    "Description": "Aim: To provide an understanding of the specific context of the strategic management of technology in a contemporary,business environment, allowing students to gain an understanding of the dynamics of technology-intensive business and,to develop a knowledge and understanding of the formulation and implementation of business strategy for competitive,advantage in technology-competitive environments.,Content: An introduction to technology, technological innovation and technology strategy. The management of,uncertainty, and different ways to go about selecting innovation projects, ensuring that value is captured from innovation.,Intellectual property protection and the importance of technical standards and collaboration in high tech industries.,Creation and maintenance of competitive advantage in high technology industries, product development and the,management of new product development teams..,"
  }
]